[{"source": "Bleeping Computer", "title": "8 million people hit by data breach at US govt contractor Maximus", "link": "https://www.bleepingcomputer.com/news/security/8-million-people-hit-by-data-breach-at-us-govt-contractor-maximus/", "desc": "U.S. government services contractor Maximus has disclosed a data breach warning that hackers stole the personal data of 8 to 11 million people during the recent MOVEit Transfer data-theft attacks."}, {"source": "Bleeping Computer", "title": "NATO investigates alleged data theft by SiegedSec hackers", "link": "https://www.bleepingcomputer.com/news/security/nato-investigates-alleged-data-theft-by-siegedsec-hackers/", "desc": "NATO has confirmed that its IT team is investigating claims about an alleged data-theft hack on the Communities of Interest (COI) Cooperation Portal by a hacking group known as SiegedSec."}, {"source": "Bleeping Computer", "title": "Over 400,000 corporate credentials stolen by info-stealing malware", "link": "https://www.bleepingcomputer.com/news/security/over-400-000-corporate-credentials-stolen-by-info-stealing-malware/", "desc": "The analysis of nearly 20 million information-stealing malware logs sold on the dark web and Telegram channels revealed that they had achieved significant infiltration into business environments."}, {"source": "Bleeping Computer", "title": "Colorado State University says data breach impacts students, staff", "link": "https://www.bleepingcomputer.com/news/security/colorado-state-university-says-data-breach-impacts-students-staff/", "desc": "Colorado State University (CSU) has confirmed that the Clop ransomware operation stole sensitive personal information of current and former students and employees during the recent MOVEit Transfer data-theft attacks."}, {"source": "Bleeping Computer", "title": "Deutsche Bank confirms provider breach exposed customer data", "link": "https://www.bleepingcomputer.com/news/security/deutsche-bank-confirms-provider-breach-exposed-customer-data/", "desc": "Deutsche Bank AG has confirmed to BleepingComputer that a data breach on one of its service providers has exposed its customers' data in a likely MOVEit Transfer data-theft attack."}, {"source": "Bleeping Computer", "title": "HCA confirms breach after hacker steals data of 11 million patients", "link": "https://www.bleepingcomputer.com/news/security/hca-confirms-breach-after-hacker-steals-data-of-11-million-patients/", "desc": "HCA Healthcare disclosed a data breach impacting an estimated 11 million patients who received care at one of its hospitals and clinics after a threat actor posted samples of stolen data on a hacking forum."}, {"source": "Bleeping Computer", "title": "Razer investigates data breach claims, resets user sessions", "link": "https://www.bleepingcomputer.com/news/security/razer-investigates-data-breach-claims-resets-user-sessions/", "desc": "Gaming gear company Razer reacted to recent rumors of a massive data breach with a short statement on Twitter, letting users know that they started an investigation into the matter."}, {"source": "Bleeping Computer", "title": "Nickelodeon investigates breach after leak of 'decades old’ data", "link": "https://www.bleepingcomputer.com/news/security/nickelodeon-investigates-breach-after-leak-of-decades-old-data/", "desc": "Nickelodeon has confirmed that the data leaked from an alleged breach of the company is legitimate but some of it appears to be decades old."}, {"source": "Bleeping Computer", "title": "Microsoft denies data breach, theft of 30 million customer accounts", "link": "https://www.bleepingcomputer.com/news/security/microsoft-denies-data-breach-theft-of-30-million-customer-accounts/", "desc": "Microsoft has denied the claims of the so-called hacktivists \"Anonymous Sudan\" that they breached the company's servers and stole credentials for 30 million customer accounts."}, {"source": "Bleeping Computer", "title": "Siemens Energy confirms data breach after MOVEit data-theft attack", "link": "https://www.bleepingcomputer.com/news/security/siemens-energy-confirms-data-breach-after-moveit-data-theft-attack/", "desc": "Siemens Energy has confirmed that data was stolen during the recent Clop ransomware data-theft attacks using a zero-day vulnerability in the MOVEit Transfer platform."}, {"source": "Bleeping Computer", "title": "Hackers steal data of 45,000 New York City students in MOVEit breach", "link": "https://www.bleepingcomputer.com/news/security/hackers-steal-data-of-45-000-new-york-city-students-in-moveit-breach/", "desc": "The New York City Department of Education (NYC DOE) says hackers stole documents containing the sensitive personal information of up to 45,000 students from its MOVEit Transfer server."}, {"source": "Bleeping Computer", "title": "American Airlines, Southwest Airlines disclose data breaches affecting pilots", "link": "https://www.bleepingcomputer.com/news/security/american-airlines-southwest-airlines-disclose-data-breaches-affecting-pilots/", "desc": "American Airlines and Southwest Airlines, two of the largest airlines in the world, disclosed data breaches on Friday caused by the hack of Pilot Credentials, a third-party vendor that manages multiple airlines' pilot applications and recruitment portals."}, {"source": "Bleeping Computer", "title": "MOVEIt breach impacts Genworth, CalPERS as data for 3.2 million exposed", "link": "https://www.bleepingcomputer.com/news/security/moveit-breach-impacts-genworth-calpers-as-data-for-32-million-exposed/", "desc": "PBI Research Services (PBI) has suffered a data breach with three clients disclosing that the data for 4.75 million people was stolen in the recent MOVEit Transfer data-theft attacks."}, {"source": "Bleeping Computer", "title": "iOttie discloses data breach after site hacked to steal credit cards", "link": "https://www.bleepingcomputer.com/news/security/iottie-discloses-data-breach-after-site-hacked-to-steal-credit-cards/", "desc": "Car mount and mobile accessory maker iOttie warns that its site was compromised for almost two months to steal online shoppers' credit cards and personal information."}, {"source": "Bleeping Computer", "title": "UPS discloses data breach after exposed customer info used in SMS phishing", "link": "https://www.bleepingcomputer.com/news/security/ups-discloses-data-breach-after-exposed-customer-info-used-in-sms-phishing/", "desc": "Multinational shipping company UPS is alerting Canadian customers that some of their personal information might have been exposed via its online package look-up tools and abused in phishing attacks."}, {"source": "Bleeping Computer", "title": "Over 100,000 ChatGPT accounts stolen via info-stealing malware", "link": "https://www.bleepingcomputer.com/news/security/over-100-000-chatgpt-accounts-stolen-via-info-stealing-malware/", "desc": "More than 101,000 ChatGPT user accounts have been compromised by information stealers over the past year, according to dark web marketplace data."}, {"source": "Bleeping Computer", "title": "Reddit hackers threaten to leak data stolen in February breach", "link": "https://www.bleepingcomputer.com/news/security/reddit-hackers-threaten-to-leak-data-stolen-in-february-breach/", "desc": "The BlackCat (ALPHV) ransomware gang is behind a February cyberattack on Reddit, where the threat actors claim to have stolen 80GB of data from the company."}, {"source": "Bleeping Computer", "title": "Millions of Oregon, Louisiana state IDs stolen in MOVEit breach", "link": "https://www.bleepingcomputer.com/news/security/millions-of-oregon-louisiana-state-ids-stolen-in-moveit-breach/", "desc": "Louisiana and Oregon warn that millions of driver's licenses were exposed in a data breach after a ransomware gang hacked their MOVEit Transfer security file transfer systems to steal stored data."}, {"source": "Bleeping Computer", "title": "Have I Been Pwned warns of new Zacks data breach impacting 8 million", "link": "https://www.bleepingcomputer.com/news/security/have-i-been-pwned-warns-of-new-zacks-data-breach-impacting-8-million/", "desc": "Zacks Investment Research (Zacks) has reportedly suffered an older, previously undisclosed data breach impacting 8.8 million customers, with the database now shared on a hacking forum."}, {"source": "Bleeping Computer", "title": "Swiss government warns of ongoing DDoS attacks, data leak", "link": "https://www.bleepingcomputer.com/news/security/swiss-government-warns-of-ongoing-ddos-attacks-data-leak/", "desc": "The Swiss government has disclosed that a recent ransomware attack on an IT supplier might have impacted its data, while today, it warns that it is now targeted in DDoS attacks."}]