[{"source": "DataBreaches", "title": "AlphV responds to MGM incident and sloppy reporting", "desc": "AlphV has posted a statement about their attack on MGM Resorts. They also post some scathing criticisms of journalists and news outlets for reporting inaccurately and not verifying sources. Of note, their statement also asserts, “The ALPHV ransomware group has not before privately or publicly claimed responsibility for an attack before this point. Rumors...", "link": "https://www.databreaches.net/alphv-responds-to-mgm-incident-and-sloppy-reporting/"}, {"source": "DataBreaches", "title": "FL: Hillsborough County Public Schools cyberattack claimed by LockBit3.0", "desc": "LockBit has added Hillsborough County Public Schools in Florida to their leak site today.  They claim to have acquired 2 TB of data, and provide a file list and some sample files. The sample files are routine types of district files. One did contain personal and medically related information on students.  The file list...", "link": "https://www.databreaches.net/fl-hillsborough-county-public-schools-cyberattack-claimed-by-lockbit3-0/"}, {"source": "DataBreaches", "title": "Identity of NSA hacker behind cyberattack on China’s leading aviation university identified; to be disclosed in due course: source", "desc": "Yuan Hong reports: During the investigation of the cyberattack against Northwestern Polytechnical University (NPU), a leading Chinese aviation university, China has successfully extracted multiple samples of the spyware named SecondDate, and with the collaborative efforts of partners in various countries, the real identity of the US’ National Security Agency (NSA) personnel responsible for launching...", "link": "https://www.databreaches.net/identity-of-nsa-hacker-behind-cyberattack-on-chinas-leading-aviation-university-identified-to-be-disclosed-in-due-course-source/"}, {"source": "DataBreaches", "title": "New Europol report shines light on multi-billion euro underground criminal economy", "desc": "The world is getting smaller, as trade, communication and infrastructure on a global scale brings us closer together. However, there is another, darker, side to the coin: our interconnected world is being abused by criminals who have created an underground economy to sustain their illegal operations. Europol’s first ever threat assessment on the topic,...", "link": "https://www.databreaches.net/new-europol-report-shines-light-on-multi-billion-euro-underground-criminal-economy/"}, {"source": "DataBreaches", "title": "MGM and Caesars Hacked by Same Group in Span of a Few Weeks", "desc": "William Turton, Christopher Palmeri, and Katrina Manson report: MGM Resorts International was hacked by the same group of attackers that breached Caesars Entertainment Inc. weeks earlier, according to four people familiar with the matter. The hackers demanded a ransom from MGM, according to two of the people. It wasn’t immediately clear how much ransom was requested or...", "link": "https://www.databreaches.net/mgm-and-caesars-hacked-by-same-group-in-span-of-a-few-weeks/"}, {"source": "DataBreaches", "title": "Suspected ransomware attack hits Auckland Transport’s Hop cards", "desc": "1News reports: A suspected ransomware attack is affecting Auckland Transport’s Hop card system, impacting card top-ups and leaving customer service centres with limited functionality. “Early indications are that this is a ransomware attack however our investigations are ongoing,” an Auckland Transport (AT) spokesperson told 1News. No personal or financial data has been accessed. Read...", "link": "https://www.databreaches.net/suspected-ransomware-attack-hits-auckland-transports-hop-cards/"}, {"source": "DataBreaches", "title": "IOCTA spotlight report on malware-based cyber-attacks published", "desc": "Following the Internet Organised Crime Assessment (IOCTA) 2023, today Europol published the spotlight report “Cyber Attacks: The Apex of Crime-as-a-Service”. It examines developments in cyber-attacks, discussing new methodologies and threats as observed by Europol’s operational analysts. The report also outlines the types of criminal structures that are behind cyber-attacks, and how these increasingly professionalised groups are...", "link": "https://www.databreaches.net/iocta-spotlight-report-on-malware-based-cyber-attacks-published/"}, {"source": "DataBreaches", "title": "FBI Tech Tuesday: Building a Digital Defense Against “Oops, Wrong Number!” Texts", "desc": "Here’s another good tip to pass along to your kids or others who might be too trusting or vulnerable.  FBI El Paso Special Agent Jeanette Harper explains: We’ve all seen these text messages. The texts addressed to someone else pops up on your phone about either a business meeting, veterinarian appointment, or a friendly...", "link": "https://www.databreaches.net/fbi-tech-tuesday-building-a-digital-defense-against-oops-wrong-number-texts/"}, {"source": "DataBreaches", "title": "HC3: Sector Alert: Akira Ransomware", "desc": "September 12, 2023 TLP:CLEAR Report: 202309121400 Akira Ransomware Executive Summary Akira is a Ransomware-as-a-Service (RaaS) group that started operations in March 2023. Since its discovery, the group has claimed over 60 victims, which have typically ranged in the small- to medium-size business scale. Akira has garnered attention for a couple of reasons, such as...", "link": "https://www.databreaches.net/hc3-sector-alert-akira-ransomware/"}, {"source": "DataBreaches", "title": "Caesars Entertainment paid millions to hackers in attacks", "desc": "Caesars Entertainment Inc. paid tens of millions of dollars to hackers who broke into the company’s systems in recent weeks and threatened to release the company’s data, according to two people familiar with the matter. Caesars is expected to disclose the cyberattack in a regulatory filing soon, the people said. The revelation of the...", "link": "https://www.databreaches.net/caesars-entertainment-paid-millions-to-hackers-in-attacks/"}, {"source": "DataBreaches", "title": "Chambersburg Area School District answers some questions about ransomware attack, won’t say if they paid hackers", "desc": "A statement and FAQ by the Chambersburg Area School District, as shared by TriState Alert, appears below.The district offers its reasons (translation: excuses) for not answering the questions parents and the public really want to know:  did the district pay ransom, and was personal information acquired by the attackers? Although the district did not...", "link": "https://www.databreaches.net/chambersburg-areas-school-district-answers-some-questions-about-ransomware-attack-wont-say-if-they-paid-hackers/"}, {"source": "DataBreaches", "title": "MGM Resorts incident: social engineering strikes again?", "desc": "If the claims of someone in an AlphV (BlackCat) subgroup known for social engineering skills are true — and vx-underground believes their source is credible, then …. words fail: All ALPHV ransomware group did to compromise MGM Resorts was hop on LinkedIn, find an employee, then call the Help Desk. A company valued at...", "link": "https://www.databreaches.net/mgm-resorts-incident-social-engineering-strikes-again/"}, {"source": "DataBreaches", "title": "PA: Butler County Experienced Security Breach With Jail Employee Email", "desc": "Tyler Friel reports: A cyber event last month may have affected the security of some information maintained by Butler County. County officials say they found out August 8th that an email account related to the County jail was sending unauthorized spam emails. Read more at Butler Radio.", "link": "https://www.databreaches.net/pa-butler-county-experienced-security-breach-with-jail-employee-email/"}, {"source": "DataBreaches", "title": "Disclose data breaches to us proactively, and we’ll lower any fines — ICO", "desc": "Emma Woollacott reports: British businesses could face lower fines if they proactively report data breaches, thanks to an agreement between the UK’s data protection regulator and cybersecurity agency. The Information Commissioner’s Office (ICO) and National Cyber Security Centre (NCSC) say they plan to encourage engagement with the NCSC in the event of a breach, and allow...", "link": "https://www.databreaches.net/disclose-data-breaches-to-us-proactively-and-well-lower-any-fines-ico/"}, {"source": "DataBreaches", "title": "MO: Cyberattack causes multiple court systems to shut down some public safety computer servers", "desc": "Kelsey Landis reports: A cyberattack caused St. Louis County to shut down some computer systems used to look up court cases, issue charges and process people in custody at the jail, County Executive Sam Page said Tuesday. Police officers, jail officials, the county counselor, municipal court officials and the prosecuting attorney’s office all use...", "link": "https://www.databreaches.net/mo-cyberattack-causes-multiple-court-systems-to-shut-down-some-public-safety-computer-servers/"}, {"source": "DataBreaches", "title": "Conti member indicted for role in 2021 Scripps Health ransomware attack", "desc": "On September 7, the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC), in coordination with the United Kingdom, sanctioned 11 individuals who are alleged to be part of the Russia-based Trickbot cybercrime group. At the same time, the U.S. Department of Justice (DOJ)  unsealed indictments against nine individuals in connection with...", "link": "https://www.databreaches.net/conti-member-indicted-for-role-in-2021-scripps-health-ransomware-attack/"}, {"source": "DataBreaches", "title": "Texas Medical Liability Trust updates its data breach notification; now provides notification on behalf of almost 60,000 individuals", "desc": "In March, Texas Medical Liability Trust on behalf of itself and its affiliates, Texas Medical Insurance Company, Physicians Insurance Company, and Lone Star Alliance, Inc., a Risk Retention Group (collectively “TMLT”) filed a breach notification with the Maine Attorney General’s Office. That submission indicated that 625 individuals had been affected by a breach that...", "link": "https://www.databreaches.net/texas-medical-liability-trust-updates-its-data-breach-notification-now-provides-notification-on-behalf-of-almost-60000-individuals/"}, {"source": "DataBreaches", "title": "Facebook Messenger phishing wave targets 100K business accounts per week", "desc": "Bill Toulas reports: Hackers use a massive network of fake and compromised Facebook accounts to send out millions of Messenger phishing messages to target Facebook business accounts with password-stealing malware. The attackers trick the targets into downloading a RAR/ZIP archive containing a downloader for an evasive Python-based stealer that grabs cookies and passwords stored...", "link": "https://www.databreaches.net/facebook-messenger-phishing-wave-targets-100k-business-accounts-per-week/"}, {"source": "DataBreaches", "title": "U.K. ICO prosecution: Rachel Anderton", "desc": "From the U.K.’s Information Commissioner’s Office: A former family intervention officer at St Helens Borough Council has been sentenced for unlawfully accessing social services records. Rachel Anderton was prosecuted for viewing records on the council’s case management system between 17 January 2019 and 17 October 2019 without having a business need to do so....", "link": "https://www.databreaches.net/u-k-ico-prosecution-rachel-anderton/"}, {"source": "DataBreaches", "title": "MI: Cybercrime investigation causes half-day for East Jackson schools", "desc": "Mitchell Kukulka reports: A potential cybercrime is causing classes to be cut to a half day in East Jackson Community Schools on Tuesday, Sept. 12, officials said. The incident currently is under investigation by the Blackman-Leoni Department of Public Safety. School officials learned of the potential cybercrime Tuesday morning, Superintendent Steve Doerr said. Read...", "link": "https://www.databreaches.net/mi-cybercrime-investigation-causes-half-day-for-east-jackson-schools/"}, {"source": "DataBreaches", "title": "Save the Children confirms systems breach", "desc": "Claudia Glover reports: Save the Children appears to have been hacked by the Chinese data extortion gang BianLian, according to data posted to the latter’s victim blog. Though it does not mention the charity by name, the cybercrime organisation claims to have stolen up to 8GB of files from an international NGO “employing over...", "link": "https://www.databreaches.net/save-the-children-confirms-systems-breach/"}, {"source": "DataBreaches", "title": "St. Paul Public Schools notifies families of data breach from February", "desc": "KSTP reports: St. Paul Public Schools notified families and staff last week of a “data security incident” last winter that may have exposed students’ names and email addresses. In a letter sent out on Friday, the district said it became aware of the issue in February and flagged the FBI, Minnesota IT Services and...", "link": "https://www.databreaches.net/st-paul-public-schools-notifies-families-of-data-breach-from-february/"}, {"source": "DataBreaches", "title": "Hospital Sisters Health System’s CFO exits as it continues to handle ‘cybersecurity incident’", "desc": "On August 29, DataBreaches reported that Hospital Sisters Health System (HSHS) and Prevea Health appeared to have been the victims of a ransomware attack. As of today, the notice on Prevea Health states, “HSHS and Prevea are experiencing a systemwide outage of clinical and administrative applications.” Prevea continues to describe it as a temporary...", "link": "https://www.databreaches.net/hospital-sisters-health-systems-cfo-exits-as-it-continues-to-handle-cybersecurity-incident/"}, {"source": "DataBreaches", "title": "MGM Resorts hit in disruptive cyberattack", "desc": "Long-time readers may recall a story in January 2017 about a luxury hotel that reportedly paid extortion to ransomware attackers because guests were locked in their rooms. Some of the story was ultimately considered to be fake news, although the whole scenario initially seemed possible at the time. Fast forward more than six years...", "link": "https://www.databreaches.net/mgm-grand-hit-in-disruptive-cyberattack/"}, {"source": "DataBreaches", "title": "Bloom Health Centers discloses data breach involving mental health data of 1,545 patients", "desc": "Updated September 13: This incident was reported to HHS as affecting 1,654 patients. On September 11, Psych Associates of Maryland LLC d/b/a Bloom Health Centers (“Bloom Health”), a mental health service provider, announced a data security incident that involved the personal and protected health information of some clinicians and patients. Before digging into the...", "link": "https://www.databreaches.net/bloom-health-centers-discloses-data-breach-involving-mental-health-data-of-1545-patients/"}, {"source": "DataBreaches", "title": "California Privacy Protection Agency publishes new draft regulations addressing AI, risk assessments, cyber audits", "desc": "Philip N. Yannella, Gregory P. Szewczyk, and Timothy Dickens of Ballard Spahr write: The California Privacy Protection Agency (CPPA) recently published two new sets of draft regulations addressing a range of cutting-edge data protection issues.  Although the CPPA has not officially started the formal rulemaking process, the Draft Cybersecurity Audit Regulations and the Draft Risk Assessment Regulations will...", "link": "https://www.databreaches.net/california-privacy-protection-agency-publishes-new-draft-regulations-addressing-ai-risk-assessments-cyber-audits/"}, {"source": "DataBreaches", "title": "Rhysida claims responsibility for attacks on two U.S. health systems: Prospect Medical Holdings, Singing River Health", "desc": "On August 3, Prospect Medical Holdings disclosed a ransomware attack that affected some of its 16 hospitals and 10 clinics, including three hospitals in Connecticut and hospitals run by Crozer Health. Although they have made some progress with recovery, a note on their website today states, “Prospect Medical Holdings, along with all Prospect Medical...", "link": "https://www.databreaches.net/rhysida-claims-responsibility-for-attacks-on-two-u-s-health-systems/"}, {"source": "DataBreaches", "title": "Brazil’s government convicted for data leak exposed by The Brazilian Report", "desc": "Amanda Audi reports: Federal government agencies were convicted for leaking data of beneficiaries of Auxilio Brasil, a flagship federal aid program now renamed as Bolsa Familia, to financial agencies offering payroll deduction loans to low-income Brazilians. Prior to elections last year, the administration of former President Jair Bolsonaro launched a program allowing people enrolled...", "link": "https://www.databreaches.net/brazils-government-convicted-for-data-leak-exposed-by-the-brazilian-report/"}, {"source": "DataBreaches", "title": "HHS Office for Civil Rights Settles with L.A. Care Health Plan Over Potential HIPAA Security Rule Violations", "desc": "LA Care, the largest publicly operated health plan in the country paid $1,300,000 to settle Today, the U.S. Department of Health and Human Services’ Office for Civil Rights (OCR) announced a settlement of potential violations of the Health Insurance Portability and Accountability Act (HIPAA) Rules with LA Care, the nation’s largest publicly operated health plan...", "link": "https://www.databreaches.net/hhs-office-for-civil-rights-settles-with-l-a-care-health-plan-over-potential-hipaa-security-rule-violations/"}, {"source": "DataBreaches", "title": "MS: Hinds County computer system remains under ransomware attack", "desc": "Angela Williams reports: Hinds County is still experiencing computer issues following a cyberattack. The tax collector’s office will remain closed on Monday. The Circuit Clerk Office has also canceled jury duty for the week. Hinds County Administrator, Kenny Wayne Jones said in a statement, “Our systems and networks are being assessed, the process is...", "link": "https://www.databreaches.net/ms-hinds-county-computer-system-remains-under-ransomware-attack/"}, {"source": "DataBreaches", "title": "Massive ransomware attack on Sri Lanka’s state email domain", "desc": "Sri Lanka Mirror reports: All Government offices using the “gov.lk” email domain, including the Cabinet Office, have lost data from May 17 to August 26, 2023, after a massive ransomware attack, the Information and Communication Technology Agency (ICTA) has confirmed. The virus could have affected around 5,000 email addresses, ICTA CEO Mahesh Perera said,...", "link": "https://www.databreaches.net/massive-ransomware-attack-on-sri-lankas-state-email-domain/"}, {"source": "DataBreaches", "title": "Russian man with Kremlin ties gets 9 years in US prison for hacking and insider trading scheme", "desc": "Alanna Durkin Richer reports: A wealthy Russian businessman with ties to the Kremlin was sentenced Thursday to nine years in prison for his role in a nearly $100 million stock market cheating scheme that relied on secret earnings information stolen through the hacking of U.S. computer networks. Vladislav Klyushin, who ran a Moscow-based information technology company...", "link": "https://www.databreaches.net/russian-man-with-kremlin-ties-gets-9-years-in-us-prison-for-hacking-and-insider-trading-scheme/"}, {"source": "DataBreaches", "title": "An inexcusable gap from breach to notification, or an excusable one?", "desc": "Some state and federal laws provide specific timeframes by which breached entities must provide notice to regulators and to those affected by a data breach. Unfortunately, loopholes abound, as we seen in statutory language such as Minnesota’s breach notification law, where for timing of notification, it says: “The disclosure must be made in the...", "link": "https://www.databreaches.net/an-inexcusable-gap-from-breach-to-notification-or-an-excusable-one/"}, {"source": "DataBreaches", "title": "Minnesota Department of Employment and Economic Development: security incident may have resulted in some job seekers’ contact info being compromised", "desc": "KSTP reports: The Minnesota Department of Employment and Economic Development (DEED) says it’s notified job seekers that a recent security incident may have resulted in some personal information being compromised. A DEED spokesperson says the agency recently received information about suspicious communications from one or more persons claiming to be representatives of an approved...", "link": "https://www.databreaches.net/minnesota-department-of-employment-and-economic-development-security-incident-may-have-resulted-in-some-job-seekers-contact-info-being-compromised/"}, {"source": "DataBreaches", "title": "Court certifies class action lawsuit against federal government over 2020 Canada Revenue Agency cyberattack", "desc": "Mitchell Consky reports: The Federal Court of Canada has certified a class action lawsuit against the federal government, which alleges negligence in “safeguarding the confidential information of Canadians, leading to widespread privacy breaches.” The suit follows cyberattacks that targeted Canada Revenue Agency accounts and other government services back in 2020. Read more at CTV...", "link": "https://www.databreaches.net/court-certifies-class-action-lawsuit-against-federal-government-over-2020-canada-revenue-agency-cyberattack/"}, {"source": "DataBreaches", "title": "Quick note: Two more school districts hit by cyberattacks: Skokie-Morton Grove, Decatur ISD", "desc": "Brett Callow of Emsisoft notes that LockBit has added Skokie-Morton Grove School District 69 in Illinois to their leak site. No proof of claim was posted and no description of any data allegedly stolen was provided. Elsewhere, The Messenger reports that Decatur ISD in Texas suspects a cybersecurity attack is responsible for the internet...", "link": "https://www.databreaches.net/quick-note-two-more-school-districts-hit-by-cyberattacks/"}, {"source": "DataBreaches", "title": "Coca-Cola FEMSA victim of ransomware attack and data leak", "desc": "Coca-Cola FEMSA is the bottler of Coca-Cola and its related soft drink products in much of Latin America, which makes it an important part of the Coca-Cola system. This week, a threat actor known to DataBreaches as “TheSnake” and as the person who had also hacked a Brazilian clinic, leaked some data from Coca-Cola...", "link": "https://www.databreaches.net/coca-cola-femsa-victim-of-ransomware-attack-and-data-leak/"}, {"source": "DataBreaches", "title": "Schneck Medical Center settles Indiana Attorney General’s lawsuit over 2021 data breach", "desc": "Jackson County Schneck Memorial Hospital (Schneck Medical Center) was a victim of a cyberattack in 2021. Its 2021 and 2022 disclosures about the breach and its lack of timely breach notification resulted in a potential class action lawsuit filed in 2022. Its lack of appropriate and timely disclosures and information patients needed to protect...", "link": "https://www.databreaches.net/schneck-medical-center-settles-indiana-attorney-generals-lawsuit-over-2021-data-breach/"}, {"source": "DataBreaches", "title": "Rite Aid, one of many victims in MOVEit breach, sued for negligence", "desc": "Rite Aid was one of numerous entities affected by the massive MOVEit breach. In July, they disclosed that 24,400 patients’ pharmacy information including medication names and dates of fill, prescriber information and limited insurance information was involved. They were notified by their vendor of the breach on May 31. Now it is reportedly being...", "link": "https://www.databreaches.net/rite-aid-one-of-many-victims-in-moveit-breach-sued-for-negligence/"}, {"source": "DataBreaches", "title": "Au: Dymocks warns shoppers after data breach; data already leaked", "desc": "Kathryn Magann reports: Bookstore chain Dymocks has warned customers of a possible data breach that could lead to their personal information being leaked on the dark web. In an email sent to members on Friday, the bookseller’s managing director, Mark Newman, said a potential hack was detected two days earlier. Read more at Bega...", "link": "https://www.databreaches.net/au-dymocks-warns-shoppers-after-data-breach-data-already-leaked/"}, {"source": "DataBreaches", "title": "Dallas delays release of report that reviews ransomware response", "desc": "Everton Bailey Jr. reports that if you were hoping to get the promised release of the report on Dallas’s response to the ransomware attack by Royal, you’ll have to wait at least two more weeks. The last council meeting ran late and the council never got to review the report, which needs to happen...", "link": "https://www.databreaches.net/dallas-delays-release-of-report-that-reviews-ransomware-response/"}, {"source": "DataBreaches", "title": "More than a year later, Lifeline Health Systems notifies 75,000 people of a data breach", "desc": "Lifeline Health Systems is a HIPAA-covered entity, although not all the data involved in their 2022 breach was protected health information. Some of the data related to employees and family members. But here’s the timeline Lifeline provides in their notification template: On August 6, 2022, we identified unusual network activity. We immediately initiated our...", "link": "https://www.databreaches.net/more-than-a-year-later-lifeline-health-systems-notifies-75000-people-of-a-data-breach/"}, {"source": "DataBreaches", "title": "The Blackbaud data breach — SuspectFile’s final chapter", "desc": "Marco A. De Felice of SuspectFile is my brother by another mother. We don’t speak the same language, and we wouldn’t know each other if we passed on a street, but he has the same genetic disorder that I have: a determination to uncover information that breached entities try to bury or ignore. Since...", "link": "https://www.databreaches.net/the-blackbaud-data-breach-suspectfiles-final-chapter/"}, {"source": "DataBreaches", "title": "Do IT Consultants victim of attack by Ragnar_Locker", "desc": "On September 2, Ragnar_Locker added Do IT Consultants in Canada to their “Wall of Shame.”  For its listing, they wrote: Due to high level negligence and careless network security of DO IT employees, has been allowed a huge leak which affected on clients of the DO IT company. No matter that they are an...", "link": "https://www.databreaches.net/do-it-consultants-victim-of-attack-by-ragnar_locker/"}, {"source": "DataBreaches", "title": "United States and United Kingdom Sanction Additional Members of the Russia-Based Trickbot Cybercrime Gang", "desc": "WASHINGTON — Today, the United States, in coordination with the United Kingdom, sanctioned eleven individuals who are part of the Russia-based Trickbot cybercrime group. Russia has long been a safe haven for cybercriminals, including the Trickbot group. Today’s action was taken by the U.S. Department of the Treasury’s Office of Foreign Assets Control (OFAC)....", "link": "https://www.databreaches.net/united-states-and-united-kingdom-sanction-additional-members-of-the-russia-based-trickbot-cybercrime-gang/"}, {"source": "DataBreaches", "title": "Experts Fear Crooks are Cracking Keys Stolen in LastPass Breach", "desc": "Uh oh. Brian Krebs reports: In November 2022, the password manager service LastPass disclosed a breach in which hackers stole password vaults containing both encrypted and plaintext data for more than 25 million users. Since then, a steady trickle of six-figure cryptocurrency heists targeting security-conscious people throughout the tech industry has led some security...", "link": "https://www.databreaches.net/experts-fear-crooks-are-cracking-keys-stolen-in-lastpass-breach/"}, {"source": "DataBreaches", "title": "“i know it hurts your little dick seeing a true hacker like me in a crowd full of skids and sheep,” said a man with no knowledge of anatomy", "desc": "After the arrest of  Breached.vc’s owner “Pompompurin” in March, Breached.vc was taken offline by an administrator because it seemed likely the server had been compromised by law enforcement. Months later, the domain was seized by law enforcement. The arrest of Pompompurin and shuttering of the popular hacking forum left a void for those looking...", "link": "https://www.databreaches.net/i-know-it-hurts-your-little-dick-seeing-a-true-hacker-like-me-in-a-crowd-full-of-skids-and-sheep-said-a-man-with-no-knowledge-of-anatomy/"}, {"source": "DataBreaches", "title": "The Government Isn’t Sure How to Get Small Hospitals to Take Cybersecurity Seriously", "desc": "Eric Geller reports: The U.S. government is struggling to convince hospitals that they need to spend time and money fighting hackers and provide useful advice to them, a problem that could have lethal consequences as the country’s ransomware crisis rages on. “I don’t think we’ve figured out how to talk to the small and...", "link": "https://www.databreaches.net/the-government-isnt-sure-how-to-get-small-hospitals-to-take-cybersecurity-seriously/"}, {"source": "DataBreaches", "title": "Bienville Orthopaedic Specialists notifies 243,000 patients of cyberattack", "desc": "On April 1, DataBreaches reached out to Bienville Orthopaedic Specialists (BOS) in Mississippi to ask about a claim by Abyss threat actors that they had compromised BOS. BOS never replied. But now, five months later, BOS submitted a breach notification to the Maine Attorney General’s Office.  The notification indicates that 242,986 people were affected...", "link": "https://www.databreaches.net/bienville-orthopaedic-specialists-notifies-243000-patients-of-cyberattack/"}, {"source": "DataBreaches", "title": "FTC Finalizes Order with 1Health.io Over Charges it Failed to Protect Privacy and Security of DNA Data and Unfairly Changed its Privacy Policy", "desc": "The Federal Trade Commission finalized an order with 1Health.io that settles charges that the genetic testing firm left sensitive genetic and health data unsecured, deceived consumers about their ability to get their data deleted, and changed its privacy policy retroactively without adequately notifying consumers and obtaining their consent. In a complaint first announced in June 2023,...", "link": "https://www.databreaches.net/ftc-finalizes-order-with-1health-io-over-charges-it-failed-to-protect-privacy-and-security-of-dna-data-and-unfairly-changed-its-privacy-policy/"}]