[{"source": "DataBreaches", "title": "Crooks pwned your servers? You’ve got four days to tell us, SEC tells public companies", "desc": "Jessica Lyons Hardcastle reports: Public companies that suffer a computer crime likely to cause a “material” hit to an investor will soon face a four-day time limit to disclose the incident, according to rules approved today by the US Securities and Exchange Commission. The SEC proposed the changes last March, and on Wednesday the financial watchdog...", "link": "https://www.databreaches.net/crooks-pwned-your-servers-youve-got-four-days-to-tell-us-sec-tells-public-companies/"}, {"source": "DataBreaches", "title": "CardioComm, a provider of ECG monitoring devices, confirms cyberattack downed its services", "desc": "Carly Page reports: CardioComm Solutions, a Canadian provider of consumer and professional-grade heart monitoring technologies, has been downed by an ongoing cybersecurity incident. The Toronto-based organization said on Tuesday that its business operations will be “impacted for several days and potentially longer” following a “cybersecurity incident on the Company’s servers.” At the time of...", "link": "https://www.databreaches.net/cardiocomm-a-provider-of-ecg-monitoring-devices-confirms-cyberattack-downed-its-services/"}, {"source": "DataBreaches", "title": "Recent NYS audits of K-12 school districts’ infosecurity", "desc": "A toot by Doug Levin yesterday reminded me that I haven’t posted NYS Comptroller audits of school districts in a while.  So here are three to get caught up: Jericho Union Free School District – Acceptable Use Policy (2022M-194) Issued Date: July 21, 2023 Audit Objective Determine whether Jericho Union Free School District (District)...", "link": "https://www.databreaches.net/recent-nys-audits-of-k-12-school-districts-infosecurity/"}, {"source": "DataBreaches", "title": "Leaking Someone’s Personal Data Will Cost You Up to $2 Million in Pakistan", "desc": "ProPK reports: A fine which may extend to $2 million or an equivalent amount in Pakistani rupees would be levied on those who process or cause to be processed, disseminate, or disclose personal data in violation of any of the provisions of the “Personal Data Protection Bill, 2023”. The Ministry of Information, Technology and...", "link": "https://www.databreaches.net/leaking-someones-personal-data-will-cost-you-up-to-2-million-in-pakistan/"}, {"source": "DataBreaches", "title": "Deloitte denies Cl0p data breach claims in wake of MOVEit attack", "desc": "Ross Kelly reports: Deloitte has refuted claims that the Cl0p ransomware gang has breached its systems and stolen company data amid speculation online. The accountancy firm was cited as a victim on Cl0p’s breach disclosure blog, sparking concerns that clients at the consultancy could be at risk. In its disclosure, Cl0p claimed “the company...", "link": "https://www.databreaches.net/deloitte-denies-cl0p-data-breach-claims-in-wake-of-moveit-attack/"}, {"source": "DataBreaches", "title": "Major Malaysian water utilities company hit by hackers; Ranhill offline; hackers claim databases and backups deleted", "desc": "After a period of quiet, DESORDEN Group has re-emerged as a threat to Malaysian entities, and now, it seems, to providing drinkable water to Johor (see this post from 2021 for an overview of Ranhill Utilities Berhad in the environment sector and the role of AquaSmart). In a statement sent to DataBreaches this morning, DESORDEN...", "link": "https://www.databreaches.net/major-malaysian-water-utilities-company-hit-by-hackers-ranhill-offline-hackers-claim-databases-and-backups-deleted/"}, {"source": "DataBreaches", "title": "Group-IB founder Ilya Sachkov sentenced to 14 years in prison for high treason", "desc": "As seen on Darknet News (EN): Group-IB founder Ilya Sachkov sentenced (https://t.me/vchkogpu/40233) to 14 years in prison for high treason The Moscow City Court sentenced to 14 years in prison the founder of Group-IB Ilya Sachkov. As reports (https://lenta.ru/news/2023/07/26/sachkovvv/) to Lenta.ru, he will serve his sentence in a strict regime colony. It is clarified...", "link": "https://www.databreaches.net/group-ib-founder-ilya-sachkov-sentenced-to-14-years-in-prison-for-high-treason/"}, {"source": "DataBreaches", "title": "Presumably the largest Dutch user of the Genesis Market arrested", "desc": "Who knew that the Netherlands was such a hotbed of cybercrime? This week, the police reported: Barendrecht – In the international investigation “Operation Cookie Monster”, a 32-year-old Dutchman who lives in Brazil was arrested after intensive investigation. This happened on Tuesday 18 July in Barendrecht. Because the man was in complete restraint after his...", "link": "https://www.databreaches.net/presumably-the-largest-dutch-user-of-the-genesis-market-arrested/"}, {"source": "DataBreaches", "title": "NL: Investigation into arms trade leads to suspected cybercriminal", "desc": "July 24 — as seen on OM.nl: Analysis of residual information from an investigation into arms trade led to the arrest of a 21-year-old man from Amsterdam at the beginning of this month. The Public Prosecution Service suspects the man of, among other things, years of fraud, theft, computer trespass and money laundering. According to the...", "link": "https://www.databreaches.net/nl-investigation-into-arms-trade-leads-to-suspected-cybercriminal/"}, {"source": "DataBreaches", "title": "Rush Health Must Face Suit Over Health-Info Sharing With Google", "desc": "Christopher Brown reports: Rush System for Health must defend a proposed class action alleging it shared health information of patients using its patient portal with Google Inc. and other third parties, in breach of its contract with patients and in violation of the Illinois Eavesdropping Act. Marguerite Kurowski successfully stated a claim for breach of contract...", "link": "https://www.databreaches.net/rush-health-must-face-suit-over-health-info-sharing-with-google/"}, {"source": "DataBreaches", "title": "UK: Ambulance patient records system hauled offline for cyber-attack probe", "desc": "Lindsay Clark reports: Several UK NHS ambulance organizations have been struggling to record patient data and pass it to other providers following a cyber-attack aimed at health software company Ortivus. In a statement, the Sweden-headquartered software vendor said it was subject to a cyber-attack on July 18 which hit UK customer systems within its hosted...", "link": "https://www.databreaches.net/uk-ambulance-patient-records-system-hauled-offline-for-cyber-attack-probe/"}, {"source": "DataBreaches", "title": "Yamaha confirms cyberattack after multiple ransomware gangs claim attacks", "desc": "Jonathan Greig reports: Yamaha’s Canadian music division confirmed that it recently dealt with a cyberattack after two different ransomware groups claimed to have attacked the company. The Yamaha Corporation — different from the spun-off motorcycle division — is a Japanese manufacturing giant producing musical instruments and audio equipment. It is considered the world’s largest...", "link": "https://www.databreaches.net/yamaha-confirms-cyberattack-after-multiple-ransomware-gangs-claim-attacks/"}, {"source": "DataBreaches", "title": "North Korean hackers targeting JumpCloud mistakenly exposed their IP addresses, researchers say", "desc": "Zack Whittaker reports: Security researchers say they have high confidence that North Korean hackers were behind a recent intrusion at enterprise software company JumpCloud because of a mistake the hackers made. Mandiant, which is assisting one of JumpCloud’s affected customers, attributed the breach to hackers working for North Korea’s Reconnaissance General Bureau, or RGB, a hacking...", "link": "https://www.databreaches.net/north-korean-hackers-targeting-jumpcloud-mistakenly-exposed-their-ip-addresses-researchers-say/"}, {"source": "DataBreaches", "title": "IBM Report: Half of Breached Organizations Unwilling to Increase Security Spend Despite Soaring Breach Costs", "desc": "From IBM: IBM Security today released its annual Cost of a Data Breach Report,1 showing the global average cost of a data breach reached $4.45 million in 2023 – an all-time high for the report and a 15% increase over the last 3 years. Detection and escalation costs jumped 42% over this same time frame, representing the...", "link": "https://www.databreaches.net/ibm-report-half-of-breached-organizations-unwilling-to-increase-security-spend-despite-soaring-breach-costs/"}, {"source": "DataBreaches", "title": "Half of breached organisations unwilling to up security spend", "desc": "From IT-Online: IBM Security’s newly-released annual Cost of a Data Breach Report says that the global average cost of a data breach reached $4,45-million in 2023 – an all-time high for the report and a 15% increase over the last three years. Detection and escalation costs jumped 42% over this same time frame, representing...", "link": "https://www.databreaches.net/half-of-breached-organisations-unwilling-to-up-security-spend/"}, {"source": "DataBreaches", "title": "Norway says Ivanti zero-day was used to hack govt IT systems", "desc": "Sergiu Gatlan reports: The Norwegian National Security Authority (NSM) has confirmed that attackers used a zero-day vulnerability in Ivanti’s Endpoint Manager Mobile (EPMM) solution to breach a software platform used by 12 ministries in the country. The Norwegian Security and Service Organization (DSS) said on Monday that the cyberattack did not affect Norway’s Prime Minister’s Office,...", "link": "https://www.databreaches.net/norway-says-ivanti-zero-day-was-used-to-hack-govt-it-systems/"}, {"source": "DataBreaches", "title": "In SEC Battle, Covington Ordered to Disclose Names of 7 Clients", "desc": "Abigail Adcox reports: U.S. District Judge Amit Mehta of the District of Columbia has ruled that Covington & Burling must disclose to the U.S. Securities and Exchange Commission the names of seven clients whose information may have been exposed in a 2020 cyberattack that impacted the firm. “Covington shall produce to the Commission the...", "link": "https://www.databreaches.net/in-sec-battle-covington-ordered-to-disclose-names-of-7-clients/"}, {"source": "DataBreaches", "title": "Company Bought by Experian Needn’t Report Pre-Sale Data Breach", "desc": "Christopher Brown reports: Court Ventures Inc. properly beat a suit alleging it failed to notify victims of a security breach that it became aware of only after its sale to Experian Data Corp., a California appellate court ruled. Former owners of computerized data containing personal information aren’t required to provide notice of a breach under...", "link": "https://www.databreaches.net/company-bought-by-experian-neednt-report-pre-sale-data-breach/"}, {"source": "DataBreaches", "title": "Law Firm Hack Affects Victims of an Earlier Breach Again", "desc": "Marianne Kolbasuk McGee reports: A global law firm is notifying nearly 153,000 individuals of a hacking incident that compromised several client files. The files contained sensitive personal information and affects vision care patients who had been victims of a breach three years ago. Orrick, Herrington & Sutcliffe on July 20 reported the data breach...", "link": "https://www.databreaches.net/law-firm-hack-affects-victims-of-an-earlier-breach-again/"}, {"source": "DataBreaches", "title": "Umbreon Unplugged:  Unraveling the Sequel to Failures", "desc": "On June 23, DataBreaches published the first of a series of interviews with Pepijn Van der Stap, aka “Umbreon.” Van der Stap, 21, was arrested in January and remains in detention, awaiting trial on charges that include hacking, data exfiltration, extortion, sale of stolen data, and money laundering.  At the end of the first...", "link": "https://www.databreaches.net/umbreon-unplugged-unraveling-the-sequel-to-failures/"}, {"source": "DataBreaches", "title": "More plastic surgery patients have their nude photos and information leaked", "desc": "An unknown party or parties who created a leak site with nude photos and medical records of a well-known plastic surgeon’s patients have uploaded more of his patients’ photos and records. In what was their third update to the leak site since June 5, those responsible wrote that they have changed their strategy. Before...", "link": "https://www.databreaches.net/more-plastic-surgery-patients-have-their-nude-photos-and-information-leaked/"}, {"source": "DataBreaches", "title": "Pointed to a phishing campaign targeting the healthcare sector, Microsoft leaps into action to … not even investigate?!", "desc": "The relaxing Sunday I was looking forward to did not quite work out as planned. Dutch researcher and all-around good-guy Jelle Ursem (aka @SchizoDuckie) got in touch with me about what appeared to him to be a sketchy site allegedly by a well-known prescription management entity. After a few minutes of checking, there was...", "link": "https://www.databreaches.net/pointed-to-a-phishing-campaign-targeting-the-healthcare-sector-microsoft-leaps-into-action-to-not-even-investigate/"}, {"source": "DataBreaches", "title": "Norwegian ministries hit by cyberattack", "desc": "The Norwegian Government Security and Service Organisation (DSS) has detected a cyber-attack on the ICT platform used by 12 ministries. The matter is currently being investigated by the police. “We are taking this incident very seriously. The Norwegian Government Security and Service Organisation (DSS) is cooperating closely with the National Security Authority (NSM) and...", "link": "https://www.databreaches.net/norwegian-ministries-hit-by-cyberattack/"}, {"source": "DataBreaches", "title": "Teachers Insurance and Annuity Association of America notifying 2,630,717 after PBI alerts them to MOVEit breach", "desc": "As those trying to monitor and analyze the massive MOVEit breach are already aware, the Teachers Insurance and Annuity Association of America (“TIAA”) provided university faculty retirement benefits to a number of colleges and universities. The TIAA part of the breach was not a direct attack on the vendor’s systems. TIAA was notified by its...", "link": "https://www.databreaches.net/teachers-insurance-and-annuity-association-of-america-notifying-2630717-after-pbi-alerts-them-to-moveit-breach/"}, {"source": "DataBreaches", "title": "Buckingham County Public Schools notifies 86 students after a business email account was compromised", "desc": "Buckingham County Public Schools in Virginia has sent notifications to parents of 86 students after a compromise of a district’s business email account. The incident occurred on June 20. Information in the email account included the student’s name “coupled with a limited amount of health or medical diagnostic and treatment information, and/or address. Examples...", "link": "https://www.databreaches.net/buckingham-county-public-schools-notifies-86-students-after-a-business-email-account-was-compromised/"}, {"source": "DataBreaches", "title": "Attorneys on alert for cybersecurity threats: New York’s new CLE training requirement", "desc": "John Bandler reports: July 1st was a cybersecurity milestone for every New York attorney who now needs to complete an hour of cybersecurity training before renewing their law license. New York Courts in their role supervising and licensing attorneys recognize the importance of cybersecurity, and the threat of cybercrime. Cybercrime menaces every person and...", "link": "https://www.databreaches.net/attorneys-on-alert-for-cybersecurity-threats-new-yorks-new-cle-training-requirement/"}, {"source": "DataBreaches", "title": "‘It feels like a digital hurricane’: Coastal Mississippi county recovering from ransomware attack", "desc": "Jonathan Greig reports: A coastal Mississippi county is in the process of recovering from a wide-ranging ransomware attack that took down nearly all of the government’s in-office computers. Nestled right along the border with Alabama, George County is the quiet home to more than 25,000 people. But the local government was thrown into chaos...", "link": "https://www.databreaches.net/it-feels-like-a-digital-hurricane-coastal-mississippi-county-recovering-from-ransomware-attack/"}, {"source": "DataBreaches", "title": "VirusTotal: We’re sorry someone fat-fingered and exposed 5,600 users", "desc": "Jessica Lyons Hardcastle reports: VirusTotal today issued a mea culpa, saying a blunder earlier this week by one of its staff exposed information belonging to 5,600 customers, including the email addresses of US Cyber Command, FBI, and NSA employees. The unintentional leak was due to the layer-eight problem; human error. On June 29, an employee accidentally...", "link": "https://www.databreaches.net/virustotal-were-sorry-someone-fat-fingered-and-exposed-5600-users/"}, {"source": "DataBreaches", "title": "1st Circuit confirms standing for data breach victims", "desc": "Orrick, Herrington & Sutcliffe LLP write: On June 30, the U.S. Court of Appeals for the First Circuit overruled a district court’s dismissal of a putative class action against a home delivery pharmacy service for allegedly failing to prevent a 2021 data breach that exposed the personally identifiable information (PII) of over 75,000 patients. The...", "link": "https://www.databreaches.net/1st-circuit-confirms-standing-for-data-breach-victims/"}, {"source": "DataBreaches", "title": "Hundreds of children’s medical documents found along Cape Coral streets", "desc": "Justin Kase and Rachel Murphy report: Hundreds of children’s private records were littered along the streets of Cape Coral. Police picked up most of the documents after they were reported Friday. Read more at WINK News. From the transcript and the video of the news, it appears that these are likely student health records...", "link": "https://www.databreaches.net/hundreds-of-childrens-medical-documents-found-along-cape-coral-streets/"}, {"source": "DataBreaches", "title": "Two more breaches involving email gaffes: one by a NZ hospital, one by Fortinet", "desc": "First, we have this “human error” mistake with email to report today. Hamish McNeilly reports: An email containing the names of vulnerable children was mistakenly sent to other parents and guardians, prompting an apology from Te Whatu Ora Southern. Dozens of parents and guardians received the email on Tuesday from the Vera Haywood Centre,...", "link": "https://www.databreaches.net/two-more-breaches-involving-email-gaffes-one-by-a-nz-hospital-one-by-fortinet/"}, {"source": "DataBreaches", "title": "CISA Advisory: Threat Actors Exploiting Citrix CVE-2023-3519 to Implant Webshells", "desc": "Release Date: July 20 Alert Code: AA23-201A Summary The Cybersecurity and Infrastructure Security Agency (CISA) is releasing this Cybersecurity Advisory to warn network defenders about exploitation of CVE-2023-3519, an unauthenticated remote code execution (RCE) vulnerability affecting NetScaler (formerly Citrix) Application Delivery Controller (ADC) and NetScaler Gateway. In June 2023, threat actors exploited this vulnerability...", "link": "https://www.databreaches.net/cisa-advisory-threat-actors-exploiting-citrix-cve-2023-3519-to-implant-webshells/"}, {"source": "DataBreaches", "title": "Clop gang to earn over $75 million from MOVEit extortion attacks", "desc": "Lawrence Abrams takes us through a recent Coveware report on Clop’s shifting strategies and how recent trends in exfiltration-only have impacted the amount of ransom victims are paying. Read his article on BleepingComputer. Related: Coveware: Ransom Monetization Rates Fall to Record Low Despite Jump In Average Ransom Payments", "link": "https://www.databreaches.net/clop-gang-to-earn-over-75-million-from-moveit-extortion-attacks/"}, {"source": "DataBreaches", "title": "How we tried to book a train ticket and ended up with a databreach with 245,000 records", "desc": "To celebrate Franco-German friendship, German Transport Minister Wissing and his French counterpart Beaune came up with something special: 30,000 free Interrail tickets per country for travel in Germany and France for young adults between 18 and 27. Codename: “Passe France Allemagne” However, many things went wrong when the Interrail passes were distributed. In the following, we...", "link": "https://www.databreaches.net/how-we-tried-to-book-a-train-ticket-and-ended-up-with-a-databreach-with-245000-records/"}, {"source": "DataBreaches", "title": "WormGPT: Cybercriminals AI Tool Gained Over 5,000 Subscribers in Just a Week", "desc": "Tushar Subhra Dutta reports: The revolutionary innovations by AI (Artificial Intelligence) include generative AI that has various creative potential, but along with that it also raises serious concerns with malicious tools like WormGPT. Since it’s a powerful generative AI-based tool, WormGPT enables attackers to create their own custom hacking tools that pose major cybersecurity challenges. Just...", "link": "https://www.databreaches.net/wormgpt-cybercriminals-ai-tool-gained-over-5000-subscribers-in-just-a-week/"}, {"source": "DataBreaches", "title": "SEC to Consider Cyber Rules Next Week", "desc": "Micaela McMurrough, Ashden Fein, David H. Engvall, Caleb Skeath, Kerry Burke, and Shayan Karbassi of Covington and Burling write: According to a recently-released meeting agenda, the Securities and Exchange Commission’s (“SEC”) upcoming July 26, 2023 meeting will include consideration of adopting rules to enhance disclosures regarding cybersecurity risk management, governance, and incidents by publicly traded...", "link": "https://www.databreaches.net/sec-to-consider-cyber-rules-next-week/"}, {"source": "DataBreaches", "title": "Data breach exposes personal information of 4,000 Roblox developers", "desc": "Jess Weatherbed reports: Sensitive information identifying thousands of Roblox creators has been exposed following a data breach impacting attendees at a conference for Roblox developers, which allegedly remained undisclosed by the company for at least two years. As reported by PC Gamer, the leak contains personal information from people who attended the Roblox Developer Conference between 2017-2020, including names, usernames, date...", "link": "https://www.databreaches.net/data-breach-exposes-personal-information-of-4000-roblox-developers/"}, {"source": "DataBreaches", "title": "FTC and HHS Warn Hospital Systems and Telehealth Providers about Privacy and Security Risks from Online Tracking Technologies", "desc": "The Federal Trade Commission and the U.S. Department of Health and Human Services’ Office for Civil Rights (OCR) are cautioning hospitals and telehealth providers about the privacy and security risks related to the use of online tracking technologies integrated into their websites or mobile apps that may be impermissibly disclosing consumers’ sensitive personal health...", "link": "https://www.databreaches.net/ftc-and-hhs-warn-hospital-systems-and-telehealth-providers-about-privacy-and-security-risks-from-online-tracking-technologies/"}, {"source": "DataBreaches", "title": "The passing of a legend — Kevin David Mitnick", "desc": "Kevin David Mitnick, 59, died peacefully on Sunday, July 16, 2023, after valiantly battling pancreatic cancer for more than a year. Kevin is survived by his beloved wife, Kimberley Mitnick, who remained by his side throughout their 14-month ordeal. Kimberley is pregnant with their first child. Kevin was ecstatic about this new chapter in...", "link": "https://www.databreaches.net/the-passing-of-a-legend-kevin-david-mitnick/"}, {"source": "DataBreaches", "title": "Double whammy? Estee Lauder Breached by Two Ransomware Groups?", "desc": "Phil Muncaster reports: Estee Lauder has become the latest big name to suffer an apparently serious ransomware breach, after two groups claimed to have compromised the firm. The cosmetics giant was posted to the leak site of both the Alphv/BlackCat and Clop ransomware gangs, according to security researchers on Twitter. Read more at Infosecurity...", "link": "https://www.databreaches.net/double-whammy-estee-lauder-breached-by-two-ransomware-groups/"}]