[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/critical-mikrotik-routeros.html", "tags": "Network Security / Vulnerability", "title": "Critical MikroTik RouterOS Vulnerability Exposes Over Half a Million Devices to Hacking", "desc": "A severe privilege escalation issue impacting MikroTik RouterOS could be weaponized by remote malicious actors to execute arbitrary code and seize full control of vulnerable devices. Cataloged as  CVE-2023-30799  (CVSS score: 9.1), the shortcoming is expected to put approximately 500,000 and 900,000 RouterOS systems at risk of exploitation via their web and/or Winbox interfaces, respectively, VulnCheck disclosed in a Tuesday report. \"CVE-2023-30799 does require authentication,\" security researcher Jacob Baines  said . \"In fact, the vulnerability itself is a simple privilege escalation from admin to 'super-admin' which results in access to an arbitrary function. Acquiring credentials to RouterOS systems is easier than one might expect.\" This is because the Mikrotik RouterOS operating system does not offer any protection against password brute-force attacks and ships with a well-known default \"admin\" user, with its password being an empty string..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/atlassian-releases-patches-for-critical.html", "tags": "Server Security / Zero Day", "title": "Atlassian Releases Patches for Critical Flaws in Confluence and Bamboo", "desc": "Atlassian has  released  updates to address three security flaws impacting its Confluence Server, Data Center, and Bamboo Data Center products that, if successfully exploited, could result in remote code execution on susceptible systems. The list of the flaws is below - CVE-2023-22505  (CVSS score: 8.0) - RCE (Remote Code Execution) in Confluence Data Center and Server (Fixed in versions 8.3.2 and 8.4.0) CVE-2023-22508  (CVSS score: 8.5) - RCE (Remote Code Execution) in Confluence Data Center and Server (Fixed in versions 7.19.8 and 8.2.0) CVE-2023-22506  (CVSS score: 7.5) - Injection, RCE (Remote Code Execution) in Bamboo (Fixed in versions 9.2.3 and 9.3.1) CVE-2023-22505 and CVE-2023-22508 allow an \"authenticated attacker to execute arbitrary code which has high impact to confidentiality, high impact to integrity, high impact to availability, and no user interaction,\" the company said. While the first bug was introduced in version 8.0.0, CVE-2023-22508 was introduc..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/apple-rolls-out-urgent-patches-for-zero.html", "tags": "Endpoint Security / Zero Day", "title": "Apple Rolls Out Urgent Patches for Zero-Day Flaws Impacting iPhones, iPads and Macs", "desc": "Apple has  rolled out security updates  to iOS, iPadOS, macOS, tvOS, watchOS, and Safari to address several security vulnerabilities, including one actively exploited zero-day bug in the wild. Tracked as  CVE-2023-38606 , the shortcoming resides in the kernel and permits a malicious app to modify sensitive kernel state potentially. The company said it was addressed with improved state management. \"Apple is aware of a report that this issue may have been actively exploited against versions of iOS released before iOS 15.7.1,\" the tech giant noted in its advisory. It's worth noting that CVE-2023-38606 is the fourth security vulnerability discovered in connection with  Operation Triangulation , a sophisticated mobile cyber espionage campaign targeting iOS devices since 2019 using a zero-click exploit chain. The other two zero-days,  CVE-2023-32434 and CVE-2023-32435 , were patched by Apple last month. A third shortcoming, CVE-2022-46690 , was addressed as part of securi..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/critical-zero-days-in-atera-windows.html", "tags": "Windows Security / Zero-Day", "title": "Critical Zero-Days in Atera Windows Installers Expose Users to Privilege Escalation Attacks", "desc": "Zero-day vulnerabilities in Windows Installers for the Atera remote monitoring and management software could act as a springboard to launch privilege escalation attacks. The flaws, discovered by Mandiant on February 28, 2023, have been assigned the identifiers  CVE-2023-26077  and  CVE-2023-26078 , with the issues remediated in versions 1.8.3.7 and 1.8.4.9 released by Atera on April 17, 2023, and June 26, 2023, respectively. \"The ability to initiate an operation from a NT AUTHORITY\\SYSTEM context can present potential security risks if not properly managed,\" security researcher Andrew Oliveau  said . \"For instance, misconfigured  Custom Actions  running as NT AUTHORITY\\SYSTEM can be exploited by attackers to execute local privilege escalation attacks.\" Successful exploitation of such weaknesses could pave the way for the execution of arbitrary code with elevated privileges. Both the flaws reside in the MSI installer's repair functionality, potentially crea..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/ddos-botnets-hijacking-zyxel-devices-to.html", "tags": "Vulnerability / Botnet", "title": "DDoS Botnets Hijacking Zyxel Devices to Launch Devastating Attacks", "desc": "Several distributed denial-of-service (DDoS) botnets have been observed exploiting a critical flaw in Zyxel devices that came to light in April 2023 to gain remote control of vulnerable systems. \"Through the capture of exploit traffic, the attacker's IP address was identified, and it was determined that the attacks were occurring in multiple regions, including Central America, North America, East Asia, and South Asia,\" Fortinet FortiGuard Labs researcher Cara Lin  said . The flaw, tracked as CVE-2023-28771 (CVSS score: 9.8), is a command injection bug affecting multiple firewall models that could potentially allow an unauthorized actor to execute arbitrary code by sending a specifically crafted packet to the targeted appliance. Last month, the Shadowserver Foundation  warned  that the flaw was being \"actively exploited to build a Mirai-like botnet\" at least since May 26, 2023, an indication of how abuse of  servers running unpatched software  is on the rise...."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/citrix-netscaler-adc-and-gateway.html", "tags": "Vulnerability / Cyber Threat", "title": "Citrix NetScaler ADC and Gateway Devices Under Attack: CISA Urges Immediate Action", "desc": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) issued an advisory on Thursday warning that the newly disclosed critical security flaw in Citrix NetScaler Application Delivery Controller (ADC) and Gateway devices is being abused to drop web shells on vulnerable systems. \"In June 2023, threat actors exploited this vulnerability as a zero-day to drop a web shell on a critical infrastructure organization's non-production environment NetScaler ADC appliance,\" the agency  said . \"The web shell enabled the actors to perform discovery on the victim's active directory (AD) and collect and exfiltrate AD data. The actors attempted to move laterally to a domain controller but network segmentation controls for the appliance blocked movement.\" The shortcoming in question is  CVE-2023-3519  (CVSS score: 9.8), a code injection bug that could result in unauthenticated remote code execution. Citrix, earlier this week, released patches for the issue and..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/critical-flaws-in-ami-megarac-bmc.html", "tags": "Hardware Security / SysAdmin", "title": "Critical Flaws in AMI MegaRAC BMC Software Expose Servers to Remote Attacks", "desc": "Two more security flaws have been disclosed in AMI MegaRAC Baseboard Management Controller (BMC) software that, if successfully exploited, could allow threat actors to remotely commandeer vulnerable servers and deploy malware. \"These new vulnerabilities range in severity from High to Critical, including unauthenticated remote code execution and unauthorized device access with superuser permissions,\" Eclypsium researchers Vlad Babkin and Scott Scheferman said in a report shared with The Hacker News. \"They can be exploited by remote attackers having access to Redfish remote management interfaces, or from a compromised host operating system.\" To make matters worse, the shortcomings could also be weaponized to drop persistent firmware implants that are immune to operating system reinstalls and hard drive replacements, brick motherboard components, cause physical damage through overvolting attacks, and induce indefinite reboot loops. \"As attackers shift their..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/apache-openmeetings-web-conferencing.html", "tags": "Vulnerability / Software Security", "title": "Apache OpenMeetings Web Conferencing Tool Exposed to Critical Vulnerabilities", "desc": "Multiple security flaws have been disclosed in Apache OpenMeetings, a web conferencing solution, that could be potentially exploited by malicious actors to seize control of admin accounts and run malicious code on susceptible servers. \"Attackers can bring the application into an unexpected state, which allows them to take over any user account, including the admin account,\" Sonar vulnerability researcher Stefan Schiller  said  in a report shared with The Hacker News. \"The acquired admin privileges can further be leveraged to exploit another vulnerability allowing attackers to execute arbitrary code on the Apache OpenMeetings server.\" Following responsible disclosure on March 20, 2023, the vulnerabilities were addressed with the release of  Openmeetings version 7.1.0  that was released on May 9, 2023. The list of three flaws is as follows - CVE-2023-28936  (CVSS score: 5.3) - Insufficient check of invitation hash CVE-2023-29032  (CVSS score: 8.1) - An authenti..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/new-p2pinfect-worm-targeting-redis.html", "tags": "Malware / Cyber Threat", "title": "New P2PInfect Worm Targeting Redis Servers on Linux and Windows Systems", "desc": "Cybersecurity researchers have uncovered a new cloud targeting, peer-to-peer (P2P) worm called  P2PInfect  that targets vulnerable Redis instances for follow-on exploitation. \"P2PInfect exploits Redis servers running on both Linux and Windows Operating Systems making it more scalable and potent than other worms,\" Palo Alto Networks Unit 42 researchers William Gamazo and Nathaniel Quist  said . \"This worm is also written in Rust, a highly scalable and cloud-friendly programming language.\" It's estimated that as many as 934 unique Redis systems may be vulnerable to the threat. The first known instance of P2PInfect was detected on July 11, 2023. A notable characteristic of the worm is its ability to infects vulnerable Redis instances by exploiting a critical Lua sandbox escape vulnerability,  CVE-2022-0543  (CVSS score: 10.0), which has been previously exploited to deliver multiple  malware families  such as  Muhstik ,  Redigo , and  HeadCrab  over the past ye..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/go-beyond-headlines-for-deeper-dives.html", "tags": "Cybersecurity / Cyber Attacks", "title": "Go Beyond the Headlines for Deeper Dives into the Cybercriminal Underground", "desc": "Discover stories about threat actors' latest tactics, techniques, and procedures from Cybersixgill's threat experts each month. Each story brings you details on emerging underground threats, the threat actors involved, and how you can take action to mitigate risks. Learn about the top vulnerabilities and review the latest ransomware and malware trends from the deep and dark web. Stolen ChatGPT credentials flood dark web markets Over the past year, 100,000 stolen credentials for ChatGPT were advertised on underground sites, being sold for as little as $5 on dark web marketplaces in addition to being offered for free. Stolen ChatGPT credentials include usernames, passwords, and other personal information associated with accounts. This is problematic because ChatGPT accounts may store sensitive information from queries, including confidential data and intellectual property. Speciﬁcally, companies increasingly incorporate ChatGPT into daily workﬂows, which means employees may disclose..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/cybercriminals-exploiting-woocommerce.html", "tags": "Server Security / Vulnerability", "title": "Cybercriminals Exploiting WooCommerce Payments Plugin Flaw to Hijack Websites", "desc": "Threat actors are actively exploiting a recently disclosed critical security flaw in the WooCommerce Payments WordPress plugin as part of a massive targeted campaign. The flaw, tracked as  CVE-2023-28121  (CVSS score: 9.8), is a case of authentication bypass that enables unauthenticated attackers to impersonate arbitrary users and perform some actions as the impersonated user, including an administrator, potentially leading to site takeover. \"Large-scale attacks against the vulnerability, assigned CVE-2023-28121, began on Thursday, July 14, 2023 and continued over the weekend, peaking at 1.3 million attacks against 157,000 sites on Saturday, July 16, 2023,\" Wordfence security researcher Ram Gall  said  in a Monday post. Versions 4.8.0 through 5.6.1 of WooCommerce Payments are vulnerable. The plugin is installed on over 600,000 sites. Patches for the bug were released by WooCommerce back in March 2023, with WordPress issuing auto-updates to sites using affected versions o..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/critical-security-flaws-uncovered-in.html", "tags": "Vulnerability/ Cyber Threat", "title": "Critical Security Flaws Uncovered in Honeywell Experion DCS and QuickBlox Services", "desc": "Multiple security vulnerabilities have been discovered in various services, including Honeywell Experion distributed control system (DCS) and QuickBlox, that, if successfully exploited, could result in severe compromise of affected systems. Dubbed Crit.IX, the nine flaws in the Honeywell Experion DCS platform allow for \"unauthorized remote code execution, which means an attacker would have the power to take over the devices and alter the operation of the DCS controller, whilst also hiding the alterations from the engineering workstation that manages the controller,\" Armis said in a statement shared with The Hacker News. Put differently, the issues relate to lack of encryption and adequate authentication mechanisms in a proprietary protocol called Control Data Access (CDA) that's used to communicate between Experion Servers and C300 controllers, effectively enabling a threat actor to take over the devices and alter the operation of the DCS controller. \"As a resul..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/zimbra-warns-of-critical-zero-day-flaw.html", "tags": "Email Security / Vulnerability", "title": "Zimbra Warns of Critical Zero-Day Flaw in Email Software Amid Active Exploitation", "desc": "Zimbra has warned of a critical zero-day security flaw in its email software that has come under active exploitation in the wild. \"A security vulnerability in Zimbra Collaboration Suite Version 8.8.15 that could potentially impact the confidentiality and integrity of your data has surfaced,\" the company  said  in an advisory. It also said that the issue has been addressed and that it's expected to be delivered in the July patch release. Additional specifics about the flaw are currently unavailable, although Zimbra said it fixed the issue through input sanitization. In the interim, it is urging customers to  apply a manual fix  to eliminate the attack vector - Take a backup of the file /opt/zimbra/jetty/webapps/zimbra/m/momoveto Edit this file and go to line number 40 Update the parameter value as: <input name=\"st\" type=\"hidden\" value=\"${fn:escapeXml(param.st)}\"/> Before the update, the line appeared as: <input name=\"st..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/blog-post.html", "tags": "Linux / Vulnerability", "title": "Fake PoC for Linux Kernel Vulnerability on GitHub Exposes Researchers to Malware", "desc": "In a sign that cybersecurity researchers continue to be under the radar of malicious actors, a proof-of-concept (PoC) has been discovered on GitHub, concealing a backdoor with a \"crafty\" persistence method. \"In this instance, the PoC is a wolf in sheep's clothing, harboring malicious intent under the guise of a harmless learning tool,\" Uptycs researchers Nischay Hegde and Siddartha Malladi  said . \"Operating as a downloader, it silently dumps and executes a Linux bash script, all the while disguising its operations as a kernel-level process.\" The  repository  masquerades as a PoC for  CVE-2023-35829 , a recently disclosed high-severity flaw in the Linux kernel. It has since been taken down, but not before it was forked 25 times.  Another PoC  shared by the same account, ChriSanders22, for  CVE-2023-20871 , a privilege escalation bug impacting VMware Fusion, was forked twice. Uptypcs also identified a  second GitHub profile  containing a bogus PoC f..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/microsoft-releases-patches-for-130.html", "tags": "Vulnerability / Software Security", "title": "Microsoft Releases Patches for 132 Vulnerabilities, Including 6 Under Active Attack", "desc": "Microsoft on Tuesday released updates to address a total  of 132 new security flaws  spanning its software, including six zero-day flaws that it said have been actively exploited in the wild. Of the 132 vulnerabilities, nine are rated Critical, 122 are rated Important in severity, and one has been assigned a severity rating of \"None.\" This is in addition to  eight flaws  the tech giant patched in its Chromium-based Edge browser towards the end of last month. The list of issues that have come under active exploitation is as follows - CVE-2023-32046  (CVSS score: 7.8) - Windows MSHTML Platform Elevation of Privilege Vulnerability CVE-2023-32049  (CVSS score: 8.8) - Windows SmartScreen Security Feature Bypass Vulnerability CVE-2023-35311  (CVSS score: 8.8) - Microsoft Outlook Security Feature Bypass Vulnerability CVE-2023-36874  (CVSS score: 7.8) - Windows Error Reporting Service Elevation of Privilege Vulnerability CVE-2023-36884  (CVSS score: 8.3) - Office and Windows..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/another-critical-unauthenticated-sqli.html", "tags": "Vulnerability / Cyber Threat", "title": "Another Critical Unauthenticated SQLi Flaw Discovered in MOVEit Transfer Software", "desc": "Progress Software has announced the discovery and patching of a critical SQL injection vulnerability in MOVEit Transfer, popular software used for secure file transfer. In addition, Progress Software has patched two other high-severity vulnerabilities. The identified SQL injection vulnerability, tagged as CVE-2023-36934 , could potentially allow unauthenticated attackers to gain unauthorized access to the MOVEit Transfer database. SQL injection vulnerabilities are a well-known and dangerous security flaw that allows attackers to manipulate databases and run any code they want. Attackers can send specifically designed payloads to certain endpoints of the affected application, which could change or expose sensitive data in the database. The reason CVE-2023-36934 is so critical is that it can be exploited without having to be logged in. This means that even attackers without valid credentials can potentially exploit the vulnerability. However, as of now, there have been no reports of..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/mastodon-social-network-patches.html", "tags": "Vulnerability / Social Media", "title": "Mastodon Social Network Patches Critical Flaws Allowing Server Takeover", "desc": "Mastodon, a popular decentralized social network, has released a security update to fix critical vulnerabilities that could expose millions of users to potential attacks. Mastodon is known for its federated model, consisting of thousands of separate servers called \"instances,\" and it has over 14 million users across more than 20,000 instances. The most critical vulnerability, CVE-2023-36460 , allows hackers to exploit a flaw in the media attachments feature, creating and overwriting files in any location the software could access on an instance. This software vulnerability could be used for DoS and arbitrary remote code execution attacks, posing a significant threat to users and the broader Internet ecosystem. If an attacker gains control over multiple instances, they could cause harm by instructing users to download malicious applications or even bring down the entire Mastodon infrastructure. Fortunately, there is no evidence of this vulnerability being exploited so fa..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/google-releases-android-patch-update.html", "tags": "Zero-Day Vulnerability", "title": "Google Releases Android Patch Update for 3 Actively Exploited Vulnerabilities", "desc": "Google has released its monthly security updates for the Android operating system, addressing 46 new software vulnerabilities. Among these, three vulnerabilities have been identified as actively exploited in targeted attacks. One of the vulnerabilities tracked as CVE-2023-26083 is a memory leak flaw affecting the Arm Mali GPU driver for Bifrost, Avalon, and Valhall chips. This particular vulnerability was exploited in a previous attack that enabled spyware infiltration on Samsung devices in December 2022. This vulnerability was regarded as serious enough to prompt the Cybersecurity and Infrastructure Security Agency (CISA) to issue a patching order for federal agencies in April 2023. Another significant vulnerability, identified as CVE-2021-29256, is a high-severity issue that affects specific versions of the Bifrost and Midgard Arm Mali GPU kernel drivers. This flaw permits an unprivileged user to gain unauthorized access to sensitive data and escalate privileges to the root lev..."}]