[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/microsoft-uncovers-flaws-in-ncurses.html", "tags": "Endpoint Security / Vulnerability", "title": "Microsoft Uncovers Flaws in ncurses Library Affecting Linux and macOS Systems", "desc": "A set of memory corruption flaws have been discovered in the  ncurses  (short for  new curses ) programming library that could be exploited by threat actors to run malicious code on vulnerable Linux and macOS systems. \"Using environment variable poisoning, attackers could chain these vulnerabilities to elevate privileges and run code in the targeted program's context or perform other malicious actions,\" Microsoft Threat Intelligence researchers Jonathan Bar Or, Emanuele Cozzi, and Michael Pearse  said  in a technical report published today. The vulnerabilities, collectively tracked as  CVE-2023-29491  (CVSS score of 7.8), have been  addressed  as of April 2023. Microsoft said it also worked with Apple on addressing the macOS-specific issues related to these flaws. Environment variables are user-defined values that can be used by multiple programs on a system and can affect the manner in which they behave on the system. Manipulating the variables can cause application..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/n-ables-take-control-agent.html", "tags": "Vulnerability / Hacking", "title": "N-Able's Take Control Agent Vulnerability Exposes Windows Systems to Privilege Escalation", "desc": "A high-severity security flaw has been disclosed in N-Able's Take Control Agent that could be exploited by a local unprivileged attacker to gain SYSTEM privileges. Tracked as  CVE-2023-27470  (CVSS score: 8.8), the  issue  relates to a Time-of-Check to Time-of-Use ( TOCTOU ) race condition vulnerability, which, when successfully exploited, could be leveraged to delete arbitrary files on a Windows system. The security shortcoming, which impacts versions 7.0.41.1141 and prior, has been addressed in version 7.0.43 released on March 15, 2023, following responsible disclosure by Mandiant on February 27, 2023. Time-of-Check to Time-of-Use falls under a category of software flaws wherein a program checks the state of a resource for a specific value, but that value changes before it's actually used, effectively invalidating the results of the check. An exploitation of such a flaw can result in a loss of integrity and trick the program into performing actions that it shouldn't..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/microsoft-releases-patch-for-two-new.html", "tags": "Endpoint Security / Zero Day", "title": "Microsoft Releases Patch for Two New Actively Exploited Zero-Days Flaws", "desc": "Microsoft has released software fixes to  remediate 59 bugs  spanning its product portfolio, including two zero-day flaws that have been actively exploited by malicious cyber actors. Of the 59 vulnerabilities, five are rated Critical, 55 are rated Important, and one is rated Moderate in severity. The update is in addition to  35 flaws  patched in the Chromium-based Edge browser since last month's Patch Tuesday edition, which also encompasses a fix for  CVE-2023-4863 , a critical heap buffer overflow flaw in the WebP image format. The two Microsoft vulnerabilities that have come under active exploitation in real-world attacks are listed below - CVE-2023-36761  (CVSS score: 6.2) - Microsoft Word Information Disclosure Vulnerability CVE-2023-36802  (CVSS score: 7.8) - Microsoft Streaming Service Proxy Elevation of Privilege Vulnerability \"Exploiting this vulnerability could allow the disclosure of  NTLM hashes ,\" the Windows maker said in an advisory about CVE-2023-3..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/update-adobe-acrobat-and-reader-to.html", "tags": "Vulnerability / Zero Day", "title": "Update Adobe Acrobat and Reader to Patch Actively Exploited Vulnerability", "desc": "Adobe's  Patch Tuesday update  for September 2023 comes with a patch for a critical actively exploited security flaw in Acrobat and Reader that could permit an attacker to execute malicious code on susceptible systems. The vulnerability, tracked as CVE-2023-26369, is rated 7.8 for severity on the CVSS scoring system and impacts both Windows and macOS versions of Acrobat DC, Acrobat Reader DC, Acrobat 2020, and Acrobat Reader 2020. Described as an out-of-bounds write, successful exploitation of the bug could lead to code execution by opening a specially crafted PDF document. Adobe did not disclose any additional details about the issue or the targeting involved. \"Adobe is aware that CVE-2023-26369 has been exploited in the wild in limited attacks targeting Adobe Acrobat and Reader,\" the company  acknowledged  in an advisory. CVE-2023-26369 affects the below versions - Acrobat DC (23.003.20284 and earlier versions) - Fixed in 23.006.20320 Acrobat Reader DC (23.003...."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/mozilla-rushes-to-patch-webp-critical.html", "tags": "Vulnerability / Browser Security", "title": "Mozilla Rushes to Patch WebP Critical Zero-Day Exploit in Firefox and Thunderbird", "desc": "Mozilla on Tuesday released security updates to resolve a critical zero-day vulnerability in Firefox and Thunderbird that has been actively exploited in the wild, a day after Google released a fix for the issue in its Chrome browser. The shortcoming, assigned the identifier  CVE-2023-4863 , is a heap buffer overflow flaw in the WebP image format that could result in arbitrary code execution when processing a specially crafted image. \"Opening a malicious WebP image could lead to a heap buffer overflow in the content process,\" Mozilla  said  in an advisory. \"We are aware of this issue being exploited in other products in the wild.\" According to the description on the National Vulnerability Database (NVD), the flaw could allow a remote attacker to perform an out-of-bounds memory write via a crafted HTML page. Apple Security Engineering and Architecture (SEAR) and the Citizen Lab at the University of Toronto's Munk School have been credited with reporting the s..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/critical-github-vulnerability-exposes.html", "tags": "Software Security / Vulnerability", "title": "Critical GitHub Vulnerability Exposes 4,000+ Repositories to Repojacking Attack", "desc": "A new vulnerability disclosed in GitHub could have exposed thousands of repositories at risk of repojacking attacks, new findings show. The flaw \"could allow an attacker to exploit a race condition within GitHub's repository creation and username renaming operations,\" Checkmarx security researcher Elad Rapoport  said  in a technical report shared with The Hacker News. \"Successful exploitation of this vulnerability impacts the open-source community by enabling the hijacking of over 4,000 code packages in languages such as Go, PHP, and Swift, as well as GitHub actions.\" Following responsible disclosure on March 1, 2023, the Microsoft-owned code hosting platform has addressed the issue as of September 1, 2023. Repojacking , short for  repository hijacking , is a technique where a threat actor is able to bypass a security mechanism called popular repository namespace retirement and ultimately control of a repository. What the protection measure does is preven..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/apple-rushes-to-patch-zero-day-flaws.html", "tags": "Spyware / Vulnerability", "title": "Apple Rushes to Patch Zero-Day Flaws Exploited for Pegasus Spyware on iPhones", "desc": "Apple on Thursday released emergency security updates for iOS, iPadOS, macOS, and watchOS to address two zero-day flaws that have been exploited in the wild to deliver NSO Group's Pegasus mercenary spyware. The issues are described as below - CVE-2023-41061  - A validation issue in Wallet that could result in arbitrary code execution when handling a maliciously crafted attachment. CVE-2023-41064  - A buffer overflow issue in the  Image I/O component  that could result in arbitrary code execution when processing a maliciously crafted image. While CVE-2023-41064 was found by the Citizen Lab at the University of Torontoʼs Munk School, CVE-2023-41061 was discovered internally by Apple, with \"assistance\" from the Citizen Lab. The updates are available for the following devices and operating systems - iOS 16.6.1 and iPadOS 16.6.1  - iPhone 8 and later, iPad Pro (all models), iPad Air 3rd generation and later, iPad 5th generation and later, and iPad mini 5th generati..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/cisco-issues-urgent-fix-for.html", "tags": "Vulnerability / Network Security", "title": "Cisco Issues Urgent Fix for Authentication Bypass Bug Affecting BroadWorks Platform", "desc": "Cisco has released security fixes to address multiple security flaws, including a critical bug, that could be exploited by a threat actor to take control of an affected system or cause a denial-of service (DoS) condition. The most severe of the issues is CVE-2023-20238, which has the maximum CVSS severity rating of 10.0. It's described as an authentication bypass flaw in the Cisco BroadWorks Application Delivery Platform and Cisco BroadWorks Xtended Services Platform. Successful exploitation of the vulnerability -- a weakness in the single sign-on (SSO) implementation and discovered during internal testing -- could allow an unauthenticated, remote attacker to forge the credentials required to access an affected system. \"This vulnerability is due to the method used to validate SSO tokens,\" Cisco  said . \"An attacker could exploit this vulnerability by authenticating to the application with forged credentials. A successful exploit could allow the attacker to commit toll fraud or to e..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/north-korean-hackers-exploit-zero-day.html", "tags": "Zero Day / Cyber Attack", "title": "North Korean Hackers Exploit Zero-Day Bug to Target Cybersecurity Researchers", "desc": "Threat actors associated with North Korea are  continuing  to  target  the cybersecurity community using a zero-day bug in an unspecified software over the past several weeks to infiltrate their machines. The findings come from Google's Threat Analysis Group (TAG), which found the adversary setting up fake accounts on social media platforms like  X  (formerly Twitter) and  Mastodon  to forge relationships with potential targets and build trust. \"In one case, they carried on a months-long conversation, attempting to collaborate with a security researcher on topics of mutual interest,\" security researchers Clement Lecigne and Maddie Stone  said . \"After initial contact via X, they moved to an encrypted messaging app such as Signal, WhatsApp, or Wire.\" The social engineering exercise ultimately paved the way for a malicious file containing at least one zero-day in a popular software package. The vulnerability is currently in the process of being fixed. The payload, for its part, perf..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/zero-day-alert-latest-android-patch.html", "tags": "Zero Day / Mobile Security", "title": "Zero-Day Alert: Latest Android Patch Update Includes Fix for Newly Actively Exploited Flaw", "desc": "Google has rolled out monthly security patches for Android to address a number of flaws, including a zero-day bug that it said may have been exploited in the wild. Tracked as  CVE-2023-35674 , the high-severity vulnerability is described as a case of privilege escalation impacting the  Android Framework . \"There are indications that CVE-2023-35674 may be under limited, targeted exploitation,\" the company  said  in its Android Security Bulletin for September 2023 without delving into additional specifics. The update also addresses three other privilege escalation flaws in Framework, with the search giant noting that the most severe of these issues \"could lead to local escalation of privilege with no additional execution privileges needed\" sans any user interaction. Google said it has further plugged a critical security vulnerability in the System component that could lead to remote code execution without requiring interaction on the part of the victim. \"The severity assessment is..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/hackers-exploit-minio-storage-system.html", "tags": "Vulnerability / Server Security", "title": "Hackers Exploit MinIO Storage System Vulnerabilities to Compromise Servers", "desc": "An unknown threat actor has been observed weaponizing high-severity security flaws in the MinIO high-performance object storage system to achieve unauthorized code execution on affected servers. Cybersecurity and incident response firm Security Joes said the intrusion leveraged a publicly available exploit chain to backdoor the MinIO instance. The comprises  CVE-2023-28432  (CVSS score: 7.5) and  CVE-2023-28434  (CVSS score: 8.8), the former of which was  added  to the U.S. Cybersecurity and Infrastructure Security Agency's (CISA) Known Exploited Vulnerabilities (KEV) catalog on April 21, 2023. The two vulnerabilities \"possess the potential to expose sensitive information present within the compromised installation and facilitate remote code execution (RCE) on the host where the MinIO application is operational,\" Security Joes  said  in a report shared with The Hacker News. In the attack chain investigated by the company, the flaws are said to have been weaponized b..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/poc-exploit-released-for-critical.html", "tags": "Network Security / Vulnerability", "title": "PoC Exploit Released for Critical VMware Aria's SSH Auth Bypass Vulnerability", "desc": "Proof-of-concept (PoC) exploit code has been made available for a recently disclosed and patched critical flaw impacting VMware Aria Operations for Networks (formerly vRealize Network Insight). The flaw, tracked as  CVE-2023-34039 , is rated 9.8 out of a maximum of 10 for severity and has been described as a case of authentication bypass due to a lack of unique cryptographic key generation. \"A malicious actor with network access to Aria Operations for Networks could bypass SSH authentication to gain access to the Aria Operations for Networks CLI,\" VMware said earlier this week. Summoning Team's Sina Kheirkhah, who published the PoC following an analysis of the patch released by VMware, said the root cause can be traced back to a bash script containing a method named refresh_ssh_keys(), which is responsible for overwriting the current SSH keys for the support and ubuntu users in the authorized_keys file. \"There is SSH authentication in place; however, VMware forgot to regenerate th..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/alert-juniper-firewalls-openfire-and.html", "tags": "Cyber Attack / Vulnerability ", "title": "Alert: Juniper Firewalls, Openfire, and Apache RocketMQ Under Attack from New Exploits", "desc": "Recently disclosed security flaws impacting Juniper firewalls, Openfire, and Apache RocketMQ servers have come under active exploitation in the wild, according to multiple reports. The Shadowserver Foundation  said  that it's \"seeing exploitation attempts from multiple IPs for Juniper J-Web CVE-2023-36844 (& friends) targeting /webauth_operation.php endpoint,\" the same day a proof-of-concept (PoC) became available. The  issues , tracked as CVE-2023-36844, CVE-2023-36845, CVE-2023-36846, and CVE-2023-36847, reside in the J-Web component of Junos OS on Juniper SRX and EX Series. They could be chained by an unauthenticated, network-based attacker to execute arbitrary code on susceptible installations. Patches for the flaw were released on August 17, 2023, a week after which watchTowr Labs published a proof-of-concept (PoC) by combining CVE-2023-36846 and CVE-2023-36845 to execute a PHP file containing malicious shellcode. Currently, there are  more than 8,200 Junip..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/critical-vulnerability-alert-vmware.html", "tags": "Vulnerability / Network Security", "title": "Critical Vulnerability Alert: VMware Aria Operations Networks at Risk from Remote Attacks", "desc": "VMware has released software updates to correct two security vulnerabilities in Aria Operations for Networks that could be potentially exploited to bypass authentication and gain remote code execution. The most severe of the flaws is CVE-2023-34039 (CVSS score: 9.8), which relates to a case of authentication bypass arising as a result of a lack of unique cryptographic key generation. \"A malicious actor with network access to Aria Operations for Networks could bypass SSH authentication to gain access to the Aria Operations for Networks CLI,\" the company  said  in an advisory. ProjectDiscovery researchers Harsh Jaiswal and Rahul Maini have been credited with discovering and reporting the issue. The second weakness, CVE-2023-20890 (CVSS score: 7.2), is an arbitrary file write vulnerability impacting Aria Operations for Networks that could be abused by an adversary with administrative access to write files to arbitrary locations and achieve remote code execution. Credited..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/citrix-netscaler-alert-ransomware.html", "tags": "Vulnerability / Network Security", "title": "Citrix NetScaler Alert: Ransomware Hackers Exploiting Critical Vulnerability", "desc": "Unpatched Citrix NetScaler systems exposed to the internet are being targeted by unknown threat actors in what's suspected to be a ransomware attack. Cybersecurity company Sophos is  tracking  the activity cluster under the moniker  STAC4663 . Attack chains involve the exploitation of  CVE-2023-3519 , a critical code injection vulnerability impacting NetScaler ADC and Gateway servers that could facilitate unauthenticated remote code execution. In one intrusion detected in mid-August 2023, the security flaw is said to have been used to conduct a domain-wide attack, including injecting payloads into legitimate executables such as the Windows Update Agent (wuauclt.exe) and the Windows Management Instrumentation Provider Service (wmiprvse.exe). An analysis of the payload is underway. Other notable aspects include the distribution of obfuscated PowerShell scripts, PHP web shells, and the use of an Estonian service called BlueVPS for malware staging. Sophos said the modus operandi..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/cyberattacks-targeting-e-commerce.html", "tags": "Pentesting As A Service", "title": "Cyberattacks Targeting E-commerce Applications", "desc": "Cyber attacks on e-commerce applications are a common trend in 2023 as e-commerce businesses become more omnichannel, they build and deploy increasingly more API interfaces, with threat actors constantly exploring more ways to exploit vulnerabilities. This is why regular testing and ongoing monitoring are necessary to fully protect web applications, identifying weaknesses so they can be mitigated quickly. In this article, we will discuss the recent Honda e-commerce platform attack, how it happened, and its impact on the business and its clients. In addition, to the importance of application security testing, we will also discuss the different areas of vulnerability testing and its various phases. Finally, we will provide details on how a long-term preventative solution such as  PTaaS  can protect e-commerce businesses and the differences between continuous testing (PTaaS) and standard pen testing. The 2023 Honda E-commerce Platform Attack Honda's power equipment, lawn, garden, and..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/urgent-fbi-warning-barracuda-email.html", "tags": "Email Security / Vulnerability", "title": "Urgent FBI Warning: Barracuda Email Gateways Vulnerable Despite Recent Patches", "desc": "The U.S. Federal Bureau of Investigation (FBI) is warning that Barracuda Networks Email Security Gateway (ESG) appliances patched against a recently disclosed critical flaw continue to be at risk of potential compromise from suspected Chinese hacking groups. It also  deemed  the fixes as \"ineffective\" and that it \"continues to observe active intrusions and considers all affected Barracuda ESG appliances to be compromised and vulnerable to this exploit.\" Tracked as  CVE-2023-2868  (CVSS score: 9.8), the zero-day bug is said to have been weaponized as early as October 2022, more than seven months before the security hole was plugged. Google-owned Mandiant is tracking the China-nexus activity cluster under the name  UNC4841 . The remote command injection vulnerability, impacting versions 5.1.3.001 through 9.2.0.006, allows for unauthorized execution of system commands with administrator privileges on the ESG product. In the attacks observed so far, a successful b..."}]