[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/new-sec-rules-require-us-companies-to.html", "tags": "Data Breach / Cyber Attack", "title": "New SEC Rules Require U.S. Companies to Reveal Cyber Attacks Within 4 Days", "desc": "The U.S. Securities and Exchange Commission (SEC) on Wednesday approved new rules that require publicly traded companies to publicize details of a cyber attack within four days of identifying that it has a \"material\" impact on their finances, marking a major shift in how computer breaches are disclosed. \"Whether a company loses a factory in a fire — or millions of files in a cybersecurity incident — it may be material to investors,\" SEC chair Gary Gensler  said . \"Currently, many public companies provide cybersecurity disclosure to investors. I think companies and investors alike, however, would benefit if this disclosure were made in a more consistent, comparable, and decision-useful way.\" To that end, the new obligations mandate that companies reveal the incident's nature, scope, and timing, as well as its impact. This disclosure, however, may be delayed by an additional period of up to 60 days should it be determined that giving out such specific..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/how-to-protect-patients-and-their.html", "tags": "SaaS Security / Healthcare", "title": "How to Protect Patients and Their Privacy in Your SaaS Apps", "desc": "The healthcare industry is under a constant barrage of cyberattacks. It has traditionally been one of the most frequently targeted industries, and things haven't changed in 2023. The U.S. Government's Office for Civil Rights reported  145 data breaches  in the United States during the first quarter of this year. That follows 707 incidents a year ago, during which over 50 million records were stolen. Health records often include names, birth dates, social security numbers, and addresses. This treasure trove of data is used in identity theft, tax fraud, and other crimes. It is the high value of the data that makes healthcare applications such a promising target. The healthcare industry was hesitant to adopt SaaS applications. However, SaaS applications lead to better collaboration among medical professionals, leading to improved patient outcomes. That, combined with SaaS's ability to reduce costs and improve financial performance, has led to the industry fully embracing SaaS solutions..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/owner-of-breachforums-pleads-guilty-to.html", "tags": "Cybercrime / Data Breach", "title": "Owner of BreachForums Pleads Guilty to Cybercrime and Child Pornography Charges", "desc": "Conor Brian Fitzpatrick , the owner of the now-defunct BreachForums website, has pleaded guilty to charges related to his operation of the cybercrime forum as well as having child pornography images. The development,  first reported  by DataBreaches.net last week, comes nearly four months after Fitzpatrick (aka pompompurin) was  formally charged  in the U.S. with conspiracy to commit access device fraud and possession of child pornography. BreachForums, launched in March 2022, operated as an illegal marketplace that allowed its members to trade hacked or stolen databases, enabling other criminal actors to gain unauthorized access to target systems. It was shut down in March 2023 shortly after  Fitzpatrick's arrest  in New York. As many as 888 databases consisting of 14 billion individual records are estimated to have been found in total. The forum had over 333,000 members prior to its takedown. \"The purpose of BreachForums, and Fitzpatrick's intent in operating the f..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/jumpcloud-blames-sophisticated-nation.html", "tags": "Data Security / Cyber Attack", "title": "JumpCloud Blames 'Sophisticated Nation-State' Actor for Security Breach", "desc": "A little over a week after  JumpCloud reset API keys of customers  impacted by a security incident, the company said the intrusion was the work of a sophisticated nation-state actor. The adversary \"gained unauthorized access to our systems to target a small and specific set of our customers,\" Bob Phan, chief information security officer (CISO) at JumpCloud,  said  in a post-mortem report. \"The attack vector used by the threat actor has been mitigated.\" The U.S. enterprise software firm said it identified anomalous activity on June 27, 2023, on an internal orchestration system, which it traced back to a spear-phishing campaign mounted by the attacker on June 22. While JumpCloud said it took security steps to shield its network by rotating credentials and rebuilding its systems, it wasn't until July 5 when it detected \"unusual activity\" in the commands framework for a small set of customers, prompting a forced-rotation of all admin API keys. The num..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/jumpcloud-resets-api-keys-amid-ongoing.html", "tags": "Security Incident / API Security", "title": "JumpCloud Resets API Keys Amid Ongoing Cybersecurity Incident", "desc": "JumpCloud, a provider of cloud-based identity and access management solutions, has swiftly reacted to an ongoing cybersecurity incident that impacted some of its clients. As part of its damage control efforts, JumpCloud has reset the application programming interface (API) keys of all customers affected by this event, aiming to protect their valuable data. The company has informed the concerned clients about the critical nature of this move, reinforcing its commitment to safeguarding their operations and organizations. This API key reset will, however, disrupt certain functionalities like AD import, HRIS integrations, JumpCloud PowerShell modules, JumpCloud Slack apps, Directory Insights Serverless apps, ADMU, third-party zero-touch MDM packages, Command Triggers, Okta SCIM integration, Azure AD SCIM integration, Workato, Aquera, Tray, and more. Despite the potential disruptions, JumpCloud maintains that the key reset is for the greater good of its clients. For those needing assis..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/05/why-honeytokens-are-future-of-intrusion.html", "tags": "Intrusion Detection / Honeypot", "title": "Why Honeytokens Are the Future of Intrusion Detection", "desc": "A few weeks ago, the 32nd edition of RSA, one of the world's largest cybersecurity conferences, wrapped up in San Francisco. Among the highlights, Kevin Mandia, CEO of Mandiant at Google Cloud, presented a retrospective on  the state of cybersecurity . During his keynote, Mandia stated: \"There are clear steps organizations can take beyond common safeguards and security tools to strengthen their defenses and increase their chances of detecting, thwarting or minimizing attack [...] Honeypots , or fake accounts deliberately left untouched by authorized users,  are effective at helping organizations detect intrusions or malicious activities that security products can't stop \". \"Build honeypots\" was one of his seven pieces of advice to help organizations avoid some of the attacks that might require engagement with Mandiant or other incident response firms. As a reminder, honeypots are  decoy systems  that are set up to lure attackers and divert their attentio..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/05/msi-data-breach-private-code-signing.html", "tags": "Data Breach / Software Security", "title": "MSI Data Breach: Private Code Signing Keys Leaked on the Dark Web", "desc": "The threat actors behind the ransomware attack on Taiwanese PC maker MSI last month have leaked the company's private code signing keys on their dark website. \"Confirmed, Intel OEM private key leaked, causing an impact on the entire ecosystem,\" Alex Matrosov, founder and CEO of firmware security firm Binarly,  said  in a tweet over the weekend. \"It appears that Intel Boot Guard may not be effective on certain devices based on the 11th Tiger Lake, 12th Adler Lake, and 13th Raptor Lake.\" Present in the leaked data are firmware image signing keys associated with 57 PCs and private signing keys for Intel Boot Guard used on 116 MSI products. The Boot Guard keys from MSI are believed to impact several device vendors, including Intel, Lenovo and Supermicro. Intel Boot Guard is a  hardware-based security technology  that's designed to protect computers against executing tampered UEFI firmware. The development comes a month after MSI  fell victim  to a double..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/05/western-digital-confirms-customer-data.html", "tags": "Data Breach / Ransomware", "title": "Western Digital Confirms Customer Data Stolen by Hackers in March Breach", "desc": "Digital storage giant Western Digital confirmed that an \"unauthorized third party\" gained access to its systems and stole personal information belonging to the company's online store customers. \"This information included customer names, billing and shipping addresses, email addresses and telephone numbers,\" the San Jose-based company  said  in a disclosure last week. \"In addition, the database contained, in encrypted format, hashed and salted passwords and partial credit card numbers. We will communicate directly with impacted customers.\" The development comes a little over a month after Western Digital  divulged  a \"network security incident\" on March 26, 2023, prompting the company to take its cloud services offline. A subsequent report from TechCrunch last month  revealed  that the threat actors behind the attack were allegedly in possession of \"around 10 terabytes of data\" and were negotiating with Western Digital for a ra..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/04/kodi-confirms-data-breach-400k-user.html", "tags": "Data Breach / Cyber Security", "title": "Kodi Confirms Data Breach: 400K User Records and Private Messages Stolen", "desc": "Open source media player software provider Kodi has confirmed a data breach after threat actors stole the company's MyBB forum database containing user data and private messages. What's more, the unknown threat actors  attempted to sell  the data dump  comprising 400,635 Kodi users  on the now-defunct  BreachForums  cybercrime marketplace. \"MyBB admin logs show the account of a trusted but currently inactive member of the forum admin team was used to access the web-based MyBB admin console twice: on 16 February and again on 21 February,\" Kodi  said  in an advisory. The threat actors then abused the account to create database backups that were then downloaded and deleted. Also downloaded were existing nightly full backups of the database. The account in question has now been disabled. The nightly backups contained all public forum posts, team forum posts, messages sent through the user-to-user messaging system, and user information such as forum username, email a..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/04/fbi-cracks-down-on-genesis-market-119.html", "tags": "Data Breach", "title": "FBI Cracks Down on Genesis Market: 119 Arrested in Cybercrime Operation", "desc": "A joint international law enforcement operation has dismantled Genesis Market, an illegal online marketplace that specialized in the sale of stolen credentials associated with email, bank accounts, and social media platforms. Coinciding with the infrastructure seizure, the major crackdown, which involved authorities from 17 countries, culminated in 119 arrests and 208 property searches in 13 nations. However, the  .onion mirror of the market  appears to be still up and running . The \"unprecedented\"  law   enforcement   exercise  has been codenamed  Operation Cookie Monster . Genesis Market, since its inception in March 2018, evolved into a major hub for criminal activities, offering access to data stolen from over 1.5 million compromised computers across the world totaling more than 80 million credentials. A majority of infections associated with Genesis Market related malware have been detected in the U.S., Mexico, Germany, Turkey, Sweden, Italy, France, Spain, Poland,..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/04/protect-your-company-ransomware.html", "tags": "Endpoint / Network Security", "title": "Protect Your Company: Ransomware Prevention Made Easy", "desc": "Every year hundreds of millions of malware attacks occur worldwide, and every year businesses deal with the impact of viruses, worms, keyloggers, and ransomware. Malware is a pernicious threat and the biggest driver for businesses to look for cybersecurity solutions.  Naturally, businesses want to find products that will stop malware in its tracks, and so they search for solutions to do that. But  malware protection  alone is not enough, instead what's needed is a more holistic approach. Businesses need to defend against malware entering the network, and then on top of that have systems and processes in place to restrict the damage that malware can do if it infects a user device.  This approach will not only help stop and mitigate the damage from malware, but defend against other types of threats too, such as credential theft as a result of phishing, insider threats, and supply-chain attacks.  Element 1: Malware Protection and Web Filtering The first and most sensible place to..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/04/western-digital-hit-by-network-security.html", "tags": "Cyber Attack / Data Security", "title": "Western Digital Hit by Network Security Breach - Critical Services Disrupted!", "desc": "Data storage devices maker Western Digital on Monday disclosed a \"network security incident\" that involved unauthorized access to its systems. The  breach  is said to have occurred on March 26, 2023, enabling an unnamed third party to gain access to a \"number of the company's systems.\" Following the discovery of the hack, Western Digital said it has initiated incident response efforts and enlisted the help of cybersecurity and forensic experts to conduct an investigation. It also said it's coordinating with law enforcement agencies on the matter, adding the probe is in its initial stages. The company has taken several of its services offline, noting that the threat actor may have obtained \"certain data from its systems\" and that it's working on estimating the nature and scope of the data accessed. While Western Digital did not reveal the exact services that are impacted, the  My Cloud status page  shows that cloud, proxy, web, authentica..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/03/20-year-old-breachforums-founder-faces.html", "tags": "Cyber Crime / Data Breach", "title": "20-Year-Old BreachForums Founder Faces Up to 5 Years in Prison", "desc": "Conor Brian Fitzpatrick, the 20-year-old founder and the administrator of the now-defunct BreachForums has been  formally charged  in the U.S. with conspiracy to commit access device fraud. If proven guilty, Fitzpatrick, who went by the online moniker \"pompompurin,\" faces a maximum penalty of up to five years in prison. He was  arrested  on March 15, 2023. \"Cybercrime victimizes and steals financial and personal information from millions of innocent people,\" said U.S. Attorney Jessica D. Aber for the Eastern District of Virginia. \"This arrest sends a direct message to cybercriminals: your exploitative and illegal conduct will be discovered, and you will be brought to justice.\" The development comes days after Baphomet, the individual who had taken over the responsibilities of BreachForums,  shut down the website , citing concerns that law enforcement may have obtained access to its backend. The Department of Justice (DoJ) has since confirmed that it co..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/03/openai-reveals-redis-bug-behind-chatgpt.html", "tags": "Artificial Intelligence / Data Security", "title": "OpenAI Reveals Redis Bug Behind ChatGPT User Data Exposure Incident", "desc": "OpenAI on Friday disclosed that a bug in the Redis open source library was responsible for the exposure of other users' personal information and chat titles in the upstart's ChatGPT service earlier this week. The  glitch , which came to light on March 20, 2023, enabled certain users to view brief descriptions of other users' conversations from the chat history sidebar, prompting the company to temporarily shut down the chatbot. \"It's also possible that the first message of a newly-created conversation was visible in someone else's chat history if both users were active around the same time,\" the company  said . The bug, it further added, originated in the  redis-py library , leading to a scenario where canceled requests could cause connections to be corrupted and return unexpected data from the database cache, in this case, information belonging to an unrelated user. To make matters worse, the San Francisco-based AI research company said it introduce..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/03/new-cyber-platform-lab-1-decodes-dark.html", "tags": "Data Breach / Dark Web", "title": "New Cyber Platform Lab 1 Decodes Dark Web Data to Uncover Hidden Supply Chain Breaches", "desc": "2022 was the year when inflation hit world economies, except in one corner of the global marketplace – stolen data. Ransomware payments fell by over 40% in 2022 compared to 2021. More organisations chose not to pay ransom demands, according to findings by blockchain firm Chainalysis. Nonetheless, stolen data has value beyond a price tag, and in risky ways you may not expect. Evaluating stolen records is what  Lab 1, a new cyber monitoring platform , believes will make a big difference for long-term cybersecurity resilience. Think of data value this way:  Stolen credentials can become future phishing attacks Logins for adult websites are potential extortion attempts Travel and location data are a risk to VIPs and senior leadership, And so on… Hackers could retaliate for non-payment by simply posting their loot to forums where the data will be available for further enrichment and exploitation.  Shining a light on dark places Even though your company may not have suffered a di..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/03/pompompurin-unmasked-infamous.html", "tags": "Cyber Crime / Data Breach", "title": "Pompompurin Unmasked: Infamous BreachForums Mastermind Arrested in New York", "desc": "U.S. law enforcement authorities have arrested a 21-year-old New York man in connection with running the infamous BreachForums hacking forum under the online alias \" Pompompurin .\" The development, first reported by  Bloomberg Law , comes after News 12 Westchester, earlier this week, said that federal investigators \"spent hours inside and outside of a home in Peekskill.\" \"At one point, investigators were seen removing several bags of evidence from the house,\" the New York-based local news service  added . According  to an  affidavit  filed by the Federal Bureau of Investigation (FBI), the suspect identified himself as Conor Brian Fitzpatrick and admitted to being the owner of the BreachForums website. \"When I arrested the defendant on March 15, 2023, he stated to me in substance and in part that: a) his name was Conor Brian Fitzpatrick; b) he used the alias 'pompompurin,' and c) he was the owner and administrator of 'BreachForums,&#..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/03/multiple-hacker-groups-exploit-3-year.html", "tags": "Cyber Attack / Vulnerability", "title": "Multiple Hacker Groups Exploit 3-Year-Old Vulnerability to Breach U.S. Federal Agency", "desc": "Multiple threat actors, including a nation-state group, exploited a critical three-year-old security flaw in Progress Telerik to break into an unnamed federal entity in the U.S. The  disclosure  comes from a  joint advisory  issued by the Cybersecurity and Infrastructure Security Agency (CISA), Federal Bureau of Investigation (FBI), and Multi-State Information Sharing and Analysis Center (MS-ISAC). \"Exploitation of this vulnerability allowed malicious actors to successfully execute remote code on a federal civilian executive branch (FCEB) agency's Microsoft Internet Information Services (IIS) web server,\" the agencies  said . The indicators of compromise (IoCs) associated with the digital break-in were identified from November 2022 through early January 2023. Tracked as  CVE-2019-18935  (CVSS score: 9.8), the issue relates to a .NET  deserialization vulnerability  affecting Progress Telerik UI for ASP.NET AJAX that, if left unpatched, could  lead to remote code exec..."}]