[{"source": "DataBreaches", "title": "ChildFund NZ discloses third-party breach", "desc": "ChildFund in New Zealand has issued a public notice about a data breach involving a telemarketing company, Pareto Phone Limited. ChildFund had contracted with Pareto in 2014 to conduct fundraising activity on its behalf. ChildFund does not say when it may have stopped working Pareto, but Pareto suffered a cyberattack in April of this...", "link": "https://www.databreaches.net/childfund-nz-discloses-third-party-breach/"}, {"source": "DataBreaches", "title": "British charities warn supporters their personal data has been breached", "desc": "Graham Cluley writes: UK charities including Shelter, the RSPCA, the Dogs Trust, Battersea Dogs and Cats Home, and Friends of the Earth have warned their supporters that hackers have stolen their data following a breach at a supplier. The charities themselves haven’t been hacked. The problem instead lies with third-parties working with the charities...", "link": "https://www.databreaches.net/british-charities-warn-supporters-their-personal-data-has-been-breached/"}, {"source": "DataBreaches", "title": "Chinese hackers stole 60,000 emails from US State Department in Microsoft hack, Senate staffer says", "desc": "Raphael Satter reports: Chinese hackers who subverted Microsoft’s email platform earlier this year managed to steal tens of thousands of emails from U.S. State Department accounts, a Senate staffer told Reuters on Wednesday. The staffer, who attended a briefing of State Department IT officials earlier Wednesday, said the officials told lawmakers that 60,000 emails...", "link": "https://www.databreaches.net/chinese-hackers-stole-60000-emails-from-us-state-department-in-microsoft-hack-senate-staffer-says/"}, {"source": "DataBreaches", "title": "Baruch College closed for the remainder of the week amid malware attack", "desc": "Suporna Das reports: Baruch College extended remote learning through Sept. 29 after announcing on Sept. 27 that the network outages across the campus were due to a malware attack.  Baruch Computing and Technology Center and other departments have restored some of Baruch’s network, including the website and Baruch’s email. It did not state...", "link": "https://www.databreaches.net/baruch-college-closed-for-the-remainder-of-the-week-amid-malware-attack/"}, {"source": "DataBreaches", "title": "Healthcare Organizations Experience 279% Increase in Business Email Compromise in 2023", "desc": "Mike Britton writes about data collected by Abnormal Security: According to Abnormal data, the healthcare industry is experiencing a 167% increase in advanced email attacks in 2023, which includes BEC, credential phishing, malware, and extortion. While the year isn’t over yet, this signals the need for more sophisticated security to protect patients, employees, and the...", "link": "https://www.databreaches.net/healthcare-organizations-experience-279-increase-in-business-email-compromise-in-2023/"}, {"source": "DataBreaches", "title": "‘Snatch’ Ransom Group Exposes Visitor IP Addresses", "desc": "Brian Krebs reports: The victim shaming site operated by the Snatch ransomware group is leaking data about its true online location and internal operations, as well as the Internet addresses of its visitors, KrebsOnSecurity has found. The leaked data suggest that Snatch is one of several ransomware groups using paid ads on Google.com to trick people...", "link": "https://www.databreaches.net/snatch-ransom-group-exposes-visitor-ip-addresses/"}, {"source": "DataBreaches", "title": "Oak Valley Hospital District notifies more than 280,000 patients of data breach", "desc": "On September 15, Oak Valley Hospital District in California notified the state and HHS of a data security incident that began on April 21 and was first discovered on July 18. According to its notification, a copy of which is also posted on its website, Oak Valley could not rule out the possibility of...", "link": "https://www.databreaches.net/oak-valley-hospital-district-notifies-more-than-280000-patients-of-data-breach/"}, {"source": "DataBreaches", "title": "The kids aren’t alright: How DOJ is reckoning with malicious teenage hackers", "desc": "The Washington Post reports: Teenage hackers like those who may have been behind recent cyberattacks on casinos are being “radicalized” online in a way similar to people who once turned to terrorism and they benefit from a digital economy that enables them to get into the field quickly and easily, a top Justice Department...", "link": "https://www.databreaches.net/the-kids-arent-alright-how-doj-is-reckoning-with-malicious-teenage-hackers/"}, {"source": "DataBreaches", "title": "Mo: Maries County Emergency Managements says it was hit with cyber attack, says one 911 call affected", "desc": "Ryan Shiner reports: Maries County Emergency Management announced Monday on its Facebook page that the Maries County Courthouse was the target of a cyber attack and that the attack is now over. Maries County EM said the attack began last week and appeared to have caused intermittent phone and internet issues, before causing issues with administration...", "link": "https://www.databreaches.net/mo-maries-county-emergency-managements-says-it-was-hit-with-cyber-attack-says-one-911-call-affected/"}, {"source": "DataBreaches", "title": "Data breaches put domestic abuse victims’ lives at risk, UK Information Commissioner warns", "desc": "From the U.K. Information Commissioner’s Office: Warning comes after the ICO reprimands seven organisations in the past 14 months for data breaches affecting victims of domestic abuse. Most cases related to organisations inappropriately disclosing the victim’s home address to alleged perpetrators. Commissioner urges organisations to take responsibility for training their staff and putting appropriate...", "link": "https://www.databreaches.net/data-breaches-put-domestic-abuse-victims-lives-at-risk-uk-information-commissioner-warns/"}, {"source": "DataBreaches", "title": "Broomfield Skilled Nursing and Rehabilitation Center settles breach-related charges with Colorado Attorney General", "desc": "Colorado Attorney General Phil Weiser recently announced a settlement with Broomfield Skilled Nursing and Rehabilitation Center, LLC stemming from a 2021 data breach. The following is the state’s press release: Sept. 22, 2023 (DENVER) – Attorney General Phil Weiser announced today a settlement with Broomfield Skilled Nursing and Rehabilitation Center, LLC., for failing to protect the...", "link": "https://www.databreaches.net/broomfield-skilled-nursing-and-rehabilitation-center-settles-breach-related-charges-with-colorado-attorney-general/"}, {"source": "DataBreaches", "title": "New AtlasCross hackers use American Red Cross as phishing lure", "desc": "It seems we are finding out about new groups on a daily basis recently.  Now Bill Toulas reports on another one: A new APT hacking group named ‘AtlasCross’ targets organizations with phishing lures impersonating the American Red Cross to deliver backdoor malware. Cybersecurity firm NSFocus identified two previously undocumented trojans, DangerAds and AtlasAgent, associated...", "link": "https://www.databreaches.net/new-atlascross-hackers-use-american-red-cross-as-phishing-lure/"}, {"source": "DataBreaches", "title": "Emerging cybersecurity threats in healthcare | Special Report", "desc": "Ron Southwick of Chief Healthcare Executive notes what a bad  year this has already been in terms of breaches in the healthcare sector, but notes things may even get worse: Even with those dire signs about the dangers of cyberattacks, experts warn that health systems will face new and emerging threats in the years...", "link": "https://www.databreaches.net/emerging-cybersecurity-threats-in-healthcare-special-report/"}, {"source": "DataBreaches", "title": "Swan Retail cyber attack woes continue", "desc": "Sabina Weston reports: More than six weeks after hackers caused “significant disruption” to Swan Retail’s inventory management, order fulfilment and accounting systems, fashion retailers told Drapers the issues have still not been resolved. Sandersons Boutique owner and co-founder Mark Dransfield said the cyber attack on Swan Retail, which occurred on 13 August, “has hugely affected”...", "link": "https://www.databreaches.net/swan-retail-cyber-attack-woes-continue/"}, {"source": "DataBreaches", "title": "ShadowSyndicate linked to 7 ransomware attacks in the past year", "desc": "Kumar Hemant reports: ShadowSyndicate group (formerly known as Infra Storm) has been suspected of deploying seven different ransomware families in a series of attacks that have spanned the past year. Security researchers from Group-IB, working in conjunction with Bridewell and independent researcher Michael Koczwara, exposed the clandestine operations of the threat actor. Their findings...", "link": "https://www.databreaches.net/shadowsyndicate-linked-to-7-ransomware-attacks-in-the-past-year/"}, {"source": "DataBreaches", "title": "Biggest Crypto Hack of 2023: Mixin Network Stops Withdrawals After Losing $200 Million to Hackers", "desc": "Daniel Warren reports: The Mixin network was recently hit by a multi-million dollar hack. Mixin confirmed that over $200 million worth of cryptocurrencies were wiped from its mainnet due to a security breach on September 23. According to recent data, this is equivalent to half of the net TVL of all mixin-based protocols. In...", "link": "https://www.databreaches.net/biggest-crypto-hack-of-2023-mixin-network-stops-withdrawals-after-losing-200-million-to-hackers/"}, {"source": "DataBreaches", "title": "AlphV claims to have hit MNGI Digestive Health — developing", "desc": "MNGI Digestive Health (MNGI) in Minnesota is a physician-owned multi-center gastroenterology practice that has been recognized for its excellence. MNGI was previously known as Minnesota Gastroenterology, P.A., and was created by partnership of three independent practices: Digestive Healthcare, Gastroenterology Consultants, and St. Paul Gastroenterology. Unfortunately, excellence in medical practice and care does not immunize...", "link": "https://www.databreaches.net/alphv-claims-to-have-hit-mngi-digestive-health-developing/"}, {"source": "DataBreaches", "title": "Ca: Better Outcomes Registry & Network reveals 3.4 million patients affected by MOVEit data breach", "desc": "BORN (the Better Outcomes Registry & Network) in Canada has disclosed it was affected by the MOVEit breach. From their notice: During the breach, unauthorized copies of files containing personal health information were taken from BORN’s systems. The personal health information that was copied was collected from a large network of mostly Ontario health...", "link": "https://www.databreaches.net/ca-better-outcomes-registry-network-reveals-3-4-million-patients-affected-by-moveit-data-breach/"}, {"source": "DataBreaches", "title": "Personal data of 25,000 Hongkongers at risk after cyberattack against consumer watchdog, up from earlier estimate of 8,000", "desc": "Harvey Kong reports: Hong Kong’s Consumer Council has revealed that the personal data of more than 25,000 people may have been leaked in a cyberattack against the watchdog, up from an earlier estimate of 8,000.  The council last Friday said at a press conference that it had fallen victim to a cyberattack and...", "link": "https://www.databreaches.net/personal-data-of-25000-hongkongers-at-risk-after-cyberattack-against-consumer-watchdog-up-from-earlier-estimate-of-8000/"}, {"source": "DataBreaches", "title": "Audits of New York schools and the State Education Department reveal ongoing significant concerns", "desc": "In May, the NYS Comptroller’s Office released an audit conducted to determine if the New York State Education Department (SED) consistently follows all laws and regulations regarding the safety and privacy of students’ data, and whether SED is properly monitoring school districts to ensure they are complying with the legislation and regulations that govern...", "link": "https://www.databreaches.net/audits-of-new-york-schools-and-the-state-education-department-reveal-ongoing-significant-concerns/"}, {"source": "DataBreaches", "title": "Hillsborough County Public Schools alert parents to August cyberattack, data breach", "desc": "On September 15, DataBreaches reported LockBit3.0 had added Hillsborough County Public Schools in Florida to their dark web leak site.  There is currently less than two days left on their countdown clock to leak data, although LockBit3.0 does not always strictly follow up with their own deadlines. While the district originally reported on September...", "link": "https://www.databreaches.net/hillsborough-county-public-schools-alert-parents-to-august-cyberattack-data-breach/"}, {"source": "DataBreaches", "title": "Bermuda government hit by cyberattack, premier’s incident response criticized", "desc": "On Friday, The Jamaica Gleaner reported that the government of Bermuda was hit by a cyberattack, suspected of originating in Russia. In early reports, the government said its telephone, Internet and e-mail systems were disrupted and that all departments were affected, which suggests this was a ransomware attack. The Bermuda Police Service said that...", "link": "https://www.databreaches.net/bermuda-government-hit-by-cyberattack-premiers-incident-response-criticized/"}, {"source": "DataBreaches", "title": "Hinds County approves spending hundreds of thousands of dollars in payments for cyberattack recovery efforts", "desc": "Anthony Warren reports from Mississippi: Hinds County approved more than than $600,000 in payments Friday to restore its computer system after cyberattacks took it down days ago. At an emergency board meeting on Friday afternoon, the board voted 3-0 to approve paying $335,100 for cyber recovery services to Netlink Voice LLC, and up to...", "link": "https://www.databreaches.net/hinds-county-approves-spending-hundreds-of-thousands-of-dollars-in-payments-for-cyberattack-recovery-efforts/"}, {"source": "DataBreaches", "title": "Bellone signs 13th emergency order related to year-old cyberattack by AlphV, delays county budget", "desc": "Mark Harrington reports from Long Island: Suffolk County Executive Steve Bellone last week signed the 13th “local emergency order” tied to the September 2022 ransomware attack, delaying the county operating budget by a week while also declaring states of emergencies tied to the migrant crisis and Hurricane Lee. The latest cyberattack-related emergency declaration cites the...", "link": "https://www.databreaches.net/bellone-signs-13th-emergency-order-related-to-year-old-cyberattack-by-alphv-delays-county-budget/"}, {"source": "DataBreaches", "title": "Large-scale cyberattack reported in occupied Crimea", "desc": "On Friday, The Kyiv Independent reported that Russian proxies in occupied Crimea announced that there was a cyberattack of an “unprecedented” scale. “The attack occurred after the Russian Defense Ministry announced that a Ukrainian missile had struck Russia’s Black Sea Fleet headquarters in Sevastopol earlier in the day on Sept. 22,” they announced. More...", "link": "https://www.databreaches.net/large-scale-cyberattack-reported-in-occupied-crimea/"}, {"source": "DataBreaches", "title": "Ransomware group claimed to have hit a New Jersey cardiology group. Did they?", "desc": "On September 2, the NoEscape ransomware group added Mulkay Cardiology Consultants to their leak site and claimed to have successfully encrypted them. “We have 60GB of confidential and personal data on more than 30,000 patients, scans, doctor’s conclusions about patients and many other confidential information,” they claimed in their listing about the New Jersey...", "link": "https://www.databreaches.net/ransomware-group-claimed-to-have-hit-a-new-jersey-cardiology-group-did-they/"}, {"source": "DataBreaches", "title": "MGM, Caesars casino hacks point to an alliance of teens and ransomware gangs", "desc": "Joseph Menn reports on the group of hackers some have called “Scattered Spider:” … New research being presented Friday at the LABScon security conference outside Phoenix gives an origin story to the hackers, who the experts say call themselves Star Fraud. They say the group consists of a few dozen hackers who have connected...", "link": "https://www.databreaches.net/mgm-caesars-casino-hacks-point-to-an-alliance-of-teens-and-ransomware-gangs/"}, {"source": "DataBreaches", "title": "National Student Clearinghouse notifies California on behalf of almost 900 schools affected by MOVEit breach", "desc": "Well, we expected there would be a lot of schools notified by the National Student Clearinghouse about the MOVEit breach, but now we have a bit more of the scope. NSC has notified the California Attorney General’s Office on behalf of almost 900 schools. Their notification letter to those affected indicated that the types...", "link": "https://www.databreaches.net/national-student-clearinghouse-notifies-california-on-behalf-of-almost-900-schools-affected-by-moveit-breach/"}, {"source": "DataBreaches", "title": "Pain Care Specialists may be feeling the pain of a ransomware attack", "desc": "It appears that Pain Care Specialists in Oregon became the victim of an attack by AlphV. The threat actors added the medical entity to their leak site earlier today with some files with personal information on employees and patients. AlphV’s listing noted that the breach occurred on September 13, and, “As a result of...", "link": "https://www.databreaches.net/pain-care-specialists-may-be-feeling-the-pain-of-a-ransomware-attack/"}, {"source": "DataBreaches", "title": "Leander ISD sends email about students’ vaccination status to over 200 people", "desc": "Melia Masumoto reports: Cedar Park Middle School sent out an email to 207 parents earlier this week, requesting updated vaccine records. But without blind coping the email addresses, every address on the email was visible to all the recipients. … The email requested an updated immunization record for those students because they were missing...", "link": "https://www.databreaches.net/leander-isd-sends-email-about-students-vaccination-status-to-over-200-people/"}, {"source": "DataBreaches", "title": "Nansen Warns Of Potential Phishing Attacks Following Vendor Security Incident Exposing Customer Data", "desc": "Liam ‘Akiba’ Wright reports: Crypto analytics platform Nansen has revealed that a bad actor accessed its admin system to provision customer accounts. On Sept. 20, a security breach by one of Nansen’s third-party vendors led to compromised customer access, underscoring the ever-present digital risk, particularly in the continually evolving arena of blockchain technology and...", "link": "https://www.databreaches.net/nansen-warns-of-potential-phishing-attacks-following-vendor-security-incident-exposing-customer-data/"}, {"source": "DataBreaches", "title": "What to know about the University of Minnesota’s data breach", "desc": "Devlin Epding reports what the U. of Minnesota has been uncovering about a breach first discovered in July. After investigating a data breach report from August, the University of Minnesota acknowledged Thursday that personal information about students, prospective students and employees across 30 years has been compromised. The U began its investigation after an...", "link": "https://www.databreaches.net/what-to-know-about-the-university-of-minnesotas-data-breach/"}, {"source": "DataBreaches", "title": "Ohio Community College Data Theft Breach Affects Nearly 300K", "desc": "Marianne Kobalsuk McGee reports: An Ohio community college is notifying 290,000 people of a data theft breach this spring that may have compromised their personal, financial and health information. In a breach notification Wednesday, Lakeland Community College did not provide any details on the attack, which occurred between March 7 and March 31, but...", "link": "https://www.databreaches.net/ohio-community-college-data-theft-breach-affects-nearly-300k/"}, {"source": "DataBreaches", "title": "Attorney General James Reaches Agreement with Marymount Manhattan College to Invest $3.5 Million to Protect Students’ Online Data", "desc": "NEW YORK – New York Attorney General Letitia James today announced an agreement with Marymount Manhattan College (MMC), a private non-profit liberal arts college in New York City, to invest $3.5 million in data security to protect students’ online data. In 2021, MMC suffered a data breach that affected nearly 100,000 New Yorkers who were...", "link": "https://www.databreaches.net/attorney-general-james-reaches-agreement-with-marymount-manhattan-college-to-invest-3-5-million-to-protect-students-online-data/"}, {"source": "DataBreaches", "title": "Crown Point schools 2022 ransomware attack cost $1M to resolve", "desc": "Adrian Martinez-De la Cruz reports that Crown Point Community School Corp. Superintendent Todd Terrill provided an update on the ransomware attack last November that cost the district about $1 million to resolve. The superintendent said the breach occurred after an employee fell for a phishing attack. The district decided to pay the attackers, and “a...", "link": "https://www.databreaches.net/crown-point-schools-2022-ransomware-attack-cost-1m-to-resolve/"}, {"source": "DataBreaches", "title": "DHS Pushes for Common Cyber Incident Reporting Definitions", "desc": "Jose Rascon reports: The Department of Homeland Security (DHS) has released a new report looking to wrangle the different avenues in which the Federal government and its agencies report cyber incidents in a more ‘reportable’ fashion. The report, titled “Harmonization of Cyber Incident Reporting to the Federal Government” and released on Sept. 19, comes...", "link": "https://www.databreaches.net/dhs-pushes-for-common-cyber-incident-reporting-definitions/"}, {"source": "DataBreaches", "title": "Hackers put over 2 million Pakistanis’ private data for sale after restaurant software breach", "desc": "Daily Pakistan reports: More than 2 million Pakistani citizens are facing risk of data leak as hackers got access to a private company-made database used by hundreds of restaurants. The incident affected customers who gave their private data to restaurants for a treasure trove of personal information like credit cards, addresses and other bank...", "link": "https://www.databreaches.net/hackers-put-over-2-million-pakistanis-private-data-for-sale-after-restaurant-software-breach/"}, {"source": "DataBreaches", "title": "Air Canada says unauthorized group breached employee data, hacked internal system", "desc": "Temur Durrani reports: Air Canada says an unauthorized group of people obtained access to its internal system, compromising the personal information of an unknown number of employees working for the country’s largest airline. In a brief statement on Wednesday afternoon, Air Canada spokesperson Peter Fitzpatrick said “certain records” were affected by the “limited” breach, without...", "link": "https://www.databreaches.net/air-canada-says-unauthorized-group-breached-employee-data-hacked-internal-system/"}, {"source": "DataBreaches", "title": "TissuPath’s data breach notice provides details about how they were attacked and their incident response", "desc": "Mirage reports: TissuPath, a specialist pathology firm in Australia, has experienced a data breach due to a cyber security incident. The breach involved a third-party supplier attack, accessing pathology referral records kept in a backup storage drive. Read more at Mirage News. TissuPath has posted a security notice on its website that begins with...", "link": "https://www.databreaches.net/tissupaths-data-breach-notice-provides-details-about-how-they-were-attacked-and-their-incident-response/"}, {"source": "DataBreaches", "title": "HK: Hacking of Cyberport sparks discussions of law on cyber security", "desc": "The Standard reports: Authorities are now mulling to introduce a law on cyber security and will strengthen communications with overseas agencies, said I&T minister Sun Dong following a recent hacking on Cyberport’s computer system. Some 400 gigabytes of data, including HKID card numbers, bank statements and resumes, was stolen and released on the dark...", "link": "https://www.databreaches.net/hk-hacking-of-cyberport-sparks-discussions-of-law-on-cyber-security/"}, {"source": "DataBreaches", "title": "Cyberattack on Kansas town affects email, phone, payment systems", "desc": "Jonathan Greig reports: A cyberattack on a small city in Kansas has disrupted the government’s email, phone and online payment systems. Pittsburg — home to about 20,000 people along the state’s border with Missouri and Oklahoma — said it discovered the incident over the weekend. The attack caused an IT outage that limited government...", "link": "https://www.databreaches.net/cyberattack-on-kansas-town-affects-email-phone-payment-systems/"}, {"source": "DataBreaches", "title": "Outage at Canadian airports was from a DDoS attack", "desc": "La Press reports (automatic machine translation follows): The widespread breakdown of border terminals in Canadian airports on Sunday, claimed by a group of pro-Russian hackers, was indeed the result of a computer attack. This would thus be a rare case, if not the first, where such an assault has real impacts on the country’s infrastructure,...", "link": "https://www.databreaches.net/outage-at-canadian-airports-was-from-a-ddos-attack/"}, {"source": "DataBreaches", "title": "Covington Client Intervenes in SEC Battle, Objecting to Disclosure of Identity", "desc": "Abigail Adcox reports: A Covington & Burling client whose information may have been exposed in a 2020 cyberattack is insisting that its identity should not be disclosed to the Securities and Exchange Commission, which had sought out client names in a subpoena to the law firm. The client, following a subpoena battle between Covington and...", "link": "https://www.databreaches.net/covington-client-intervenes-in-sec-battle-objecting-to-disclosure-of-identity/"}, {"source": "DataBreaches", "title": "Mount Desert Island Hospital updates its breach disclosure again but still doesn’t reveal what data were leaked", "desc": "On July 1, DataBreaches reported that  Mount Desert Island Hospital (MDIH) in Maine notified HHS on June 30 that 24,180 patients had been affected by a breach between April 28 and May 7. The types of protected health information involved included name, address, date of birth, driver’s license/state identification number, Social Security number, financial...", "link": "https://www.databreaches.net/mount-desert-island-hospital-updates-its-breach-disclosure-again-but-still-doesnt-reveal-what-data-were-leaked/"}, {"source": "DataBreaches", "title": "#StopRansomware: Snatch Ransomware", "desc": "There is a new Joint Cybersecurity Advisory issued today. This one is about Snatch Team. Summary: The Federal Bureau of Investigation (FBI) and the Cybersecurity and Infrastructure Security Agency(CISA) are releasing this joint CSA to disseminate known ransomware IOCs and TTPs associated with the Snatch ransomware variant identified through FBI investigations as recently as...", "link": "https://www.databreaches.net/stopransomware-snatch-ransomware/"}, {"source": "DataBreaches", "title": "Schools Are the Most Targeted Industry by Ransomware Gangs", "desc": "Waqas reports that based on research by Sophos, the education sector is the most vulnerable and targeted by ransomware attacks. KEY FINDINGS 80% of lower education providers and 79% of higher education institutions reported ransomware attacks in the last year. Education is the most targeted industry by cybercriminals, primarily motivated by the high percentage...", "link": "https://www.databreaches.net/schools-are-the-most-targeted-industry-by-ransomware-gangs/"}, {"source": "DataBreaches", "title": "OCR Presents:  How the Security Rule Can Help Defend Against Cyber-Attacks", "desc": "The HHS Office for Civil Rights (OCR) will be producing a pre-recorded webinar for HIPAA covered entities and business associates (collectively, “regulated entities”) discussing how the Security Rule can help regulated entities defend against cyber-attacks. The webinar will discuss real world cyber-attack trends from OCR breach reports and investigations and explore how implementation of...", "link": "https://www.databreaches.net/ocr-presents-how-the-security-rule-can-help-defend-against-cyber-attacks/"}, {"source": "DataBreaches", "title": "Freestyle Must Defend Lawsuit Following Data Breach, Judge Rules", "desc": "Skye Witley reports: Internet commerce services vendor Freestyle Solutions Inc. must face a trimmed-down lawsuit alleging it misled customers about its cybersecurity practices before hackers gained access to its network, a federal New Jersey court ruled. Freestyle succeeded in dismissing most of the claims, including negligence, but will have to defend issues surrounding its contract language, Judge...", "link": "https://www.databreaches.net/freestyle-must-defend-lawsuit-following-data-breach-judge-rules/"}, {"source": "DataBreaches", "title": "Customers of WeLeakInfo.to will receive a message from the Dutch police", "desc": "The following is a machine translation of a press release from the Dutch Politie: Hundreds of (possible) buyers of stolen data have received a letter or email from the East Netherlands police, and people are also invited for a stop interview. This approach is a follow-up to an investigation from 2022. In May of...", "link": "https://www.databreaches.net/customers-of-weleakinfo-to-will-receive-a-message-from-the-dutch-police/"}, {"source": "DataBreaches", "title": "Israeli mental health center in Jerusalem hit with cyberattack", "desc": "The Jerusalem Post reports: The Kfar Shaul Mental Health Center in Israel’s capital of Jerusalem was hit with a suspected cyberattack, the Health Ministry said Tuesday. The ministry’s cyber security department, as well as Israel’s Cyber Authority, are looking into the incident. The Times of Israel also reports a cyberattack, but says the suspected...", "link": "https://www.databreaches.net/israeli-mental-health-center-in-jerusalem-hit-with-cyberattack/"}]