[{"source": "FortiGuard Labs Fortinet", "title": "Google Chromium WebP Vulnerability", "desc": "The Google Chromium WebP heap buffer overflow vulnerability has been actively been exploited in the wild. The exploitation of the vulnerability is through a crafted image that can impact the affected applications to crash or lead to arbitrary code execution.", "link": "https://www.fortiguard.com/outbreak-alert/google-chromium-buffer-overflow"}, {"source": "FortiGuard Labs Fortinet", "title": "New Agent Tesla Variant in the Wild", "desc": "FortiGuard Labs captured a phishing campaign that spreads a new Agent Tesla variant. This well-known malware family uses a .Net-based Remote Access Trojan (RAT) and data stealer to gain initial access by exploiting Microsoft office vulnerabilities CVE-2017-11882 and CVE-2018-0802. The Agent Tesla core module can collect sensitive information from the victim’s device that may include the saved credentials, keylogging information, and device screenshots.", "link": "https://www.fortiguard.com/outbreak-alert/agent-tesla-malware-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "Adobe ColdFusion Actively Targeted", "desc": "FortiGuard Labs continues to see cyber attacks targeting to exploit the coldfusion vulnerability CVE-2023-26360. Adobe ColdFusion is a commercial rapid web-application and mobile applications development platform and is affected by Deserialization of Untrusted Data vulnerabilities (CVE-2023-26359, CVE-2023-26360) that could result in arbitrary code execution in the context of the current user. Exploitation of this issue does not require any user interaction.", "link": "https://www.fortiguard.com/outbreak-alert/adobe-coldfusion-code-execution"}, {"source": "FortiGuard Labs Fortinet", "title": "Ivanti Endpoint Manager Mobile Authentication Bypass", "desc": "Ivanti Endpoint Manager Mobile (EPMM, formerly MobileIron Core) contains an authentication bypass vulnerability that allows unauthenticated access to specific API paths and a path traversal vulnerability. An attacker with access to these API paths can access personally identifiable information (PII) such as names, phone numbers, and other mobile device details for users on a vulnerable system, as well as install software and modify security profiles on registered devices.", "link": "https://www.fortiguard.com/outbreak-alert/ivanti-epmm-authentication-bypass"}, {"source": "FortiGuard Labs Fortinet", "title": "Zyxel Router Command Injection Attack", "desc": "Actively targeted end-of-life router in the wild. A command injection vulnerability (Zyxel P660HN-T1A v1) in the Remote System Log forwarder function of firmware version 3.40 (ULM.0) b3 could allow a remote unauthenticated attacker to execute some OS commands by sending a crafted HTTP request.", "link": "https://www.fortiguard.com/outbreak-alert/zyxel-router-command-injection"}, {"source": "FortiGuard Labs Fortinet", "title": "WooCommerce Payments Improper Authentication Vulnerability", "desc": "WooCommerce (version 4.8.0 through 5.6.1), a popular e-commerce payment plugin for WordPress sites designed for small to large-sized online merchants, has been affected by an authentication bypass vulnerability. Successful exploitation of the vulnerability could allow an unauthorized attacker to gain admin privileges on the WordPress websites potentially leading to the site takeover, impersonate arbitrary users, including an administrator.", "link": "https://www.fortiguard.com/outbreak-alert/woocommerce-payments-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "Microsoft Office and Windows HTML RCE Vulnerability", "desc": "Microsoft has identified a phishing campaign conducted by the threat actor tracked as Storm-0978 targeting defense and government entities in Europe and North America. The campaign involved the abuse of CVE-2023-36884, a remote code execution vulnerability exploited via specially crafted Microsoft Office documents spread using phishing techniques.", "link": "https://www.fortiguard.com/outbreak-alert/microsoft-office-and-windows-html-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "SolarView Compact Command Injection Vulnerability", "desc": "FortiGuard Labs observed a huge spike in attack attempts relating to a command injection vulnerability in SolarView Compact (Solar power generation monitoring system) with upto more than 18,000+ unique IPS detections in the month of July 2023. The exploit works due to the vulnerability in SolarView Compact confi_mail.php component, which fails to adequately sanitize the user-supplied input data, leading to command injection.", "link": "https://www.fortiguard.com/outbreak-alert/solarview-compact-command-injection"}, {"source": "FortiGuard Labs Fortinet", "title": "Apache RocketMQ Remote Command Execution Vulnerability", "desc": "RocketMQ versions 5.1.0 and below are vulnerable to Arbitrary Code Injection. Broker component of RocketMQ is leaked on the extranet and lack permission verification. An attacker can exploit this vulnerability by using the update configuration function to execute commands or by forging the RocketMQ protocol content. CVE-2023-33246 is reportedly being exploited in the wild. Additionally, proof-of-concept (PoC) code is publicly available.", "link": "https://www.fortiguard.com/outbreak-alert/apache-rocketmq-rce"}, {"source": "FortiGuard Labs Fortinet", "title": "VMware Aria Operations for Networks Command Injection Vulnerability", "desc": "VMware Aria Operations for Networks (formerly vRealize Network Insight) contains a command injection vulnerability that allows a malicious actor with network access to perform an attack resulting in remote code execution. According to the vendor advisory, the vulnerability has been seen exploited in the wild.", "link": "https://www.fortiguard.com/outbreak-alert/vmware-aria-command-injection"}, {"source": "FortiGuard Labs Fortinet", "title": "TP-Link Archer AX-21 Command Injection Vulnerability", "desc": "TP-Link Archer AX21 (AX1800) firmware versions before 1.1.4 contains a command injection vulnerability in the web management interface specifically in the \"Country\" field. There is no sanitization of this field, so an attacker can exploit it for malicious activities and gain foothold. The vulnerability has been seen to be exploited in the wild to deploy Mirai botnet.", "link": "https://www.fortiguard.com/outbreak-alert/tp-link-archer-ax-21-command-injection"}, {"source": "FortiGuard Labs Fortinet", "title": "MOVEit Transfer Vulnerability", "desc": "MOVEit transfer provides secured transfer between enterprises by encrypting files at rest and during transfer, also providing management tools and visibility for monitoring the data flow. This attack can lead an unauthorized user to gain unauthorized access to MOVEit Transfer's database.", "link": "https://www.fortiguard.com/outbreak-alert/progress-moveit-transfer-sql-injection"}, {"source": "FortiGuard Labs Fortinet", "title": "Router Malware Attack", "desc": "Various older router vulnerabilities are still being exploited in the wild to distribute malware such as MooBot Malware, Lucifer Malware, BotenaGo Botnet, Zerobot Malware, Enemybot Malware.", "link": "https://www.fortiguard.com/outbreak-alert/router-malware-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "Zyxel Multiple Firewall Vulnerabilities", "desc": "Zyxel devices have been affected by multiple critical vulnerabilities. The attacker has been seen deploying Mirai like botnet inducing denial of service conditions. One of the vulnerabilities allows unauthenticated attackers to execute OS commands remotely and has a publicly available PoC.", "link": "https://www.fortiguard.com/outbreak-alert/zyxel-multiple-firewall-vulnerabilities"}, {"source": "FortiGuard Labs Fortinet", "title": "CosmicEnergy Malware", "desc": "Designed to disrupt electric power systems, this malware is capable of interacting with the devices responsible for managing power grids leading to potential power outages. Europe, Middle East, and Asia potentially affected.", "link": "https://www.fortiguard.com/outbreak-alert/cosmicenergy-malware"}, {"source": "FortiGuard Labs Fortinet", "title": "Active Exploitation of Multiple Vendor Camera System Attack", "desc": "Successful attacks can result in system compromise, arbitrary system commands execution or file disclosure, and bypass authentication to obtain administrative access.", "link": "https://www.fortiguard.com/outbreak-alert/multiple-vendor-camera-system-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "Oracle WebLogic Server Vulnerability", "desc": "Successful attacks of this vulnerability can result in unauthorized access to critical data on the Oracle WebLogic Server and the confidentiality impact of the vulnerability is rated as \"High\".", "link": "https://fortiguard.fortinet.com/outbreak-alert/oracle-weblogic-server-vulnerability"}, {"source": "FortiGuard Labs Fortinet", "title": "DVR Authentication Bypass Vulnerability", "desc": "This indicates that attackers tried to exploit the vulnerability potentially resulting in attackers gaining unauthorized access to vulnerable DVR devices.", "link": "https://fortiguard.fortinet.com/outbreak-alert/tbk-dvr-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "ThinkPHP Remote Code Execution Vulnerability", "desc": "A remote code execution vulnerability exists within multiple subsystems of ThinkPHP 5.0.x and 5.1.x. The FortiGuard Labs continue seeing high exploitation attempts of these old vulnerabilities of more than 50,000 IPS device detections per day. There are multiple actors abusing this flaw to...", "link": "https://fortiguard.fortinet.com/outbreak-alert/thinkphp-rce"}, {"source": "FortiGuard Labs Fortinet", "title": "PaperCut MF/NG Improper Access Control Vulnerability", "desc": "An unauthenticated attacker can perform a Remote Code Execution (RCE) on a vulnerable PaperCut Application Server. According to the vendor, the specific flaw exists within the SetupCompleted class and could be achieved remotely without authentication. PaperCut MF/NG Improper Access Control...", "link": "https://www.fortiguard.com/outbreak-alert/papercut-rce"}, {"source": "FortiGuard Labs Fortinet", "title": "Zoho ManageEngine RCE Vulnerability", "desc": "Multiple Zoho ManageEngine on-premise products, such as ServiceDesk Plus, Password Manager Pro and ADSelfService Plus, allow remote code execution due to the usage of an outdated third party dependency, Apache Santuario. Successful exploitation could lead to remote code execution and evidence of...", "link": "https://www.fortiguard.com/outbreak-alert/zoho-manageengine-rce"}, {"source": "FortiGuard Labs Fortinet", "title": "IBM Aspera Faspex Code Execution Vulnerability", "desc": "IBM Aspera Faspex could allow a remote attacker to execute code on the system, caused by a YAML deserialization flaw. By sending a specially crafted obsolete API call, an attacker could exploit this vulnerability to execute arbitrary code on the system.", "link": "https://www.fortiguard.com/outbreak-alert/ibm-aspera-faspex-code-execution"}, {"source": "FortiGuard Labs Fortinet", "title": "VM2 Sandbox Escape Vulnerability", "desc": "vm2 is a sandbox solution that can run untrusted code with whitelisted Node's built-in modules. Exploiting the flaws, threat actors can bypass the sandbox protections to gain remote code execution rights on the host running the sandbox.", "link": "https://fortiguard.fortinet.com/outbreak-alert/vm2-sandbox-escape"}, {"source": "FortiGuard Labs Fortinet", "title": "3CX Supply Chain Attack", "desc": "Digitally signed 3CX desktop app is used in a supply chain attack against 3CX VOIP customers. A previously unknown infostealer was deployed to the victims at the end of the infection chain. At this time, Windows and MacOS versions were reportedly trojanized.", "link": "https://fortiguard.fortinet.com/outbreak-alert/3cx-supply-chain-attack"}, {"source": "FortiGuard Labs Fortinet", "title": "Microsoft Exchange 0-day", "desc": "Two critical zero-day vulnerabilities (CVE-2022-41082 and CVE-2022-41040) that can allow the attacker to do a Remote Code Execution (RCE) on Microsoft Exchange Servers.", "link": "https://fortiguard.fortinet.com/outbreak-alert/msexchange-autodiscover-rce"}, {"source": "FortiGuard Labs Fortinet", "title": "Confluence Vulnerability", "desc": "A critical 0-day vulnerability on Atlassian Confluence Data Center and Server is actively being exploited in the wild. The vulnerability is established via the Object Graph Navigation Language (OGNL) injection that allows an unauthenticated user to execute arbitrary code.", "link": "https://fortiguard.fortinet.com/outbreak-alert/confluence-ognl"}, {"source": "FortiGuard Labs Fortinet", "title": "Follina: MSDT 0-day", "desc": "This vulnerability (CVE-2022-30190) is a 0-day vulnerability in Microsoft Support Diagnostic Tool that allows remote code execution and is being exploited in the wild. More attacks are expected as Proof-of-Concept code is available and a patch has not yet been released.", "link": "https://fortiguard.fortinet.com/outbreak-alert/msdt-follina"}, {"source": "FortiGuard Labs Fortinet", "title": "Log4j", "desc": "A zero-day vulnerability was discovered in Log4j, a Java-based logging utility that is part of Apache Logging Services Project. Deployed on millions of servers, this vulnerability can be exploited to allow for remote code execution and total system control on vulnerable systems.", "link": "https://www.fortiguard.com/outbreak-alert/log4j2-vulnerability"}, {"source": "FortiGuard Labs Fortinet", "title": "Kaseya VSA", "desc": "A sophisticated supply-chain ransomware attack that leveraged a vulnerability in the Kaseya VSA software to infect multiple managed service providers (MSPs) and their customers. We provide Outbreak Alert analyses for both the initial exploitation and the subsequent ransomware attack.", "link": "https://fndn.fortinet.net/FortiGuard-Alert-Outbreaks/Kaseya.html"}, {"source": "FortiGuard Labs Fortinet", "title": "Microsoft Print Spooler", "desc": "A potentially new zero-day Microsoft vulnerability, dubbed \"PrintNightmare,\" makes it possible for any authenticated attacker to remotely execute code with SYSTEM privileges on any machine that has the Windows Print Spooler service enabled (which is the default setting).", "link": "https://fndn.fortinet.net/FortiGuard-Alert-Outbreaks/Windows_PrintNightmare.html"}, {"source": "FortiGuard Labs Fortinet", "title": "Colonial Pipeline", "desc": "Operation Technology (OT) Attack. These actions temporarily halted all pipeline operations and affected some of their IT systems, causing gas shortages and taking weeks to recover.", "link": "https://fndn.fortinet.net/FortiGuard-Alert-Outbreaks/DarkSide-Ransomware/"}, {"source": "FortiGuard Labs Fortinet", "title": "F5 Big IP", "desc": "F5 reported several new vulnerabilities under attack that could lead to complete system compromise.  F5 urged immediate upgrades.", "link": "https://fndn.fortinet.net/FortiGuard-Alert-Outbreaks/Big-IP&Big-IQ/"}, {"source": "FortiGuard Labs Fortinet", "title": "Microsoft Exchange", "desc": "The original Zero-Day vulnerabilities were exploited and used by the HAFNIUM group for the global Ransomware campaign", "link": "https://author.fortinet.com/content/fortinet-com/en_us/fortiguard/outbreak-alert/microsoft-exchange-vulnerabilities.html"}, {"source": "FortiGuard Labs Fortinet", "title": "SolarWinds", "desc": "A complex & targeted supply chain cyber attack, with the primary goal of inserting a malicious backdoor into trusted (signed) software, which could later be exploited in end-customer updates of the SolarWinds Orion platform.", "link": "https://fndn.fortinet.net/FortiGuard-Alert-Outbreaks/SolarWinds-full/"}, {"source": "RecordedFuture", "title": "Subsea cable and pipeline in Baltic Sea damaged in possible act of sabotage", "link": "https://therecord.media/undersea-cable-pipeline-damage-finland-estonia", "desc": "A subsea telecommunications cable and gas pipeline running adjacently between Finland and Estonia were damaged in what may have been a deliberate act, the Finnish government said on Tuesday. An investigation into the damage began on Sunday, according to a statement from the office of Sauli Niinistö, the president of Finland, which suspected the damage..."}, {"source": "RecordedFuture", "title": "New technique leads to largest DDoS attacks ever, Google and Amazon say", "link": "https://therecord.media/largest-ddos-incidents-amazon-cloudflare-google", "desc": "Amazon, Google and Cloudflare said they detected the largest distributed denial-of-service (DDoS) attacks on record in August due to a newly discovered vulnerability. The companies explained on Tuesday morning that a bug tracked as CVE-2023-44487 allowed threat actors a fresh angle for overwhelming websites with a flood of traffic, making them temporarily unavailable to users...."}, {"source": "RecordedFuture", "title": "UK opposition leader targeted by AI-generated fake audio smear", "link": "https://therecord.media/keir-starmer-labour-party-leader-audio-smear-social-media-deepfake", "desc": "An audio clip posted to social media on Sunday, purporting to show Britain’s opposition leader Keir Starmer verbally abusing his staff, has been debunked as being AI-generated by private-sector and British government analysis. The audio of Keir Starmer was posted on X (formerly Twitter) by a pseudonymous account on Sunday morning, the opening day of..."}, {"source": "RecordedFuture", "title": "Maintainers warn of vulnerability affecting foundational open-source tool", "link": "https://therecord.media/curl-vulnerabilities-to-be-announced-open-source", "desc": "The maintainers of a popular open source tool that serves as a foundational support for many network protocols like SSL, TLS, HTTP, FTP, SMTP are warning of two vulnerabilities that will be announced this coming week. The issues center on curl, an open-source command-line tool that researchers said is used widely by developers and system..."}, {"source": "RecordedFuture", "title": "Victims reported $2.7 billion in social media scam losses since 2021: FTC", "link": "https://therecord.media/victims-report-billions-in-losses-from-social-media-scams-ftc", "desc": "Social media scams have cost victims who reported losses to the Federal Trade Commission $2.7 billion since 2021 — likely a “small fraction” of the total money stolen via platforms like Facebook and Instagram. According to the FTC, one in four people who reported losses to the agency’s Consumer Sentinel Network since 2021 said the..."}, {"source": "RecordedFuture", "title": "Air Europa customers urged to cancel cards following hack on payment system", "link": "https://therecord.media/air-europa-cyberattack-payment-cards", "desc": "Customers of Spanish airline Air Europa were on Tuesday advised by the company to cancel their credit cards following a cyberattack affecting its online payment system. The company, based on the island of Mallorca, did not announce how many customers were affected nor when the attack took place. In a statement reported by Reuters, the..."}, {"source": "RecordedFuture", "title": "Maintainers warn of vulnerability affecting foundational open-source tool", "link": "https://therecord.media/curl-vulnerabilities-to-be-announced-open-source", "desc": "The maintainers of a popular open source tool that serves as a foundational support for many network protocols like SSL, TLS, HTTP, FTP, SMTP are warning of two vulnerabilities that will be announced this coming week. The issues center on curl, an open-source command-line tool that researchers said is used widely by developers and system..."}, {"source": "RecordedFuture", "title": "Rhysida ransomware gang claims attacks on governments in Portugal, Dominican Republic", "link": "https://therecord.media/rhysida-ransomware-gang-attacks-on-portugal-dominican-republic-governments", "desc": "A notorious ransomware gang has claimed attacks against two government institutions this week, both of which confirmed they faced a range of issues due to the incidents. The city of Gondomar – a suburb about 20 minutes away from the Portuguese city of Porto – <a href=\"https://www.facebook.com/CamaraMunicipalGondomar/posts/719474046887589?__cft__%5B0%5D=AZU9TZcQmfautRwtoWk15JGIbmcr7Zg4VcYADGyFp7b0veKDG-jhurF0C-yjA_0MYaBF1qX6gdPpOkucNgwV8wWCfjSz6Xnyw3UM3YDkIuCmuYYSSaom_LU7COK_SV1UCvDW4o3GQVJBMpK9ozuim9nfkVxnwuidn4JEgbCcOMAOis1pOzOV65LDMLraxb9NplU&amp;__tn__=%2CO%2CP-R\">said on September 27 that it was the target of..."}, {"source": "RecordedFuture", "title": "23andMe scraping incident leaked data on 1.3 million users of Ashkenazi and Chinese descent", "link": "https://therecord.media/scraping-incident-genetic-testing-site", "desc": "Genetic testing giant 23andMe confirmed that a data scraping incident resulted in hackers gaining access to sensitive user information and selling it on the dark web. The information of nearly 7 million 23andMe users was offered for sale on a cybercriminal forum this week. The information included origin estimation, phenotype, health information, photos, identification data..."}, {"source": "RecordedFuture", "title": "MGM Resorts says cyberattack cost $100 million, resulted in theft of customer info", "link": "https://therecord.media/mgm-resorts-cyberattack-cost-millions", "desc": "A recent cyberattack cost MGM Resorts about $100 million, the Las Vegas company said in a regulatory filing on Thursday. In its <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/789570/000119312523251667/d461062d8k.htm\">filings with the Securities and Exchange Commission (SEC), the company also acknowledged that customer information ranging from Social Security numbers to passport data was stolen during the attack. The company did not respond..."}, {"source": "RecordedFuture", "title": "Ukraine, Israel, South Korea top list of most-targeted countries for cyberattacks", "link": "https://therecord.media/microsoft-2023-report-countries-most-targeted-cyberattacks", "desc": "More than 120 countries faced cyberattacks over the last year, with Ukraine, Israel, South Korea and Taiwan topping the list of the most targeted countries, according to a new report from Microsoft. The findings are part of Microsoft’s Digital Defense Report 2023 — which used troves of the company’s data to track cybersecurity trends between..."}, {"source": "RecordedFuture", "title": "China-based spies are hacking East Asian semiconductor companies, report says", "link": "https://therecord.media/china-budworm-apt27-east-asia-semiconductor-companies", "desc": "Chinese state-backed hackers have targeted the semiconductor industry in East Asia with a new espionage campaign, according to new research. The Dutch cybersecurity firm EclecticIQ attributed the campaign to China because the hackers used the HyperBro loader, which is associated with a state-backed group labeled Budworm or APT27 by researchers. Budworm has been associated with..."}, {"source": "RecordedFuture", "title": "Belgian intelligence fears Chinese tech giant Alibaba may be spying on logistics", "link": "https://therecord.media/alibaba-china-alleged-spying-belgium-airport-logistics", "desc": "Belgian intelligence is reportedly monitoring operations at a logistics hub run by Chinese tech giant Alibaba, based on concerns the company could be using software to collect sensitive economic data. The country’s State Security Service (VSSE) said it was attempting to “detect and fight against possible espionage and/or interference activities carried out by Chinese entities..."}, {"source": "RecordedFuture", "title": "FBI warns energy sector of likely increase in targeting by Chinese, Russian hackers", "link": "https://therecord.media/fbi-warning-energy-sector-increased-hacking-china-russia", "desc": "Global energy supply changes will likely increase Chinese and Russian hackers’ targeting of critical energy infrastructure, according to an FBI notification sent to the energy industry and obtained by Recorded Future News. The alert, issued Thursday, cites factors such as increased U.S. exports of liquefied natural gas (LNG); changes in the global crude oil supply..."}, {"source": "RecordedFuture", "title": "US, Japan say ‘BlackTech’ Chinese gov’t hackers exploiting routers during attacks", "link": "https://therecord.media/us-japan-say-chinese-hackers-routers", "desc": "A sophisticated hacking group tied to the government of China is exploiting routers in attacks on a variety of organizations, cybersecurity agencies in the United States and Japan warned Wednesday. The activity was attributed to a group called BlackTech, which has been launching attacks since 2010, according to the FBI, National Security Agency (NSA), the..."}]