[{"source": "RecordedFuture", "title": "Subsea cable and pipeline in Baltic Sea damaged in possible act of sabotage", "link": "https://therecord.media/undersea-cable-pipeline-damage-finland-estonia", "desc": "A subsea telecommunications cable and gas pipeline running adjacently between Finland and Estonia were damaged in what may have been a deliberate act, the Finnish government said on Tuesday. An investigation into the damage began on Sunday, according to a statement from the office of Sauli Niinistö, the president of Finland, which suspected the damage..."}, {"source": "RecordedFuture", "title": "New technique leads to largest DDoS attacks ever, Google and Amazon say", "link": "https://therecord.media/largest-ddos-incidents-amazon-cloudflare-google", "desc": "Amazon, Google and Cloudflare said they detected the largest distributed denial-of-service (DDoS) attacks on record in August due to a newly discovered vulnerability. The companies explained on Tuesday morning that a bug tracked as CVE-2023-44487 allowed threat actors a fresh angle for overwhelming websites with a flood of traffic, making them temporarily unavailable to users...."}, {"source": "RecordedFuture", "title": "UK opposition leader targeted by AI-generated fake audio smear", "link": "https://therecord.media/keir-starmer-labour-party-leader-audio-smear-social-media-deepfake", "desc": "An audio clip posted to social media on Sunday, purporting to show Britain’s opposition leader Keir Starmer verbally abusing his staff, has been debunked as being AI-generated by private-sector and British government analysis. The audio of Keir Starmer was posted on X (formerly Twitter) by a pseudonymous account on Sunday morning, the opening day of..."}, {"source": "RecordedFuture", "title": "Maintainers warn of vulnerability affecting foundational open-source tool", "link": "https://therecord.media/curl-vulnerabilities-to-be-announced-open-source", "desc": "The maintainers of a popular open source tool that serves as a foundational support for many network protocols like SSL, TLS, HTTP, FTP, SMTP are warning of two vulnerabilities that will be announced this coming week. The issues center on curl, an open-source command-line tool that researchers said is used widely by developers and system..."}, {"source": "RecordedFuture", "title": "Victims reported $2.7 billion in social media scam losses since 2021: FTC", "link": "https://therecord.media/victims-report-billions-in-losses-from-social-media-scams-ftc", "desc": "Social media scams have cost victims who reported losses to the Federal Trade Commission $2.7 billion since 2021 — likely a “small fraction” of the total money stolen via platforms like Facebook and Instagram. According to the FTC, one in four people who reported losses to the agency’s Consumer Sentinel Network since 2021 said the..."}, {"source": "RecordedFuture", "title": "Air Europa customers urged to cancel cards following hack on payment system", "link": "https://therecord.media/air-europa-cyberattack-payment-cards", "desc": "Customers of Spanish airline Air Europa were on Tuesday advised by the company to cancel their credit cards following a cyberattack affecting its online payment system. The company, based on the island of Mallorca, did not announce how many customers were affected nor when the attack took place. In a statement reported by Reuters, the..."}, {"source": "RecordedFuture", "title": "Maintainers warn of vulnerability affecting foundational open-source tool", "link": "https://therecord.media/curl-vulnerabilities-to-be-announced-open-source", "desc": "The maintainers of a popular open source tool that serves as a foundational support for many network protocols like SSL, TLS, HTTP, FTP, SMTP are warning of two vulnerabilities that will be announced this coming week. The issues center on curl, an open-source command-line tool that researchers said is used widely by developers and system..."}, {"source": "RecordedFuture", "title": "Rhysida ransomware gang claims attacks on governments in Portugal, Dominican Republic", "link": "https://therecord.media/rhysida-ransomware-gang-attacks-on-portugal-dominican-republic-governments", "desc": "A notorious ransomware gang has claimed attacks against two government institutions this week, both of which confirmed they faced a range of issues due to the incidents. The city of Gondomar – a suburb about 20 minutes away from the Portuguese city of Porto – <a href=\"https://www.facebook.com/CamaraMunicipalGondomar/posts/719474046887589?__cft__%5B0%5D=AZU9TZcQmfautRwtoWk15JGIbmcr7Zg4VcYADGyFp7b0veKDG-jhurF0C-yjA_0MYaBF1qX6gdPpOkucNgwV8wWCfjSz6Xnyw3UM3YDkIuCmuYYSSaom_LU7COK_SV1UCvDW4o3GQVJBMpK9ozuim9nfkVxnwuidn4JEgbCcOMAOis1pOzOV65LDMLraxb9NplU&amp;__tn__=%2CO%2CP-R\">said on September 27 that it was the target of..."}, {"source": "RecordedFuture", "title": "23andMe scraping incident leaked data on 1.3 million users of Ashkenazi and Chinese descent", "link": "https://therecord.media/scraping-incident-genetic-testing-site", "desc": "Genetic testing giant 23andMe confirmed that a data scraping incident resulted in hackers gaining access to sensitive user information and selling it on the dark web. The information of nearly 7 million 23andMe users was offered for sale on a cybercriminal forum this week. The information included origin estimation, phenotype, health information, photos, identification data..."}, {"source": "RecordedFuture", "title": "MGM Resorts says cyberattack cost $100 million, resulted in theft of customer info", "link": "https://therecord.media/mgm-resorts-cyberattack-cost-millions", "desc": "A recent cyberattack cost MGM Resorts about $100 million, the Las Vegas company said in a regulatory filing on Thursday. In its <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/789570/000119312523251667/d461062d8k.htm\">filings with the Securities and Exchange Commission (SEC), the company also acknowledged that customer information ranging from Social Security numbers to passport data was stolen during the attack. The company did not respond..."}, {"source": "RecordedFuture", "title": "Ukraine, Israel, South Korea top list of most-targeted countries for cyberattacks", "link": "https://therecord.media/microsoft-2023-report-countries-most-targeted-cyberattacks", "desc": "More than 120 countries faced cyberattacks over the last year, with Ukraine, Israel, South Korea and Taiwan topping the list of the most targeted countries, according to a new report from Microsoft. The findings are part of Microsoft’s Digital Defense Report 2023 — which used troves of the company’s data to track cybersecurity trends between..."}, {"source": "RecordedFuture", "title": "China-based spies are hacking East Asian semiconductor companies, report says", "link": "https://therecord.media/china-budworm-apt27-east-asia-semiconductor-companies", "desc": "Chinese state-backed hackers have targeted the semiconductor industry in East Asia with a new espionage campaign, according to new research. The Dutch cybersecurity firm EclecticIQ attributed the campaign to China because the hackers used the HyperBro loader, which is associated with a state-backed group labeled Budworm or APT27 by researchers. Budworm has been associated with..."}, {"source": "RecordedFuture", "title": "Belgian intelligence fears Chinese tech giant Alibaba may be spying on logistics", "link": "https://therecord.media/alibaba-china-alleged-spying-belgium-airport-logistics", "desc": "Belgian intelligence is reportedly monitoring operations at a logistics hub run by Chinese tech giant Alibaba, based on concerns the company could be using software to collect sensitive economic data. The country’s State Security Service (VSSE) said it was attempting to “detect and fight against possible espionage and/or interference activities carried out by Chinese entities..."}, {"source": "RecordedFuture", "title": "FBI warns energy sector of likely increase in targeting by Chinese, Russian hackers", "link": "https://therecord.media/fbi-warning-energy-sector-increased-hacking-china-russia", "desc": "Global energy supply changes will likely increase Chinese and Russian hackers’ targeting of critical energy infrastructure, according to an FBI notification sent to the energy industry and obtained by Recorded Future News. The alert, issued Thursday, cites factors such as increased U.S. exports of liquefied natural gas (LNG); changes in the global crude oil supply..."}, {"source": "RecordedFuture", "title": "US, Japan say ‘BlackTech’ Chinese gov’t hackers exploiting routers during attacks", "link": "https://therecord.media/us-japan-say-chinese-hackers-routers", "desc": "A sophisticated hacking group tied to the government of China is exploiting routers in attacks on a variety of organizations, cybersecurity agencies in the United States and Japan warned Wednesday. The activity was attributed to a group called BlackTech, which has been launching attacks since 2010, according to the FBI, National Security Agency (NSA), the..."}]