[{"source": "RecordedFuture", "title": "Tech industry leaders and White House clash over plan for improved cloud security", "link": "https://therecord.media/cloud-security-know-your-customer-white-house-industry-clash", "desc": "The Biden administration is moving forward with a plan to enhance cloud infrastructure security by requiring companies to collect personal information from users, despite intensifying backlash from executives at Amazon and other tech giants. The White House says the proposed cloud security policy — dubbed Know Your Customer (KYC) — is crucial for disrupting hackers..."}, {"source": "RecordedFuture", "title": "NSA is creating a hub for AI security, Nakasone says", "link": "https://therecord.media/national-security-agency-ai-hub", "desc": "The National Security Agency is consolidating its various artificial intelligence efforts into a new hub, its director announced Thursday. The Artificial Intelligence Security Center will become the spy agency’s “focal point” for AI activities such as “leveraging foreign intelligence insights,” helping to develop best practices guidelines for the fast-developing technology and creating “risk frameworks..."}, {"source": "RecordedFuture", "title": "Vulnerability in popular ‘libwebp’ code more widespread than expected", "link": "https://therecord.media/libwebp-vulnerability-more-widespread-than-expected", "desc": "Cybersecurity experts are warning that the scope of a previously disclosed vulnerability affecting a variety of web applications is wider than what was originally announced. The vulnerability — first tracked as CVE-2023-4863 — was disclosed by Google last week as a vulnerability affecting its Chrome browser. Other browsers began to release notices about the issue..."}, {"source": "RecordedFuture", "title": "Hong Kong crypto business Mixin says hackers stole $200 million in assets", "link": "https://therecord.media/mixin-cryptocurrency-business-hack-hong-kong", "desc": "A cryptocurrency business based in Hong Kong announced on Monday that hackers had stolen around $200 million of its assets after attacking its cloud service provider. Mixin, which describes itself as building “open source software that always puts security, privacy and decentralization first” announced the incident in a social media post. The company said that..."}, {"source": "RecordedFuture", "title": "Court ruling on California’s online child safety law could put similar bills on hold", "link": "https://therecord.media/court-ruling-on-california-kids-online-safety-law-has-broader-implications", "desc": "The decision by a federal judge on Monday to strike down a California law designed to reduce children’s exposure to harmful content online could have far-reaching implications, according to privacy and technology experts, setting up debate over how to define harm and determining at what point it overrides the First Amendment. The ruling on the..."}, {"source": "RecordedFuture", "title": "Suspected China-based hackers target Middle Eastern telecom, Asian government", "link": "https://therecord.media/suspected-chinese-hackers-target-telecom-asia-government", "desc": "Hackers targeted a Middle Eastern telecom organization and an Asian government in a recent spying operation, according to a report published Thursday. The hacking group Budworm, also known as Emissary Panda and APT27, is believed to be based in China. Last year, it attacked a U.S. state legislature using a Log4j vulnerability. In its most..."}, {"source": "RecordedFuture", "title": "Russian flight booking system suffers ‘massive’ cyberattack", "link": "https://therecord.media/russia-flight-booking-system-leonardo-ddos", "desc": "A Russian flight booking system was hit by a cyberattack on Thursday, causing delays at airports. A &quot;massive&quot; distributed denial-of-service (DDoS) attack on the local airline booking system Leonardo was carried out by &quot;foreign hackers,&quot; reported one of the system’s developers, Russian state defense company Rostec. The incident lasted about an hour and affected the..."}, {"source": "RecordedFuture", "title": "Dallas: Royal ransomware gang infiltrated networks weeks before striking", "link": "https://therecord.media/dallas-ransomware-gang-report", "desc": "Hackers began surveillance of the city of Dallas’ networks weeks before carrying out a devastating ransomware attack in May, according to a recent report on the incident. The 31-page After-Action Report, published last week, outlines what happened before, during and after the ransomware attack crippled critical systems used by the city’s police, firefighters, hospitals and..."}, {"source": "RecordedFuture", "title": "DHS to host Latin American cyber summit as region faces an onslaught of digital attacks", "link": "https://therecord.media/dhs-to-host-latin-american-cyber-summit", "desc": "The U.S.Homeland Security Department this week will convene the first-of-its-kind cybersecurity summit with leaders from Latin America, which has increasingly become a hotbed for criminal digital activity and influence efforts by China. The two-day “Western Hemisphere Cyber Conference,” which will be attended by nearly two dozen nations and kicks off Wednesday, was inspired by a..."}, {"source": "RecordedFuture", "title": "Philippines state health org struggling to recover from ransomware attack", "link": "https://therecord.media/philippines-state-health-insurer-struggles-with-ransomware", "desc": "The government organization that manages the universal healthcare system of the Philippines has struggled to recover from a ransomware incident that forced it to take several websites and portals offline. On Friday morning, officials from the Philippine Health Insurance Corporation (PhilHealth) said they discovered an information security incident and immediately began an investigation into the..."}, {"source": "RecordedFuture", "title": "US, Japan say ‘BlackTech’ Chinese gov’t hackers exploiting routers during attacks", "link": "https://therecord.media/us-japan-say-chinese-hackers-routers", "desc": "A sophisticated hacking group tied to the government of China is exploiting routers in attacks on a variety of organizations, cybersecurity agencies in the United States and Japan warned Wednesday. The activity was attributed to a group called BlackTech, which has been launching attacks since 2010, according to the FBI, National Security Agency (NSA), the..."}, {"source": "RecordedFuture", "title": "Putin and Prigozhin went through an ‘amazing transformation,’ says former Kremlin speechwriter", "link": "https://therecord.media/putin-speechwriter-interview-click-here", "desc": "<em>Abbas Gallyamov used to have a pretty spectacular job: He was Vladimir Putin's speechwriter.</em> _Putin was prime minister at the time, and Gallyamov worked for him on and off from 2000 to 2010. He said Putin was a pretty good boss. “Look, I understand it’s hard to believe it now, but actually he always..."}, {"source": "RecordedFuture", "title": "British Army general says UK now conducting ‘hunt forward’ operations", "link": "https://therecord.media/uk-hunt-forward-operations-lt-gen-tom-copinger-symes", "desc": "Lt. Gen. Tom Copinger-Symes is the deputy commander of the United Kingdom’s Strategic Command, responsible for the Ministry of Defence’s offensive and defensive cyber capabilities — as well as activities that lie somewhere in between. _He told Recorded Future News that Strategic Command was now opening up about its hunt forward operations — a type..."}, {"source": "RecordedFuture", "title": "Egyptian opposition politician hacked with Predator spyware, researchers confirm", "link": "https://therecord.media/egyptian-opposition-politican-ahmed-altantawy-spyware-predator", "desc": "The phone of Egyptian opposition politician Ahmed Eltantawy was recently targeted with Predator spyware, in a campaign that researchers at the digital forensics organization Citizen Lab believe was carried out with the knowledge of the Egyptian government. Along with Google’s Threat Analysis Group, the University of Toronto-affiliated Citizen Lab published the results of the investigation..."}, {"source": "RecordedFuture", "title": "Bermuda’s premier attributes system outages to ‘Russia-based’ attackers", "link": "https://therecord.media/bermuda-government-cyberattack-premier-attributes-russia", "desc": "The premier of Bermuda said the island and another Caribbean government are currently dealing with a cyberattack that prompted several announcements about damaged internet and phone infrastructure. During a <a href=\"https://www.youtube.com/watch?v=rPU9Nzj6tf4&amp;t=1175s\">press conference on Thursday, Bermuda Premier David Burt confirmed that a cyberattack from actors based in Russia was the cause of widespread internet outages affecting all..."}]