[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/update-chrome-now-google-releases-patch.html", "tags": "Zero Day / Vulnerability", "title": "Update Chrome Now: Google Releases Patch for Actively Exploited Zero-Day Vulnerability", "desc": "Google on Wednesday rolled out fixes to address a new actively exploited zero-day in the Chrome browser. Tracked as  CVE-2023-5217 , the high-severity vulnerability has been described as a  heap-based buffer overflow  in the VP8 compression format in  libvpx , a free software  video codec  library from Google and the Alliance for Open Media (AOMedia). Exploitation of such buffer overflow flaws can result in program crashes or execution of arbitrary code, impacting its availability and integrity. Clément Lecigne of Google's Threat Analysis Group (TAG) has been credited with discovering and reporting the flaw on September 25, 2023, with fellow researcher Maddie Stone  noting  on X (formerly Twitter) that it has been abused by a commercial spyware vendor to target high-risk individuals. No additional details have been disclosed by the tech giant other than to acknowledge that it's \"aware that an exploit for CVE-2023-5217 exists in the wild.\" The latest discovery b..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/critical-jetbrains-teamcity-flaw-could.html", "tags": "Vulnerability / Source Code", "title": "Critical JetBrains TeamCity Flaw Could Expose Source Code and Build Pipelines to Attackers", "desc": "A critical security vulnerability in the JetBrains TeamCity continuous integration and continuous deployment (CI/CD) software could be exploited by unauthenticated attackers to achieve remote code execution on affected systems. The flaw, tracked as  CVE-2023-42793 , carries a CVSS score of 9.8 and has been addressed in  TeamCity version 2023.05.4  following responsible disclosure on September 6, 2023. \"Attackers could leverage this access to steal source code, service secrets, and private keys, take control over attached build agents, and poison build artifacts,\" Sonar security researcher Stefan Schiller  said  in a report last week. Successful exploitation of the bug could also permit threat actors to access the build pipelines and inject arbitrary code, leading to an integrity breach and supply chain compromise. It's worth noting that the shortcoming only affects on-premise versions of the JetBrains software. The TeamCity Cloud version has already been updated wit..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/latest-apple-zero-days-used-to-hack.html", "tags": "Zero Day / Vulnerability ", "title": "New Apple Zero-Days Exploited to Target Egyptian ex-MP with Predator Spyware", "desc": "The  three zero-day flaws  addressed by Apple on September 21, 2023, were leveraged as part of an iPhone exploit chain in an attempt to deliver a spyware strain called  Predator  targeting former Egyptian member of parliament Ahmed Eltantawy between May and September 2023. \"The targeting took place after Eltantawy publicly  stated his plans  to run for President in the 2024 Egyptian elections,\" the Citizen Lab  said , attributing the attack with high confidence to the Egyptian government owing to it being a known customer of the commercial spying tool. According to a joint investigation conducted by the Canadian interdisciplinary laboratory and Google's Threat Analysis Group (TAG), the mercenary surveillance tool is said to have been delivered via links sent on SMS and WhatsApp. \"In August and September 2023, Eltantawy's Vodafone Egypt mobile connection was persistently selected for targeting via network injection; when Eltantawy visited certain websites not..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/high-severity-flaws-uncovered-in.html", "tags": "Server Security / Vulnerability", "title": "High-Severity Flaws Uncovered in Atlassian Products and ISC BIND Server", "desc": "Atlassian and the Internet Systems Consortium (ISC) have disclosed several security flaws impacting their products that could be exploited to achieve denial-of-service (DoS) and remote code execution. The Australian software services provider  said  that the four high-severity flaws were fixed in new versions shipped last month. This includes - CVE-2022-25647  (CVSS score: 7.5) - A deserialization flaw in the Google Gson package impacting Patch Management in Jira Service Management Data Center and Server CVE-2023-22512  (CVSS score: 7.5) - A DoS flaw in Confluence Data Center and Server CVE-2023-22513  (CVSS score: 8.5) - A RCE flaw in Bitbucket Data Center and Server CVE-2023-28709  (CVSS score: 7.5) - A DoS flaw in Apache Tomcat server impacting Bamboo Data Center and Server The flaws have been addressed in the following versions - Jira Service Management Server and Data Center (versions 4.20.25, 5.4.9, 5.9.2, 5.10.1, 5.11.0, or later) Confluence Server and Data Center (v..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/apple-rushes-to-patch-3-new-zero-day.html", "tags": "Zero Day / Vulnerability ", "title": "Apple Rushes to Patch 3 New Zero-Day Flaws: iOS, macOS, Safari, and More Vulnerable", "desc": "Apple has released yet another round of security patches to address three actively exploited zero-day flaws impacting iOS, iPadOS, macOS, watchOS, and Safari, taking the total tally of zero-day bugs discovered in its software this year to 16. The list of security vulnerabilities is as follows - CVE-2023-41991  - A certificate validation issue in the Security framework that could allow a malicious app to bypass signature validation. CVE-2023-41992  - A security flaw in Kernel that could allow a local attacker to elevate their privileges. CVE-2023-41993  - A WebKit flaw that could result in arbitrary code execution when processing specially crafted web content. Apple did not provide additional specifics barring an acknowledgement that the \"issue may have been actively exploited against versions of iOS before iOS 16.7.\" The updates are available for the following devices and operating systems - iOS 16.7 and iPadOS 16.7  - iPhone 8 and later, iPad Pro (all models), iP..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/beware-fake-exploit-for-winrar.html", "tags": "Vulnerability / Exploit", "title": "Beware: Fake Exploit for WinRAR Vulnerability on GitHub Infects Users with Venom RAT", "desc": "A malicious actor released a fake proof-of-concept (PoC) exploit for a recently disclosed WinRAR vulnerability on GitHub with an aim to infect users who downloaded the code with Venom RAT malware. \"The fake PoC meant to exploit this WinRAR vulnerability was based on a publicly available PoC script that exploited a SQL injection vulnerability in an application called GeoServer, which is tracked as  CVE-2023-25157 ,\" Palo Alto Networks Unit 42 researcher Robert Falcone  said . While  bogus PoCs  have become a  well-documented gambit  for targeting the  research community , the cybersecurity firm suspected that the threat actors are opportunistically targeting other crooks who may be adopting the latest vulnerabilities into their arsenal. whalersplonk, the  GitHub account  that hosted the repository, is no longer accessible. The PoC is said to have been committed on August 21, 2023, four days after the vulnerability was publicly announced. CVE-2023-40477 relates to an  imp..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/do-you-really-trust-your-web.html", "tags": "Web Application Security", "title": "Do You Really Trust Your Web Application Supply Chain?", "desc": "Well, you shouldn't. It may already be hiding vulnerabilities. It's the modular nature of modern web applications that has made them so effective. They can call on dozens of third-party web components, JS frameworks, and open-source tools to deliver all the different functionalities that keep their customers happy, but this chain of dependencies is also what makes them so vulnerable. Many of those components in the web application supply chain are controlled by a third party—the company that created them. This means that no matter how rigorous you were with your own static code analysis, code reviews, penetration testing, and other SSDLC processes, most of your supply chain's security is in the hands of whoever built its third-party components. With their huge potential for weak spots, and their widespread use in the lucrative ecommerce, financial and medical industries, web application supply chains present a juicy target for cyber attackers. They can target any one of the doz..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/gitlab-releases-urgent-security-patches.html", "tags": "Vulnerability / Software Security", "title": "GitLab Releases Urgent Security Patches for Critical Vulnerability", "desc": "GitLab has shipped security patches to resolve a critical flaw that allows an attacker to run pipelines as another user. The issue, tracked as  CVE-2023-5009  (CVSS score: 9.6), impacts all versions of GitLab Enterprise Edition (EE) starting from 13.12 and prior to 16.2.7 as well as from 16.3 and before 16.3.4. \"It was possible for an attacker to  run pipelines  as an arbitrary user via scheduled security scan policies,\" GitLab  said  in an advisory. \"This was a bypass of  CVE-2023-3932  showing additional impact.\" Successful exploitation of CVE-2023-5009 could allow a threat actor to access sensitive information or leverage the elevated permissions of the impersonated user to modify source code or run arbitrary code on the system, leading to severe consequences. Security researcher Johan Carlsson (aka joaxcar) has been credited with discovering and reporting the flaw. CVE-2023-3932 was addressed by GitLab in early August 2023. The new vulnerability has been r..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/trend-micro-releases-urgent-fix-for.html", "tags": "Zero Day / Vulnerability", "title": "Trend Micro Releases Urgent Fix for Actively Exploited Critical Security Vulnerability", "desc": "Cybersecurity company Trend Micro has  released  patches and hotfixes to address a critical security flaw in Apex One and Worry-Free Business Security solutions for Windows that has been actively exploited in real-world attacks. Tracked as  CVE-2023-41179  (CVSS score: 9.1), it relates to a third-party antivirus uninstaller module that's bundled along with the software. The complete list of impacted products is as follows - Apex One - version 2019 (on-premise), fixed in SP1 Patch 1 (B12380) Apex One as a Service - fixed in SP1 Patch 1 (B12380) and Agent version 14.0.12637 Worry-Free Business Security - version 10.0 SP1, fixed in 10.0 SP1 Patch 2495 Worry-Free Business Security Services - fixed in July 31, 2023, Monthly Maintenance Release Trend Micro said that a successful exploitation of the flaw could allow an attacker to manipulate the component to execute arbitrary commands on an affected installation. However, it requires that the adversary already has administrative..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/microsoft-uncovers-flaws-in-ncurses.html", "tags": "Endpoint Security / Vulnerability", "title": "Microsoft Uncovers Flaws in ncurses Library Affecting Linux and macOS Systems", "desc": "A set of memory corruption flaws have been discovered in the  ncurses  (short for  new curses ) programming library that could be exploited by threat actors to run malicious code on vulnerable Linux and macOS systems. \"Using environment variable poisoning, attackers could chain these vulnerabilities to elevate privileges and run code in the targeted program's context or perform other malicious actions,\" Microsoft Threat Intelligence researchers Jonathan Bar Or, Emanuele Cozzi, and Michael Pearse  said  in a technical report published today. The vulnerabilities, collectively tracked as  CVE-2023-29491  (CVSS score of 7.8), have been  addressed  as of April 2023. Microsoft said it also worked with Apple on remediating the macOS-specific issues related to these flaws. Environment variables are user-defined values that can be used by multiple programs on a system and can affect the manner in which they behave on the system. Manipulating the variables can cause applica..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/n-ables-take-control-agent.html", "tags": "Vulnerability / Hacking", "title": "N-Able's Take Control Agent Vulnerability Exposes Windows Systems to Privilege Escalation", "desc": "A high-severity security flaw has been disclosed in N-Able's Take Control Agent that could be exploited by a local unprivileged attacker to gain SYSTEM privileges. Tracked as  CVE-2023-27470  (CVSS score: 8.8), the  issue  relates to a Time-of-Check to Time-of-Use ( TOCTOU ) race condition vulnerability, which, when successfully exploited, could be leveraged to delete arbitrary files on a Windows system. The security shortcoming, which impacts versions 7.0.41.1141 and prior, has been addressed in version 7.0.43 released on March 15, 2023, following responsible disclosure by Mandiant on February 27, 2023. Time-of-Check to Time-of-Use falls under a category of software flaws wherein a program checks the state of a resource for a specific value, but that value changes before it's actually used, effectively invalidating the results of the check. An exploitation of such a flaw can result in a loss of integrity and trick the program into performing actions that it shouldn't..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/microsoft-releases-patch-for-two-new.html", "tags": "Endpoint Security / Zero Day", "title": "Microsoft Releases Patch for Two New Actively Exploited Zero-Days Flaws", "desc": "Microsoft has released software fixes to  remediate 59 bugs  spanning its product portfolio, including two zero-day flaws that have been actively exploited by malicious cyber actors. Of the 59 vulnerabilities, five are rated Critical, 55 are rated Important, and one is rated Moderate in severity. The update is in addition to  35 flaws  patched in the Chromium-based Edge browser since last month's Patch Tuesday edition, which also encompasses a fix for  CVE-2023-4863 , a critical heap buffer overflow flaw in the WebP image format. The two Microsoft vulnerabilities that have come under active exploitation in real-world attacks are listed below - CVE-2023-36761  (CVSS score: 6.2) - Microsoft Word Information Disclosure Vulnerability CVE-2023-36802  (CVSS score: 7.8) - Microsoft Streaming Service Proxy Elevation of Privilege Vulnerability \"Exploiting this vulnerability could allow the disclosure of  NTLM hashes ,\" the Windows maker said in an advisory about CVE-2023-3..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/update-adobe-acrobat-and-reader-to.html", "tags": "Vulnerability / Zero Day", "title": "Update Adobe Acrobat and Reader to Patch Actively Exploited Vulnerability", "desc": "Adobe's  Patch Tuesday update  for September 2023 comes with a patch for a critical actively exploited security flaw in Acrobat and Reader that could permit an attacker to execute malicious code on susceptible systems. The vulnerability, tracked as CVE-2023-26369, is rated 7.8 for severity on the CVSS scoring system and impacts both Windows and macOS versions of Acrobat DC, Acrobat Reader DC, Acrobat 2020, and Acrobat Reader 2020. Described as an out-of-bounds write, successful exploitation of the bug could lead to code execution by opening a specially crafted PDF document. Adobe did not disclose any additional details about the issue or the targeting involved. \"Adobe is aware that CVE-2023-26369 has been exploited in the wild in limited attacks targeting Adobe Acrobat and Reader,\" the company  acknowledged  in an advisory. CVE-2023-26369 affects the below versions - Acrobat DC (23.003.20284 and earlier versions) - Fixed in 23.006.20320 Acrobat Reader DC (23.003...."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/mozilla-rushes-to-patch-webp-critical.html", "tags": "Vulnerability / Browser Security", "title": "Mozilla Rushes to Patch WebP Critical Zero-Day Exploit in Firefox and Thunderbird", "desc": "Mozilla on Tuesday released security updates to resolve a critical zero-day vulnerability in Firefox and Thunderbird that has been actively exploited in the wild, a day after Google released a fix for the issue in its Chrome browser. The shortcoming, assigned the identifier  CVE-2023-4863 , is a heap buffer overflow flaw in the WebP image format that could result in arbitrary code execution when processing a specially crafted image. \"Opening a malicious WebP image could lead to a heap buffer overflow in the content process,\" Mozilla  said  in an advisory. \"We are aware of this issue being exploited in other products in the wild.\" According to the description on the National Vulnerability Database (NVD), the flaw could allow a remote attacker to perform an out-of-bounds memory write via a crafted HTML page. Apple Security Engineering and Architecture (SEAR) and the Citizen Lab at the University of Toronto's Munk School have been credited with reporting the s..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/critical-github-vulnerability-exposes.html", "tags": "Software Security / Vulnerability", "title": "Critical GitHub Vulnerability Exposes 4,000+ Repositories to Repojacking Attack", "desc": "A new vulnerability disclosed in GitHub could have exposed thousands of repositories at risk of repojacking attacks, new findings show. The flaw \"could allow an attacker to exploit a race condition within GitHub's repository creation and username renaming operations,\" Checkmarx security researcher Elad Rapoport  said  in a technical report shared with The Hacker News. \"Successful exploitation of this vulnerability impacts the open-source community by enabling the hijacking of over 4,000 code packages in languages such as Go, PHP, and Swift, as well as GitHub actions.\" Following responsible disclosure on March 1, 2023, the Microsoft-owned code hosting platform has addressed the issue as of September 1, 2023. Repojacking , short for  repository hijacking , is a technique where a threat actor is able to bypass a security mechanism called popular repository namespace retirement and ultimately control of a repository. What the protection measure does is preven..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/apple-rushes-to-patch-zero-day-flaws.html", "tags": "Spyware / Vulnerability", "title": "Apple Rushes to Patch Zero-Day Flaws Exploited for Pegasus Spyware on iPhones", "desc": "Apple on Thursday released emergency security updates for iOS, iPadOS, macOS, and watchOS to address two zero-day flaws that have been exploited in the wild to deliver NSO Group's Pegasus mercenary spyware. The issues are described as below - CVE-2023-41061  - A validation issue in Wallet that could result in arbitrary code execution when handling a maliciously crafted attachment. CVE-2023-41064  - A buffer overflow issue in the  Image I/O component  that could result in arbitrary code execution when processing a maliciously crafted image. While CVE-2023-41064 was found by the Citizen Lab at the University of Torontoʼs Munk School, CVE-2023-41061 was discovered internally by Apple, with \"assistance\" from the Citizen Lab. The updates are available for the following devices and operating systems - iOS 16.6.1 and iPadOS 16.6.1  - iPhone 8 and later, iPad Pro (all models), iPad Air 3rd generation and later, iPad 5th generation and later, and iPad mini 5th generati..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/cisco-issues-urgent-fix-for.html", "tags": "Vulnerability / Network Security", "title": "Cisco Issues Urgent Fix for Authentication Bypass Bug Affecting BroadWorks Platform", "desc": "Cisco has released security fixes to address multiple security flaws, including a critical bug, that could be exploited by a threat actor to take control of an affected system or cause a denial-of service (DoS) condition. The most severe of the issues is CVE-2023-20238, which has the maximum CVSS severity rating of 10.0. It's described as an authentication bypass flaw in the Cisco BroadWorks Application Delivery Platform and Cisco BroadWorks Xtended Services Platform. Successful exploitation of the vulnerability -- a weakness in the single sign-on (SSO) implementation and discovered during internal testing -- could allow an unauthenticated, remote attacker to forge the credentials required to access an affected system. \"This vulnerability is due to the method used to validate SSO tokens,\" Cisco  said . \"An attacker could exploit this vulnerability by authenticating to the application with forged credentials. A successful exploit could allow the attacker to commit toll fraud or to e..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/north-korean-hackers-exploit-zero-day.html", "tags": "Zero Day / Cyber Attack", "title": "North Korean Hackers Exploit Zero-Day Bug to Target Cybersecurity Researchers", "desc": "Threat actors associated with North Korea are  continuing  to  target  the cybersecurity community using a zero-day bug in an unspecified software over the past several weeks to infiltrate their machines. The findings come from Google's Threat Analysis Group (TAG), which found the adversary setting up fake accounts on social media platforms like  X  (formerly Twitter) and  Mastodon  to forge relationships with potential targets and build trust. \"In one case, they carried on a months-long conversation, attempting to collaborate with a security researcher on topics of mutual interest,\" security researchers Clement Lecigne and Maddie Stone  said . \"After initial contact via X, they moved to an encrypted messaging app such as Signal, WhatsApp, or Wire.\" The social engineering exercise ultimately paved the way for a malicious file containing at least one zero-day in a popular software package. The vulnerability is currently in the process of being fixed. The payload, for its part, perf..."}]