[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/http2-rapid-reset-zero-day.html", "tags": "Server Security / Vulnerability", "title": "HTTP/2 Rapid Reset Zero-Day Vulnerability Exploited to Launch Record DDoS Attacks", "desc": "Amazon Web Services (AWS), Cloudflare, and Google on Tuesday said they took steps to mitigate record-breaking distributed denial-of-service (DDoS) attacks that relied on a novel technique called HTTP/2 Rapid Reset. The  layer 7 attacks  were detected in late August 2023, the companies said in a coordinated disclosure. The cumulative susceptibility to this attack is being tracked as  CVE-2023-44487 , and carries a CVSS score of 7.5 out of a maximum of 10. While the attacks aimed at Google's cloud infrastructure peaked at  398 million requests per second  (RPS), the ones aimed at AWS and Cloudflare exceeded a volume of 155 million and 201 million requests per second (RPS), respectively. HTTP/2 Rapid Reset refers to a zero-day flaw in the HTTP/2 protocol that can be exploited to carry out DDoS attacks. A significant feature of HTTP/2 is multiplexing requests over a single TCP connection, which manifests in the form of concurrent streams. What's more, a client that wants to a..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/libcue-library-flaw-opens-gnome-linux.html", "tags": "Endpoint Security / Vulnerability", "title": "libcue Library Flaw Opens GNOME Linux Systems Vulnerable to RCE Attacks", "desc": "A new security flaw has been disclosed in the libcue library impacting GNOME Linux systems that could be exploited to achieve remote code execution (RCE) on affected hosts. Tracked as  CVE-2023-43641  (CVSS score: 8.8), the  issue  is described as a case of memory corruption in libcue, a library designed for parsing  cue sheet files . It impacts versions 2.2.1 and prior. libcue is incorporated into Tracker Miners , a search engine tool that's included by default in GNOME and indexes files in the system for easy access. The problem is rooted in an out-of-bounds array access in the track_set_index function that allows for achieving code execution on the machine simply by tricking a victim into clicking a malicious link and downloading a .cue file. \"A user of the GNOME desktop environment can be exploited by downloading a cue sheet from a malicious webpage,\" according to a  description  of the vulnerability in the National Vulnerability Database (NVD). \"Because t..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/high-severity-flaws-in-connectedios.html", "tags": "Vulnerability / IoT Security", "title": "High-Severity Flaws in ConnectedIO's 3G/4G Routers Raise Concerns for IoT Security", "desc": "Multiple high-severity security vulnerabilities have been disclosed in ConnectedIO's ER2000 edge routers and the cloud-based management platform that could be exploited by malicious actors to execute malicious code and access sensitive data. \"An attacker could have leveraged these flaws to fully compromise the cloud infrastructure, remotely execute code, and leak all customer and device information,\" Claroty's Noam Moshe  said  in an analysis published last week. Vulnerabilities in 3G/4G routers could expose thousands of internal networks to severe threats, enabling bad actors to seize control, intercept traffic, and even infiltrate Extended Internet of Things (XIoT) things. The shortcomings impacting the ConnectedIO platform versions v2.1.0 and prior, primarily the 4G ER2000 edge router and cloud services, could be chained, permitting attackers to execute arbitrary code on the cloud-based devices without requiring direct access to them. Flaws have also been unea..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/security-patch-for-two-new-flaws-in.html", "tags": "Software Security / Vulnerability", "title": "Security Patch for Two New Flaws in Curl Library Arriving on October 11", "desc": "The maintainers of the  Curl library  have released an advisory warning of two security vulnerabilities that are expected to be addressed as part of an forthcoming update set for release on October 11, 2023. This  includes  a high-severity and a low-severity flaw tracked under the identifiers CVE-2023-38545 and CVE-2023-38546, respectively. Additional details about the issues and the exact version ranges impacted have been withheld owing to the possibility that the information could be used to \"help identify the problem (area) with a very high accuracy.\" That said, the \"last several years\" of versions of the library are said to be affected.  \"Sure, there is a minuscule risk that someone can find this (again) before we ship the patch, but this issue has stayed undetected for years for a reason,\" Daniel Stenberg, the lead developer behind the project, said in a message posted on GitHub. Curl, powered by libcurl, is a  popular command-line tool  for tra..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/cisco-releases-urgent-patch-to-fix.html", "tags": "Network Security / Software Patch", "title": "Cisco Releases Urgent Patch to Fix Critical Flaw in Emergency Responder Systems", "desc": "Cisco has released updates to address a critical security flaw impacting Emergency Responder that allows unauthenticated, remote attackers to sign into susceptible systems using hard-coded credentials. The vulnerability, tracked as  CVE-2023-20101  (CVSS score: 9.8), is due to the presence of static user credentials for the root account that the company said is usually reserved for use during development. \"An attacker could exploit this vulnerability by using the account to log in to an affected system,\" Cisco  said  in an advisory. \"A successful exploit could allow the attacker to log in to the affected system and execute arbitrary commands as the root user.\" The issue impacts Cisco Emergency Responder Release 12.5(1)SU4 and has been addressed in version 12.5(1)SU5. Other releases of the product are not impacted. The networking equipment major said it discovered the problem during internal security testing and that it's not aware of any malicious use of the vulnerability in the..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/cisa-warns-of-active-exploitation-of.html", "tags": "Vulnerability / Cyber Attack", "title": "CISA Warns of Active Exploitation of JetBrains and Windows Vulnerabilities", "desc": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Wednesday  added  two security flaws to its Known Exploited Vulnerabilities ( KEV ) catalog due to active exploitation, while removing five bugs from the list due to lack of adequate evidence. The vulnerabilities newly added are below - CVE-2023-42793  (CVSS score: 9.8) - JetBrains TeamCity Authentication Bypass Vulnerability CVE-2023-28229  (CVSS score: 7.0) - Microsoft Windows CNG Key Isolation Service Privilege Escalation Vulnerability CVE-2023-42793 relates to a  critical authentication bypass vulnerability  that allows for remote code execution on TeamCity Server. Data gathered by GreyNoise has revealed exploitation attempts targeting the flaw from  74 unique IP addresses  to date. On the other hand, CVE-2023-28229 is a  high-severity flaw  in the Microsoft Windows Cryptographic Next Generation (CNG) Key Isolation Service that allows an attacker to gain specific limited SYSTEM privileges. There are curren..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/apple-rolls-out-security-patches-for.html", "tags": "Zero Day / Vulnerability", "title": "Apple Rolls Out Security Patches for Actively Exploited iOS Zero-Day Flaw", "desc": "Apple on Wednesday rolled out security patches to address a new zero-day flaw in iOS and iPadOS that it said has come under active exploitation in the wild. Tracked as  CVE-2023-42824 , the kernel vulnerability could be abused by a local attacker to elevate their privileges. The iPhone maker said it addressed the problem with improved checks. \"Apple is aware of a report that this issue may have been actively exploited against versions of iOS before iOS 16.6,\" the company  noted  in a terse advisory. While additional details about the nature of the attacks and the identity of the threat actors perpetrating them are currently unknown, successful exploitation likely hinges on an attacker already obtaining an initial foothold by some other means. Apple's latest update also resolves  CVE-2023-5217  impacting the WebRTC component, which Google last week described as a heap-based buffer overflow in the VP8 compression format in libvpx. The patches, iOS 17.0.3 and iPadOS 1..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/atlassian-confluence-hit-by-newly.html", "tags": "Zero Day / Vulnerability", "title": "Atlassian Confluence Hit by New Actively Exploited Zero-Day – Patch Now", "desc": "Atlassian has released fixes to contain an actively exploited critical zero-day flaw impacting publicly accessible Confluence Data Center and Server instances. The vulnerability, tracked as  CVE-2023-22515 , is remotely exploitable and allows external attackers to create unauthorized Confluence administrator accounts and access Confluence servers. It does not impact Confluence versions prior to 8.0.0. Confluence sites accessed via an atlassian.net domain are also not vulnerable to this issue. The enterprise software services provider  said  it was made aware of the issue by \"a handful of customers.\" It has been addressed in the following versions of Confluence Data Center and Server - 8.3.3 or later 8.4.3 or later, and 8.5.2 (Long Term Support release) or later The company, however, did not disclose any further specifics about the nature and scale of the exploitation, or the root cause of the vulnerability. Customers who are unable to apply the updates are advised..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/looney-tunables-new-linux-flaw-enables.html", "tags": "Endpoint Security / Vulnerability", "title": "Looney Tunables: New Linux Flaw Enables Privilege Escalation on Major Distributions", "desc": "A new Linux security vulnerability dubbed Looney Tunables has been discovered in the GNU C library's ld.so dynamic loader that, if successfully exploited, could lead to a local privilege escalation and allow a threat actor to gain root privileges. Tracked as  CVE-2023-4911  (CVSS score: 7.8), the issue is a buffer overflow that resides in the dynamic loader's processing of the  GLIBC_TUNABLES environment variable . Cybersecurity firm Qualys, which  disclosed  details of the bug, said it was introduced as part of a code commit made in April 2021. The GNU C library, also called  glibc , is a core library in Linux-based systems that offers foundational features such as open, read, write, malloc, printf, getaddrinfo, dlopen, pthread_create, crypt, login, and exit. glibc's  dynamic loader  is a crucial component that's responsible for preparing and running programs, including finding the necessarily shared object dependencies required as well as loading them into memory..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/arm-issues-patch-for-mali-gpu-kernel.html", "tags": "Cyber Attack / Vulnerability", "title": "Arm Issues Patch for Mali GPU Kernel Driver Vulnerability Amidst Ongoing Exploitation", "desc": "Arm has released security patches to contain a security flaw in the Mali GPU Kernel Driver that has come under active exploitation in the wild. Tracked as  CVE-2023-4211 , the shortcoming impacts the following driver versions - Midgard GPU Kernel Driver: All versions from r12p0 - r32p0 Bifrost GPU Kernel Driver: All versions from r0p0 - r42p0 Valhall GPU Kernel Driver: All versions from r19p0 - r42p0 Arm 5th Gen GPU Architecture Kernel Driver: All versions from r41p0 - r42p0 \"A local non-privileged user can make improper GPU memory processing operations to gain access to already freed memory,\" Arm  said  in a Monday advisory. \"There is evidence that this vulnerability may be under limited, targeted exploitation.\" The issue, credited to Maddie Stone of Google's Threat Analysis Group (TAG) and Jann Horn of Google Project Zero, has been addressed in Bifrost, Valhall and Arm 5th Gen GPU Architecture Kernel Driver r43p0. Google, in its own monthly  Androi..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/openrefines-zip-slip-vulnerability.html", "tags": "Vulnerability / Cyber Attack", "title": "OpenRefine's Zip Slip Vulnerability Could Let Attackers Execute Malicious Code", "desc": "A high-severity security flaw has been disclosed in the open-source OpenRefine data cleanup and transformation tool that could result in arbitrary code execution on affected systems. Tracked as  CVE-2023-37476  (CVSS score: 7.8), the vulnerability is a Zip Slip vulnerability that could have adverse impacts when importing a specially crafted project in versions 3.7.3 and below. \"Although OpenRefine is designed to only run locally on a user's machine, an attacker can trick a user into importing a malicious project file,\" Sonar security researcher Stefan Schiller  said  in a report published last week. \"Once this file is imported, the attacker can execute arbitrary code on the user's machine.\" Software prone to  Zip Slip vulnerabilities  can pave the way for code execution by taking advantage of a directory traversal bug that an attacker can exploit to gain access to parts of the file system that should be out of reach otherwise. The attack is built on tw..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/cisco-warns-of-vulnerability-in-ios-and.html", "tags": "Vulnerability / Network Security", "title": "Cisco Warns of Vulnerability in IOS and IOS XE Software After Exploitation Attempts", "desc": "Cisco is warning of attempted exploitation of a security flaw in its IOS Software and IOS XE Software that could permit an authenticated remote attacker to achieve remote code execution on affected systems. The medium-severity vulnerability is tracked as  CVE-2023-20109 , and has a CVSS score of 6.6. It impacts all versions of the software that have the GDOI or G-IKEv2 protocol enabled. The company  said  the shortcoming \"could allow an authenticated, remote attacker who has administrative control of either a group member or a key server to execute arbitrary code on an affected device or cause the device to crash.\" It further noted that the issue is the result of insufficient validation of attributes in the Group Domain of Interpretation (GDOI) and G-IKEv2 protocols of the GET VPN feature and it could be weaponized by either compromising an installed key server or modifying the configuration of a group member to point to a key server that is controlled by the attacker...."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/update-chrome-now-google-releases-patch.html", "tags": "Zero Day / Vulnerability", "title": "Update Chrome Now: Google Releases Patch for Actively Exploited Zero-Day Vulnerability", "desc": "Google on Wednesday rolled out fixes to address a new actively exploited zero-day in the Chrome browser. Tracked as  CVE-2023-5217 , the high-severity vulnerability has been described as a  heap-based buffer overflow  in the VP8 compression format in  libvpx , a free software  video codec  library from Google and the Alliance for Open Media (AOMedia). Exploitation of such buffer overflow flaws can result in program crashes or execution of arbitrary code, impacting its availability and integrity. Clément Lecigne of Google's Threat Analysis Group (TAG) has been credited with discovering and reporting the flaw on September 25, 2023, with fellow researcher Maddie Stone  noting  on X (formerly Twitter) that it has been abused by a commercial spyware vendor to target high-risk individuals. No additional details have been disclosed by the tech giant other than to acknowledge that it's \"aware that an exploit for CVE-2023-5217 exists in the wild.\" The latest discovery b..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/critical-jetbrains-teamcity-flaw-could.html", "tags": "Vulnerability / Source Code", "title": "Critical JetBrains TeamCity Flaw Could Expose Source Code and Build Pipelines to Attackers", "desc": "A critical security vulnerability in the JetBrains TeamCity continuous integration and continuous deployment (CI/CD) software could be exploited by unauthenticated attackers to achieve remote code execution on affected systems. The flaw, tracked as  CVE-2023-42793 , carries a CVSS score of 9.8 and has been addressed in  TeamCity version 2023.05.4  following responsible disclosure on September 6, 2023. \"Attackers could leverage this access to steal source code, service secrets, and private keys, take control over attached build agents, and poison build artifacts,\" Sonar security researcher Stefan Schiller  said  in a report last week. Successful exploitation of the bug could also permit threat actors to access the build pipelines and inject arbitrary code, leading to an integrity breach and supply chain compromise. It's worth noting that the shortcoming only affects on-premise versions of the JetBrains software. The TeamCity Cloud version has already been updated wit..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/latest-apple-zero-days-used-to-hack.html", "tags": "Zero Day / Vulnerability ", "title": "New Apple Zero-Days Exploited to Target Egyptian ex-MP with Predator Spyware", "desc": "The  three zero-day flaws  addressed by Apple on September 21, 2023, were leveraged as part of an iPhone exploit chain in an attempt to deliver a spyware strain called  Predator  targeting former Egyptian member of parliament Ahmed Eltantawy between May and September 2023. \"The targeting took place after Eltantawy publicly  stated his plans  to run for President in the 2024 Egyptian elections,\" the Citizen Lab  said , attributing the attack with high confidence to the Egyptian government owing to it being a known customer of the commercial spying tool. According to a joint investigation conducted by the Canadian interdisciplinary laboratory and Google's Threat Analysis Group (TAG), the mercenary surveillance tool is said to have been delivered via links sent on SMS and WhatsApp. \"In August and September 2023, Eltantawy's Vodafone Egypt mobile connection was persistently selected for targeting via network injection; when Eltantawy visited certain websites not..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/high-severity-flaws-uncovered-in.html", "tags": "Server Security / Vulnerability", "title": "High-Severity Flaws Uncovered in Atlassian Products and ISC BIND Server", "desc": "Atlassian and the Internet Systems Consortium (ISC) have disclosed several security flaws impacting their products that could be exploited to achieve denial-of-service (DoS) and remote code execution. The Australian software services provider  said  that the four high-severity flaws were fixed in new versions shipped last month. This includes - CVE-2022-25647  (CVSS score: 7.5) - A deserialization flaw in the Google Gson package impacting Patch Management in Jira Service Management Data Center and Server CVE-2023-22512  (CVSS score: 7.5) - A DoS flaw in Confluence Data Center and Server CVE-2023-22513  (CVSS score: 8.5) - A RCE flaw in Bitbucket Data Center and Server CVE-2023-28709  (CVSS score: 7.5) - A DoS flaw in Apache Tomcat server impacting Bamboo Data Center and Server The flaws have been addressed in the following versions - Jira Service Management Server and Data Center (versions 4.20.25, 5.4.9, 5.9.2, 5.10.1, 5.11.0, or later) Confluence Server and Data Center (v..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/apple-rushes-to-patch-3-new-zero-day.html", "tags": "Zero Day / Vulnerability ", "title": "Apple Rushes to Patch 3 New Zero-Day Flaws: iOS, macOS, Safari, and More Vulnerable", "desc": "Apple has released yet another round of security patches to address three actively exploited zero-day flaws impacting iOS, iPadOS, macOS, watchOS, and Safari, taking the total tally of zero-day bugs discovered in its software this year to 16. The list of security vulnerabilities is as follows - CVE-2023-41991  - A certificate validation issue in the Security framework that could allow a malicious app to bypass signature validation. CVE-2023-41992  - A security flaw in Kernel that could allow a local attacker to elevate their privileges. CVE-2023-41993  - A WebKit flaw that could result in arbitrary code execution when processing specially crafted web content. Apple did not provide additional specifics barring an acknowledgement that the \"issue may have been actively exploited against versions of iOS before iOS 16.7.\" The updates are available for the following devices and operating systems - iOS 16.7 and iPadOS 16.7  - iPhone 8 and later, iPad Pro (all models), iP..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/beware-fake-exploit-for-winrar.html", "tags": "Vulnerability / Exploit", "title": "Beware: Fake Exploit for WinRAR Vulnerability on GitHub Infects Users with Venom RAT", "desc": "A malicious actor released a fake proof-of-concept (PoC) exploit for a recently disclosed WinRAR vulnerability on GitHub with an aim to infect users who downloaded the code with Venom RAT malware. \"The fake PoC meant to exploit this WinRAR vulnerability was based on a publicly available PoC script that exploited a SQL injection vulnerability in an application called GeoServer, which is tracked as  CVE-2023-25157 ,\" Palo Alto Networks Unit 42 researcher Robert Falcone  said . While  bogus PoCs  have become a  well-documented gambit  for targeting the  research community , the cybersecurity firm suspected that the threat actors are opportunistically targeting other crooks who may be adopting the latest vulnerabilities into their arsenal. whalersplonk, the  GitHub account  that hosted the repository, is no longer accessible. The PoC is said to have been committed on August 21, 2023, four days after the vulnerability was publicly announced. CVE-2023-40477 relates to an  imp..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/do-you-really-trust-your-web.html", "tags": "Web Application Security", "title": "Do You Really Trust Your Web Application Supply Chain?", "desc": "Well, you shouldn't. It may already be hiding vulnerabilities. It's the modular nature of modern web applications that has made them so effective. They can call on dozens of third-party web components, JS frameworks, and open-source tools to deliver all the different functionalities that keep their customers happy, but this chain of dependencies is also what makes them so vulnerable. Many of those components in the web application supply chain are controlled by a third party—the company that created them. This means that no matter how rigorous you were with your own static code analysis, code reviews, penetration testing, and other SSDLC processes, most of your supply chain's security is in the hands of whoever built its third-party components. With their huge potential for weak spots, and their widespread use in the lucrative ecommerce, financial and medical industries, web application supply chains present a juicy target for cyber attackers. They can target any one of the doz..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/gitlab-releases-urgent-security-patches.html", "tags": "Vulnerability / Software Security", "title": "GitLab Releases Urgent Security Patches for Critical Vulnerability", "desc": "GitLab has shipped security patches to resolve a critical flaw that allows an attacker to run pipelines as another user. The issue, tracked as  CVE-2023-5009  (CVSS score: 9.6), impacts all versions of GitLab Enterprise Edition (EE) starting from 13.12 and prior to 16.2.7 as well as from 16.3 and before 16.3.4. \"It was possible for an attacker to  run pipelines  as an arbitrary user via scheduled security scan policies,\" GitLab  said  in an advisory. \"This was a bypass of  CVE-2023-3932  showing additional impact.\" Successful exploitation of CVE-2023-5009 could allow a threat actor to access sensitive information or leverage the elevated permissions of the impersonated user to modify source code or run arbitrary code on the system, leading to severe consequences. Security researcher Johan Carlsson (aka joaxcar) has been credited with discovering and reporting the flaw. CVE-2023-3932 was addressed by GitLab in early August 2023. The new vulnerability has been r..."}]