[{"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/api-security-trends-2023-have.html", "tags": "API Security / Data Security", "title": "API Security Trends 2023 – Have Organizations Improved their Security Posture?", "desc": "APIs, also known as application programming interfaces, serve as the backbone of modern software applications, enabling seamless communication and data exchange between different systems and platforms. They provide developers with an interface to interact with external services, allowing them to integrate various functionalities into their own applications. However, this increased reliance on APIs has also made them attractive targets for cybercriminals. In recent years, the rise of API breaches has become a growing concern in the world of cybersecurity. One of the main reasons behind the rise of API breaches is inadequate security measures implemented by developers and organizations. Many APIs are not properly secured, leaving them vulnerable to attacks. Moreover, hackers have developed sophisticated techniques that specifically target weaknesses within APIs. For example, they may leverage malicious code injections into requests or manipulate responses from an API endpoint to gain..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/10/apis-unveiling-silent-killer-of-cyber.html", "tags": "API Security / Penetration Testing", "title": "APIs: Unveiling the Silent Killer of Cyber Security Risk Across Industries", "desc": "Introduction In today's interconnected digital ecosystem, Application Programming Interfaces (APIs) play a pivotal role in enabling seamless communication and data exchange between various software applications and systems. APIs act as bridges, facilitating the sharing of information and functionalities. However, as the use of APIs continues to rise, they have become an increasingly attractive target for cybercriminals and a significant cybersecurity risk across various industries. This article dives into the world of APIs, exploring why they pose substantial cybersecurity challenges and providing real-world examples of API breaches across different sectors. Download  API Security Guide . The API Revolution The proliferation of cloud computing, mobile apps, and the Internet of Things (IoT) has accelerated the adoption of APIs. They serve as the building blocks of modern software applications, enabling developers to integrate third-party services, enhance functionalities, and c..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/09/key-cybersecurity-tools-that-can.html", "tags": "Data Breach / Password Security", "title": "Key Cybersecurity Tools That Can Mitigate the Cost of a Breach", "desc": "IBM's 2023 installment of their annual \" Cost of a Breach \" report has thrown up some interesting trends. Of course, breaches being costly is no longer news at this stage! What's interesting is the difference in how organizations respond to threats and which technologies are helping reduce the costs associated with every IT team's nightmare scenario.  The average cost of a breach rose once again to $4.45 million, increasing 15% over the last three years. Costs associated with escalation and detection have rocketed up 42% during the same period. With that in mind, I was surprised to learn that only 51% of the breached entities surveyed by IBM decided to bolster their security investments, despite the rising financial consequences of dealing with a breach. Headline stats around breach costs are interesting – but can digging into these trends actually help you save money? Organizations want to know where to invest their security budget and which technologies offer the bes..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/kroll-suffers-data-breach-employee.html", "tags": "Data Breach / SIM Swapping", "title": "Kroll Suffers Data Breach: Employee Falls Victim to SIM Swapping Attack", "desc": "Risk and financial advisory solutions provider Kroll on Friday disclosed that one of its employees fell victim to a \"highly sophisticated\" SIM swapping attack. The incident, which took place on August 19, 2023, targeted the employee's T-Mobile account, the company said. \"Specifically, T-Mobile, without any authority from or contact with Kroll or its employee, transferred that employee's phone number to the threat actor's phone at their request,\" it  said  in an advisory. This enabled the unidentified actor to gain access to certain files containing personal information of bankruptcy claimants in the matters of BlockFi , FTX , and Genesis. SIM swapping (aka SIM splitting or simjacking), while generally a benign process, could be exploited by threat actors to fraudulently activate a SIM card under their control with a victim's phone number. This makes it possible to intercept SMS messages and voice calls and receive MFA-related messages that cont..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/two-lapsus-hackers-convicted-in-london.html", "tags": "Cyber Crime / Data Breach", "title": "Two LAPSUS$ Hackers Convicted in London Court for High-Profile Tech Firm Hacks", "desc": "Two U.K. teenagers have been convicted by a jury in London for being part of the notorious LAPSUS$ (aka Slippy Spider) transnational gang and for orchestrating a series of brazen, high-profile hacks against major tech firms and demanding a ransom in exchange for not leaking the stolen information. This includes Arion Kurtaj (aka White, Breachbase, WhiteDoxbin, and TeaPotUberHacker), an 18-year-old from Oxford, and an unnamed minor, who began collaborating in July 2021 after having met online, BBC  reported  this week. Both the defendants were initially arrested and released under investigation in January 2022, only to be  re-arrested and charged  by the City of London Police in April 2022. Kurtaj was subsequently granted bail and moved to a hotel in Bicester after he was doxxed in an online cybercrime forum. He, however, continued his hacking spree, targeting companies like  Uber ,  Revolut , and  Rockstar Games , as a result of which he was  arrested again  in September. Another a..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/uk-electoral-commission-breach-exposes.html", "tags": "Data Breach / Cyber Attack", "title": "U.K. Electoral Commission Breach Exposes Voter Data of 40 Million Britons", "desc": "The U.K. Electoral Commission on Tuesday disclosed a \"complex\" cyber attack on its systems that went undetected for over a year, allowing the threat actors to access years worth of voter data belonging to 40 million people. \"The incident was identified in October 2022 after suspicious activity was detected on our systems,\" the regulator  said . \"It became clear that hostile actors had first accessed the systems in August 2021.\" The intrusion enabled unauthorized access to the Commission's servers hosting email, control systems, and copies of the electoral registers it maintains for research purposes. The identity of the intruders are presently unknown. The registers included the name and address of anyone in the U.K. who registered to vote between 2014 and 2022, as well as the names of those registered as overseas voters. However, they did not contain information of those who qualified to register anonymously and addresses of overseas electors regi..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/08/mysterious-team-bangladesh-targeting.html", "tags": "Cyber Attack / Data Safety", "title": "\"Mysterious Team Bangladesh\" Targeting India with DDoS Attacks and Data Breaches", "desc": "A hacktivist group known as  Mysterious Team Bangladesh  has been linked to over 750 distributed denial-of-service (DDoS) attacks and 78 website defacements since June 2022. \"The group most frequently attacks logistics, government, and financial sector organizations in India and Israel,\" Singapore-headquartered cybersecurity firm Group-IB said in a report shared with The Hacker News. \"The group is primarily driven by religious and political motives.\" Some of the other targeted countries include Australia, Senegal, the Netherlands, Sweden, and Ethiopia. In addition, the threat actor is said to have gained access to web servers and administrative panels, likely by exploiting known security flaws or poorly-secured passwords. Mysterious Team Bangladesh, as the name indicates, is suspected to be of Bangladeshi origin. \"We are working to protect Our Bangladesh Cyberspace,\" the group's Intro on Facebook  reads . The group has an active social media pre..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/cybersecurity-agencies-warn-against.html", "tags": "Software Security / Data Safety", "title": "Cybersecurity Agencies Warn Against IDOR Bugs Exploited for Data Breaches", "desc": "Cybersecurity agencies in Australia and the U.S. have  published  a joint cybersecurity advisory warning against security flaws in web applications that could be exploited by malicious actors to orchestrate data breach incidents and steal confidential data. This includes a specific class of bugs called Insecure Direct Object Reference ( IDOR ), a type of access control flaw that occurs when an application utilizes user-supplied input or an identifier for direct access to an internal resource, such as a database record, without any additional validations. A  typical example  of an IDOR flaw is the ability of a user to trivially change the URL (e.g., https://example[.]site/details.php?id= 12345 ) to obtain unauthorized data of another transaction (i.e., https://example[.]site/details.php?id= 67890 ). \"IDOR vulnerabilities are access control vulnerabilities enabling malicious actors to modify or delete data or access sensitive data by issuing requests to a website or a web appli..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/new-sec-rules-require-us-companies-to.html", "tags": "Data Breach / Cyber Attack", "title": "New SEC Rules Require U.S. Companies to Reveal Cyber Attacks Within 4 Days", "desc": "The U.S. Securities and Exchange Commission (SEC) on Wednesday approved new rules that require publicly traded companies to publicize details of a cyber attack within four days of identifying that it has a \"material\" impact on their finances, marking a major shift in how computer breaches are disclosed. \"Whether a company loses a factory in a fire — or millions of files in a cybersecurity incident — it may be material to investors,\" SEC chair Gary Gensler  said . \"Currently, many public companies provide cybersecurity disclosure to investors. I think companies and investors alike, however, would benefit if this disclosure were made in a more consistent, comparable, and decision-useful way.\" To that end, the new obligations mandate that companies reveal the incident's nature, scope, and timing, as well as its impact. This disclosure, however, may be delayed by an additional period of up to 60 days should it be determined that giving out such specific..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/how-to-protect-patients-and-their.html", "tags": "SaaS Security / Healthcare", "title": "How to Protect Patients and Their Privacy in Your SaaS Apps", "desc": "The healthcare industry is under a constant barrage of cyberattacks. It has traditionally been one of the most frequently targeted industries, and things haven't changed in 2023. The U.S. Government's Office for Civil Rights reported  145 data breaches  in the United States during the first quarter of this year. That follows 707 incidents a year ago, during which over 50 million records were stolen. Health records often include names, birth dates, social security numbers, and addresses. This treasure trove of data is used in identity theft, tax fraud, and other crimes. It is the high value of the data that makes healthcare applications such a promising target. The healthcare industry was hesitant to adopt SaaS applications. However, SaaS applications lead to better collaboration among medical professionals, leading to improved patient outcomes. That, combined with SaaS's ability to reduce costs and improve financial performance, has led to the industry fully embracing SaaS solutions..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/owner-of-breachforums-pleads-guilty-to.html", "tags": "Cybercrime / Data Breach", "title": "Owner of BreachForums Pleads Guilty to Cybercrime and Child Pornography Charges", "desc": "Conor Brian Fitzpatrick , the owner of the now-defunct BreachForums website, has pleaded guilty to charges related to his operation of the cybercrime forum as well as having child pornography images. The development,  first reported  by DataBreaches.net last week, comes nearly four months after Fitzpatrick (aka pompompurin) was  formally charged  in the U.S. with conspiracy to commit access device fraud and possession of child pornography. BreachForums, launched in March 2022, operated as an illegal marketplace that allowed its members to trade hacked or stolen databases, enabling other criminal actors to gain unauthorized access to target systems. It was shut down in March 2023 shortly after  Fitzpatrick's arrest  in New York. As many as 888 databases consisting of 14 billion individual records are estimated to have been found in total. The forum had over 333,000 members prior to its takedown. \"The purpose of BreachForums, and Fitzpatrick's intent in operating the f..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/jumpcloud-blames-sophisticated-nation.html", "tags": "Data Security / Cyber Attack", "title": "JumpCloud Blames 'Sophisticated Nation-State' Actor for Security Breach", "desc": "A little over a week after  JumpCloud reset API keys of customers  impacted by a security incident, the company said the intrusion was the work of a sophisticated nation-state actor. The adversary \"gained unauthorized access to our systems to target a small and specific set of our customers,\" Bob Phan, chief information security officer (CISO) at JumpCloud,  said  in a post-mortem report. \"The attack vector used by the threat actor has been mitigated.\" The U.S. enterprise software firm said it identified anomalous activity on June 27, 2023, on an internal orchestration system, which it traced back to a spear-phishing campaign mounted by the attacker on June 22. While JumpCloud said it took security steps to shield its network by rotating credentials and rebuilding its systems, it wasn't until July 5 when it detected \"unusual activity\" in the commands framework for a small set of customers, prompting a forced-rotation of all admin API keys. The num..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/07/jumpcloud-resets-api-keys-amid-ongoing.html", "tags": "Security Incident / API Security", "title": "JumpCloud Resets API Keys Amid Ongoing Cybersecurity Incident", "desc": "JumpCloud, a provider of cloud-based identity and access management solutions, has swiftly reacted to an ongoing cybersecurity incident that impacted some of its clients. As part of its damage control efforts, JumpCloud has reset the application programming interface (API) keys of all customers affected by this event, aiming to protect their valuable data. The company has informed the concerned clients about the critical nature of this move, reinforcing its commitment to safeguarding their operations and organizations. This API key reset will, however, disrupt certain functionalities like AD import, HRIS integrations, JumpCloud PowerShell modules, JumpCloud Slack apps, Directory Insights Serverless apps, ADMU, third-party zero-touch MDM packages, Command Triggers, Okta SCIM integration, Azure AD SCIM integration, Workato, Aquera, Tray, and more. Despite the potential disruptions, JumpCloud maintains that the key reset is for the greater good of its clients. For those needing assis..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/05/why-honeytokens-are-future-of-intrusion.html", "tags": "Intrusion Detection / Honeypot", "title": "Why Honeytokens Are the Future of Intrusion Detection", "desc": "A few weeks ago, the 32nd edition of RSA, one of the world's largest cybersecurity conferences, wrapped up in San Francisco. Among the highlights, Kevin Mandia, CEO of Mandiant at Google Cloud, presented a retrospective on  the state of cybersecurity . During his keynote, Mandia stated: \"There are clear steps organizations can take beyond common safeguards and security tools to strengthen their defenses and increase their chances of detecting, thwarting or minimizing attack [...] Honeypots , or fake accounts deliberately left untouched by authorized users,  are effective at helping organizations detect intrusions or malicious activities that security products can't stop \". \"Build honeypots\" was one of his seven pieces of advice to help organizations avoid some of the attacks that might require engagement with Mandiant or other incident response firms. As a reminder, honeypots are  decoy systems  that are set up to lure attackers and divert their attentio..."}, {"source": "TheHackerNews", "link": "https://thehackernews.com/2023/05/msi-data-breach-private-code-signing.html", "tags": "Data Breach / Software Security", "title": "MSI Data Breach: Private Code Signing Keys Leaked on the Dark Web", "desc": "The threat actors behind the ransomware attack on Taiwanese PC maker MSI last month have leaked the company's private code signing keys on their dark website. \"Confirmed, Intel OEM private key leaked, causing an impact on the entire ecosystem,\" Alex Matrosov, founder and CEO of firmware security firm Binarly,  said  in a tweet over the weekend. \"It appears that Intel Boot Guard may not be effective on certain devices based on the 11th Tiger Lake, 12th Adler Lake, and 13th Raptor Lake.\" Present in the leaked data are firmware image signing keys associated with 57 PCs and private signing keys for Intel Boot Guard used on 116 MSI products. The Boot Guard keys from MSI are believed to impact several device vendors, including Intel, Lenovo and Supermicro. Intel Boot Guard is a  hardware-based security technology  that's designed to protect computers against executing tampered UEFI firmware. The development comes a month after MSI  fell victim  to a double..."}]